module.exports = [
  {
    "id": 1,
    "val": "北京",
    "data": [
      {
        "id": 36,
        "val": "北京市",
        "data": [
          {
            "id": 37,
            "val": "东城区"
          },
          {
            "id": 38,
            "val": "西城区"
          },
          {
            "id": 41,
            "val": "朝阳区"
          },
          {
            "id": 42,
            "val": "丰台区"
          },
          {
            "id": 43,
            "val": "石景山区"
          },
          {
            "id": 44,
            "val": "海淀区"
          },
          {
            "id": 45,
            "val": "门头沟区"
          },
          {
            "id": 46,
            "val": "房山区"
          },
          {
            "id": 47,
            "val": "通州区"
          },
          {
            "id": 48,
            "val": "顺义区"
          },
          {
            "id": 49,
            "val": "昌平区"
          },
          {
            "id": 50,
            "val": "大兴区"
          },
          {
            "id": 51,
            "val": "怀柔区"
          },
          {
            "id": 52,
            "val": "平谷区"
          },
          {
            "id": 53,
            "val": "密云县"
          },
          {
            "id": 54,
            "val": "延庆县"
          },
          {
            "id": 566,
            "val": "其他"
          }
        ]
      }
    ]
  },
  {
    "id": 2,
    "val": "天津",
    "data": [
      {
        "id": 40,
        "val": "天津市",
        "data": [
          {
            "id": 55,
            "val": "和平区"
          },
          {
            "id": 56,
            "val": "河东区"
          },
          {
            "id": 57,
            "val": "河西区"
          },
          {
            "id": 58,
            "val": "南开区"
          },
          {
            "id": 59,
            "val": "河北区"
          },
          {
            "id": 60,
            "val": "红桥区"
          },
          {
            "id": 61,
            "val": "塘沽区"
          },
          {
            "id": 64,
            "val": "东丽区"
          },
          {
            "id": 65,
            "val": "西青区"
          },
          {
            "id": 66,
            "val": "津南区"
          },
          {
            "id": 67,
            "val": "北辰区"
          },
          {
            "id": 68,
            "val": "武清区"
          },
          {
            "id": 69,
            "val": "宝坻区"
          },
          {
            "id": 70,
            "val": "宁河县"
          },
          {
            "id": 71,
            "val": "静海县"
          },
          {
            "id": 72,
            "val": "蓟县"
          }
        ]
      }
    ]
  },
  {
    "id": 3,
    "val": "河北",
    "data": [
      {
        "id": 73,
        "val": "石家庄市",
        "data": [
          {
            "id": 1126,
            "val": "井陉县"
          },
          {
            "id": 1127,
            "val": "井陉矿区"
          },
          {
            "id": 1128,
            "val": "元氏县"
          },
          {
            "id": 1129,
            "val": "平山县"
          },
          {
            "id": 1130,
            "val": "新乐市"
          },
          {
            "id": 1131,
            "val": "新华区"
          },
          {
            "id": 1132,
            "val": "无极县"
          },
          {
            "id": 1133,
            "val": "晋州市"
          },
          {
            "id": 1134,
            "val": "栾城县"
          },
          {
            "id": 1135,
            "val": "桥东区"
          },
          {
            "id": 1136,
            "val": "桥西区"
          },
          {
            "id": 1137,
            "val": "正定县"
          },
          {
            "id": 1138,
            "val": "深泽县"
          },
          {
            "id": 1139,
            "val": "灵寿县"
          },
          {
            "id": 1140,
            "val": "藁城市"
          },
          {
            "id": 1141,
            "val": "行唐县"
          },
          {
            "id": 1142,
            "val": "裕华区"
          },
          {
            "id": 1143,
            "val": "赞皇县"
          },
          {
            "id": 1144,
            "val": "赵县"
          },
          {
            "id": 1145,
            "val": "辛集市"
          },
          {
            "id": 1146,
            "val": "长安区"
          },
          {
            "id": 1147,
            "val": "高邑县"
          },
          {
            "id": 1148,
            "val": "鹿泉市"
          }
        ]
      },
      {
        "id": 74,
        "val": "唐山市",
        "data": [
          {
            "id": 1149,
            "val": "丰南区"
          },
          {
            "id": 1150,
            "val": "丰润区"
          },
          {
            "id": 1151,
            "val": "乐亭县"
          },
          {
            "id": 1152,
            "val": "古冶区"
          },
          {
            "id": 1153,
            "val": "唐海县"
          },
          {
            "id": 1154,
            "val": "开平区"
          },
          {
            "id": 1155,
            "val": "滦南县"
          },
          {
            "id": 1156,
            "val": "滦县"
          },
          {
            "id": 1157,
            "val": "玉田县"
          },
          {
            "id": 1158,
            "val": "路北区"
          },
          {
            "id": 1159,
            "val": "路南区"
          },
          {
            "id": 1160,
            "val": "迁安市"
          },
          {
            "id": 1161,
            "val": "迁西县"
          },
          {
            "id": 1162,
            "val": "遵化市"
          }
        ]
      },
      {
        "id": 75,
        "val": "秦皇岛市",
        "data": [
          {
            "id": 1163,
            "val": "北戴河区"
          },
          {
            "id": 1164,
            "val": "卢龙县"
          },
          {
            "id": 1165,
            "val": "山海关区"
          },
          {
            "id": 1166,
            "val": "抚宁县"
          },
          {
            "id": 1167,
            "val": "昌黎县"
          },
          {
            "id": 1168,
            "val": "海港区"
          },
          {
            "id": 1169,
            "val": "青龙满族自治县"
          }
        ]
      },
      {
        "id": 76,
        "val": "邯郸市",
        "data": [
          {
            "id": 1170,
            "val": "丛台区"
          },
          {
            "id": 1171,
            "val": "临漳县"
          },
          {
            "id": 1172,
            "val": "复兴区"
          },
          {
            "id": 1173,
            "val": "大名县"
          },
          {
            "id": 1174,
            "val": "峰峰矿区"
          },
          {
            "id": 1175,
            "val": "广平县"
          },
          {
            "id": 1176,
            "val": "成安县"
          },
          {
            "id": 1177,
            "val": "曲周县"
          },
          {
            "id": 1178,
            "val": "武安市"
          },
          {
            "id": 1179,
            "val": "永年县"
          },
          {
            "id": 1180,
            "val": "涉县"
          },
          {
            "id": 1181,
            "val": "磁县"
          },
          {
            "id": 1182,
            "val": "肥乡县"
          },
          {
            "id": 1183,
            "val": "邯山区"
          },
          {
            "id": 1184,
            "val": "邯郸县"
          },
          {
            "id": 1185,
            "val": "邱县"
          },
          {
            "id": 1186,
            "val": "馆陶县"
          },
          {
            "id": 1187,
            "val": "魏县"
          },
          {
            "id": 1188,
            "val": "鸡泽县"
          }
        ]
      },
      {
        "id": 77,
        "val": "邢台市",
        "data": [
          {
            "id": 1189,
            "val": "临城县"
          },
          {
            "id": 1190,
            "val": "临西县"
          },
          {
            "id": 1191,
            "val": "任县"
          },
          {
            "id": 1192,
            "val": "内丘县"
          },
          {
            "id": 1193,
            "val": "南和县"
          },
          {
            "id": 1194,
            "val": "南宫市"
          },
          {
            "id": 1195,
            "val": "威县"
          },
          {
            "id": 1196,
            "val": "宁晋县"
          },
          {
            "id": 1197,
            "val": "巨鹿县"
          },
          {
            "id": 1198,
            "val": "平乡县"
          },
          {
            "id": 1199,
            "val": "广宗县"
          },
          {
            "id": 1200,
            "val": "新河县"
          },
          {
            "id": 1201,
            "val": "柏乡县"
          },
          {
            "id": 1202,
            "val": "桥东区"
          },
          {
            "id": 1203,
            "val": "桥西区"
          },
          {
            "id": 1204,
            "val": "沙河市"
          },
          {
            "id": 1205,
            "val": "清河县"
          },
          {
            "id": 1206,
            "val": "邢台县"
          },
          {
            "id": 1207,
            "val": "隆尧县"
          }
        ]
      },
      {
        "id": 78,
        "val": "保定市",
        "data": [
          {
            "id": 1208,
            "val": "北市区"
          },
          {
            "id": 1209,
            "val": "南市区"
          },
          {
            "id": 1210,
            "val": "博野县"
          },
          {
            "id": 1211,
            "val": "唐县"
          },
          {
            "id": 1212,
            "val": "安国市"
          },
          {
            "id": 1213,
            "val": "安新县"
          },
          {
            "id": 1214,
            "val": "定兴县"
          },
          {
            "id": 1215,
            "val": "定州市"
          },
          {
            "id": 1216,
            "val": "容城县"
          },
          {
            "id": 1217,
            "val": "徐水县"
          },
          {
            "id": 1218,
            "val": "新市区"
          },
          {
            "id": 1219,
            "val": "易县"
          },
          {
            "id": 1220,
            "val": "曲阳县"
          },
          {
            "id": 1221,
            "val": "望都县"
          },
          {
            "id": 1222,
            "val": "涞水县"
          },
          {
            "id": 1223,
            "val": "涞源县"
          },
          {
            "id": 1224,
            "val": "涿州市"
          },
          {
            "id": 1225,
            "val": "清苑县"
          },
          {
            "id": 1226,
            "val": "满城县"
          },
          {
            "id": 1227,
            "val": "蠡县"
          },
          {
            "id": 1228,
            "val": "阜平县"
          },
          {
            "id": 1229,
            "val": "雄县"
          },
          {
            "id": 1230,
            "val": "顺平县"
          },
          {
            "id": 1231,
            "val": "高碑店市"
          },
          {
            "id": 1232,
            "val": "高阳县"
          }
        ]
      },
      {
        "id": 79,
        "val": "张家口市",
        "data": [
          {
            "id": 1233,
            "val": "万全县"
          },
          {
            "id": 1234,
            "val": "下花园区"
          },
          {
            "id": 1235,
            "val": "宣化区"
          },
          {
            "id": 1236,
            "val": "宣化县"
          },
          {
            "id": 1237,
            "val": "尚义县"
          },
          {
            "id": 1238,
            "val": "崇礼县"
          },
          {
            "id": 1239,
            "val": "康保县"
          },
          {
            "id": 1240,
            "val": "张北县"
          },
          {
            "id": 1241,
            "val": "怀安县"
          },
          {
            "id": 1242,
            "val": "怀来县"
          },
          {
            "id": 1243,
            "val": "桥东区"
          },
          {
            "id": 1244,
            "val": "桥西区"
          },
          {
            "id": 1245,
            "val": "沽源县"
          },
          {
            "id": 1246,
            "val": "涿鹿县"
          },
          {
            "id": 1247,
            "val": "蔚县"
          },
          {
            "id": 1248,
            "val": "赤城县"
          },
          {
            "id": 1249,
            "val": "阳原县"
          }
        ]
      },
      {
        "id": 80,
        "val": "承德市",
        "data": [
          {
            "id": 1250,
            "val": "丰宁满族自治县"
          },
          {
            "id": 1251,
            "val": "兴隆县"
          },
          {
            "id": 1252,
            "val": "双桥区"
          },
          {
            "id": 1253,
            "val": "双滦区"
          },
          {
            "id": 1254,
            "val": "围场满族蒙古族自治县"
          },
          {
            "id": 1255,
            "val": "宽城满族自治县"
          },
          {
            "id": 1256,
            "val": "平泉县"
          },
          {
            "id": 1257,
            "val": "承德县"
          },
          {
            "id": 1258,
            "val": "滦平县"
          },
          {
            "id": 1259,
            "val": "隆化县"
          },
          {
            "id": 1260,
            "val": "鹰手营子矿区"
          }
        ]
      },
      {
        "id": 81,
        "val": "衡水市",
        "data": [
          {
            "id": 1261,
            "val": "冀州市"
          },
          {
            "id": 1262,
            "val": "安平县"
          },
          {
            "id": 1263,
            "val": "故城县"
          },
          {
            "id": 1264,
            "val": "景县"
          },
          {
            "id": 1265,
            "val": "枣强县"
          },
          {
            "id": 1266,
            "val": "桃城区"
          },
          {
            "id": 1267,
            "val": "武强县"
          },
          {
            "id": 1268,
            "val": "武邑县"
          },
          {
            "id": 1269,
            "val": "深州市"
          },
          {
            "id": 1270,
            "val": "阜城县"
          },
          {
            "id": 1271,
            "val": "饶阳县"
          }
        ]
      },
      {
        "id": 82,
        "val": "廊坊市",
        "data": [
          {
            "id": 1272,
            "val": "三河市"
          },
          {
            "id": 1273,
            "val": "固安县"
          },
          {
            "id": 1274,
            "val": "大厂回族自治县"
          },
          {
            "id": 1275,
            "val": "大城县"
          },
          {
            "id": 1276,
            "val": "安次区"
          },
          {
            "id": 1277,
            "val": "广阳区"
          },
          {
            "id": 1278,
            "val": "文安县"
          },
          {
            "id": 1279,
            "val": "永清县"
          },
          {
            "id": 1280,
            "val": "霸州市"
          },
          {
            "id": 1281,
            "val": "香河县"
          }
        ]
      },
      {
        "id": 83,
        "val": "沧州市",
        "data": [
          {
            "id": 1282,
            "val": "东光县"
          },
          {
            "id": 1283,
            "val": "任丘市"
          },
          {
            "id": 1284,
            "val": "南皮县"
          },
          {
            "id": 1285,
            "val": "吴桥县"
          },
          {
            "id": 1286,
            "val": "孟村回族自治县"
          },
          {
            "id": 1287,
            "val": "新华区"
          },
          {
            "id": 1288,
            "val": "沧县"
          },
          {
            "id": 1289,
            "val": "河间市"
          },
          {
            "id": 1290,
            "val": "泊头市"
          },
          {
            "id": 1291,
            "val": "海兴县"
          },
          {
            "id": 1292,
            "val": "献县"
          },
          {
            "id": 1293,
            "val": "盐山县"
          },
          {
            "id": 1294,
            "val": "肃宁县"
          },
          {
            "id": 1295,
            "val": "运河区"
          },
          {
            "id": 1296,
            "val": "青县"
          },
          {
            "id": 1297,
            "val": "黄骅市"
          }
        ]
      }
    ]
  },
  {
    "id": 4,
    "val": "山西",
    "data": [
      {
        "id": 84,
        "val": "太原市",
        "data": [
          {
            "id": 1298,
            "val": "万柏林区"
          },
          {
            "id": 1299,
            "val": "古交市"
          },
          {
            "id": 1300,
            "val": "娄烦县"
          },
          {
            "id": 1301,
            "val": "小店区"
          },
          {
            "id": 1302,
            "val": "尖草坪区"
          },
          {
            "id": 1303,
            "val": "晋源区"
          },
          {
            "id": 1304,
            "val": "杏花岭区"
          },
          {
            "id": 1305,
            "val": "清徐县"
          },
          {
            "id": 1306,
            "val": "迎泽区"
          },
          {
            "id": 1307,
            "val": "阳曲县"
          }
        ]
      },
      {
        "id": 85,
        "val": "大同市",
        "data": [
          {
            "id": 1308,
            "val": "南郊区"
          },
          {
            "id": 1309,
            "val": "城区"
          },
          {
            "id": 1310,
            "val": "大同县"
          },
          {
            "id": 1311,
            "val": "天镇县"
          },
          {
            "id": 1312,
            "val": "左云县"
          },
          {
            "id": 1313,
            "val": "广灵县"
          },
          {
            "id": 1314,
            "val": "新荣区"
          },
          {
            "id": 1315,
            "val": "浑源县"
          },
          {
            "id": 1316,
            "val": "灵丘县"
          },
          {
            "id": 1317,
            "val": "矿区"
          },
          {
            "id": 1318,
            "val": "阳高县"
          }
        ]
      },
      {
        "id": 86,
        "val": "阳泉市",
        "data": [
          {
            "id": 1319,
            "val": "城区"
          },
          {
            "id": 1320,
            "val": "平定县"
          },
          {
            "id": 1321,
            "val": "盂县"
          },
          {
            "id": 1322,
            "val": "矿区"
          },
          {
            "id": 1323,
            "val": "郊区"
          }
        ]
      },
      {
        "id": 87,
        "val": "长治市",
        "data": [
          {
            "id": 1324,
            "val": "城区"
          },
          {
            "id": 1325,
            "val": "壶关县"
          },
          {
            "id": 1326,
            "val": "屯留县"
          },
          {
            "id": 1327,
            "val": "平顺县"
          },
          {
            "id": 1328,
            "val": "武乡县"
          },
          {
            "id": 1329,
            "val": "沁县"
          },
          {
            "id": 1330,
            "val": "沁源县"
          },
          {
            "id": 1331,
            "val": "潞城市"
          },
          {
            "id": 1332,
            "val": "襄垣县"
          },
          {
            "id": 1333,
            "val": "郊区"
          },
          {
            "id": 1334,
            "val": "长子县"
          },
          {
            "id": 1335,
            "val": "长治县"
          },
          {
            "id": 1336,
            "val": "黎城县"
          }
        ]
      },
      {
        "id": 88,
        "val": "晋城市",
        "data": [
          {
            "id": 1337,
            "val": "城区"
          },
          {
            "id": 1338,
            "val": "沁水县"
          },
          {
            "id": 1339,
            "val": "泽州县"
          },
          {
            "id": 1340,
            "val": "阳城县"
          },
          {
            "id": 1341,
            "val": "陵川县"
          },
          {
            "id": 1342,
            "val": "高平市"
          }
        ]
      },
      {
        "id": 89,
        "val": "朔州市",
        "data": [
          {
            "id": 1343,
            "val": "右玉县"
          },
          {
            "id": 1344,
            "val": "山阴县"
          },
          {
            "id": 1345,
            "val": "平鲁区"
          },
          {
            "id": 1346,
            "val": "应县"
          },
          {
            "id": 1347,
            "val": "怀仁县"
          },
          {
            "id": 1348,
            "val": "朔城区"
          }
        ]
      },
      {
        "id": 90,
        "val": "晋中市",
        "data": [
          {
            "id": 1349,
            "val": "介休市"
          },
          {
            "id": 1350,
            "val": "和顺县"
          },
          {
            "id": 1351,
            "val": "太谷县"
          },
          {
            "id": 1352,
            "val": "寿阳县"
          },
          {
            "id": 1353,
            "val": "左权县"
          },
          {
            "id": 1354,
            "val": "平遥县"
          },
          {
            "id": 1355,
            "val": "昔阳县"
          },
          {
            "id": 1356,
            "val": "榆次区"
          },
          {
            "id": 1357,
            "val": "榆社县"
          },
          {
            "id": 1358,
            "val": "灵石县"
          },
          {
            "id": 1359,
            "val": "祁县"
          }
        ]
      },
      {
        "id": 91,
        "val": "运城市",
        "data": [
          {
            "id": 1360,
            "val": "万荣县"
          },
          {
            "id": 1361,
            "val": "临猗县"
          },
          {
            "id": 1362,
            "val": "垣曲县"
          },
          {
            "id": 1363,
            "val": "夏县"
          },
          {
            "id": 1364,
            "val": "平陆县"
          },
          {
            "id": 1365,
            "val": "新绛县"
          },
          {
            "id": 1366,
            "val": "永济市"
          },
          {
            "id": 1367,
            "val": "河津市"
          },
          {
            "id": 1368,
            "val": "盐湖区"
          },
          {
            "id": 1369,
            "val": "稷山县"
          },
          {
            "id": 1370,
            "val": "绛县"
          },
          {
            "id": 1371,
            "val": "芮城县"
          },
          {
            "id": 1372,
            "val": "闻喜县"
          }
        ]
      },
      {
        "id": 92,
        "val": "忻州市",
        "data": [
          {
            "id": 1373,
            "val": "五台县"
          },
          {
            "id": 1374,
            "val": "五寨县"
          },
          {
            "id": 1375,
            "val": "代县"
          },
          {
            "id": 1376,
            "val": "保德县"
          },
          {
            "id": 1377,
            "val": "偏关县"
          },
          {
            "id": 1378,
            "val": "原平市"
          },
          {
            "id": 1379,
            "val": "宁武县"
          },
          {
            "id": 1380,
            "val": "定襄县"
          },
          {
            "id": 1381,
            "val": "岢岚县"
          },
          {
            "id": 1382,
            "val": "忻府区"
          },
          {
            "id": 1383,
            "val": "河曲县"
          },
          {
            "id": 1384,
            "val": "神池县"
          },
          {
            "id": 1385,
            "val": "繁峙县"
          },
          {
            "id": 1386,
            "val": "静乐县"
          }
        ]
      },
      {
        "id": 93,
        "val": "临汾市",
        "data": [
          {
            "id": 1387,
            "val": "乡宁县"
          },
          {
            "id": 1388,
            "val": "侯马市"
          },
          {
            "id": 1389,
            "val": "古县"
          },
          {
            "id": 1390,
            "val": "吉县"
          },
          {
            "id": 1391,
            "val": "大宁县"
          },
          {
            "id": 1392,
            "val": "安泽县"
          },
          {
            "id": 1393,
            "val": "尧都区"
          },
          {
            "id": 1394,
            "val": "曲沃县"
          },
          {
            "id": 1395,
            "val": "永和县"
          },
          {
            "id": 1396,
            "val": "汾西县"
          },
          {
            "id": 1397,
            "val": "洪洞县"
          },
          {
            "id": 1398,
            "val": "浮山县"
          },
          {
            "id": 1399,
            "val": "翼城县"
          },
          {
            "id": 1400,
            "val": "蒲县"
          },
          {
            "id": 1401,
            "val": "襄汾县"
          },
          {
            "id": 1402,
            "val": "隰县"
          },
          {
            "id": 1403,
            "val": "霍州市"
          }
        ]
      },
      {
        "id": 94,
        "val": "吕梁市",
        "data": [
          {
            "id": 1404,
            "val": "中阳县"
          },
          {
            "id": 1405,
            "val": "临县"
          },
          {
            "id": 1406,
            "val": "交口县"
          },
          {
            "id": 1407,
            "val": "交城县"
          },
          {
            "id": 1408,
            "val": "兴县"
          },
          {
            "id": 1409,
            "val": "孝义市"
          },
          {
            "id": 1410,
            "val": "岚县"
          },
          {
            "id": 1411,
            "val": "文水县"
          },
          {
            "id": 1412,
            "val": "方山县"
          },
          {
            "id": 1413,
            "val": "柳林县"
          },
          {
            "id": 1414,
            "val": "汾阳市"
          },
          {
            "id": 1415,
            "val": "石楼县"
          },
          {
            "id": 1416,
            "val": "离石区"
          }
        ]
      }
    ]
  },
  {
    "id": 5,
    "val": "内蒙古",
    "data": [
      {
        "id": 95,
        "val": "呼和浩特市",
        "data": [
          {
            "id": 1417,
            "val": "和林格尔县"
          },
          {
            "id": 1418,
            "val": "回民区"
          },
          {
            "id": 1419,
            "val": "土默特左旗"
          },
          {
            "id": 1420,
            "val": "托克托县"
          },
          {
            "id": 1421,
            "val": "新城区"
          },
          {
            "id": 1422,
            "val": "武川县"
          },
          {
            "id": 1423,
            "val": "清水河县"
          },
          {
            "id": 1424,
            "val": "玉泉区"
          },
          {
            "id": 1425,
            "val": "赛罕区"
          }
        ]
      },
      {
        "id": 96,
        "val": "包头市",
        "data": [
          {
            "id": 1426,
            "val": "东河区"
          },
          {
            "id": 1427,
            "val": "九原区"
          },
          {
            "id": 1428,
            "val": "固阳县"
          },
          {
            "id": 1429,
            "val": "土默特右旗"
          },
          {
            "id": 1430,
            "val": "昆都仑区"
          },
          {
            "id": 1431,
            "val": "白云矿区"
          },
          {
            "id": 1432,
            "val": "石拐区"
          },
          {
            "id": 1433,
            "val": "达尔罕茂明安联合旗"
          },
          {
            "id": 1434,
            "val": "青山区"
          }
        ]
      },
      {
        "id": 97,
        "val": "乌海市",
        "data": [
          {
            "id": 1435,
            "val": "乌达区"
          },
          {
            "id": 1436,
            "val": "海勃湾区"
          },
          {
            "id": 1437,
            "val": "海南区"
          }
        ]
      },
      {
        "id": 98,
        "val": "赤峰市",
        "data": [
          {
            "id": 1438,
            "val": "元宝山区"
          },
          {
            "id": 1439,
            "val": "克什克腾旗"
          },
          {
            "id": 1440,
            "val": "喀喇沁旗"
          },
          {
            "id": 1441,
            "val": "宁城县"
          },
          {
            "id": 1442,
            "val": "巴林右旗"
          },
          {
            "id": 1443,
            "val": "巴林左旗"
          },
          {
            "id": 1444,
            "val": "敖汉旗"
          },
          {
            "id": 1445,
            "val": "松山区"
          },
          {
            "id": 1446,
            "val": "林西县"
          },
          {
            "id": 1447,
            "val": "红山区"
          },
          {
            "id": 1448,
            "val": "翁牛特旗"
          },
          {
            "id": 1449,
            "val": "阿鲁科尔沁旗"
          }
        ]
      },
      {
        "id": 99,
        "val": "通辽市",
        "data": [
          {
            "id": 1450,
            "val": "奈曼旗"
          },
          {
            "id": 1451,
            "val": "库伦旗"
          },
          {
            "id": 1452,
            "val": "开鲁县"
          },
          {
            "id": 1453,
            "val": "扎鲁特旗"
          },
          {
            "id": 1454,
            "val": "科尔沁区"
          },
          {
            "id": 1455,
            "val": "科尔沁左翼中旗"
          },
          {
            "id": 1456,
            "val": "科尔沁左翼后旗"
          },
          {
            "id": 1457,
            "val": "霍林郭勒市"
          }
        ]
      },
      {
        "id": 100,
        "val": "鄂尔多斯市",
        "data": [
          {
            "id": 1458,
            "val": "东胜区"
          },
          {
            "id": 1459,
            "val": "乌审旗"
          },
          {
            "id": 1460,
            "val": "伊金霍洛旗"
          },
          {
            "id": 1461,
            "val": "准格尔旗"
          },
          {
            "id": 1462,
            "val": "杭锦旗"
          },
          {
            "id": 1463,
            "val": "达拉特旗"
          },
          {
            "id": 1464,
            "val": "鄂东胜区"
          },
          {
            "id": 1465,
            "val": "鄂托克前旗"
          },
          {
            "id": 1466,
            "val": "鄂托克旗"
          }
        ]
      },
      {
        "id": 101,
        "val": "呼伦贝尔市",
        "data": [
          {
            "id": 1467,
            "val": "扎兰屯市"
          },
          {
            "id": 1468,
            "val": "新巴尔虎右旗"
          },
          {
            "id": 1469,
            "val": "新巴尔虎左旗"
          },
          {
            "id": 1470,
            "val": "根河市"
          },
          {
            "id": 1471,
            "val": "海拉尔区"
          },
          {
            "id": 1472,
            "val": "满洲里市"
          },
          {
            "id": 1473,
            "val": "牙克石市"
          },
          {
            "id": 1474,
            "val": "莫力达瓦达斡尔族自治旗"
          },
          {
            "id": 1475,
            "val": "鄂伦春自治旗"
          },
          {
            "id": 1476,
            "val": "鄂温克族自治旗"
          },
          {
            "id": 1477,
            "val": "阿荣旗"
          },
          {
            "id": 1478,
            "val": "陈巴尔虎旗"
          },
          {
            "id": 1479,
            "val": "额尔古纳市"
          }
        ]
      },
      {
        "id": 102,
        "val": "巴彦淖尔市",
        "data": [
          {
            "id": 1480,
            "val": "临河区"
          },
          {
            "id": 1481,
            "val": "乌拉特中旗"
          },
          {
            "id": 1482,
            "val": "乌拉特前旗"
          },
          {
            "id": 1483,
            "val": "乌拉特后旗"
          },
          {
            "id": 1484,
            "val": "五原县"
          },
          {
            "id": 1485,
            "val": "杭锦后旗"
          },
          {
            "id": 1486,
            "val": "磴口县"
          }
        ]
      },
      {
        "id": 103,
        "val": "乌兰察布市",
        "data": [
          {
            "id": 1487,
            "val": "丰镇市"
          },
          {
            "id": 1488,
            "val": "兴和县"
          },
          {
            "id": 1489,
            "val": "凉城县"
          },
          {
            "id": 1490,
            "val": "化德县"
          },
          {
            "id": 1491,
            "val": "卓资县"
          },
          {
            "id": 1492,
            "val": "商都县"
          },
          {
            "id": 1493,
            "val": "四子王旗"
          },
          {
            "id": 1494,
            "val": "察哈尔右翼中旗"
          },
          {
            "id": 1495,
            "val": "察哈尔右翼前旗"
          },
          {
            "id": 1496,
            "val": "察哈尔右翼后旗"
          },
          {
            "id": 1497,
            "val": "集宁区"
          }
        ]
      },
      {
        "id": 104,
        "val": "兴安盟",
        "data": [
          {
            "id": 1498,
            "val": "乌兰浩特市"
          },
          {
            "id": 1499,
            "val": "扎赉特旗"
          },
          {
            "id": 1500,
            "val": "科尔沁右翼中旗"
          },
          {
            "id": 1501,
            "val": "科尔沁右翼前旗"
          },
          {
            "id": 1502,
            "val": "突泉县"
          },
          {
            "id": 1503,
            "val": "阿尔山市"
          }
        ]
      },
      {
        "id": 105,
        "val": "锡林郭勒盟",
        "data": [
          {
            "id": 1504,
            "val": "东乌珠穆沁旗"
          },
          {
            "id": 1505,
            "val": "二连浩特市"
          },
          {
            "id": 1506,
            "val": "多伦县"
          },
          {
            "id": 1507,
            "val": "太仆寺旗"
          },
          {
            "id": 1508,
            "val": "正蓝旗"
          },
          {
            "id": 1509,
            "val": "正镶白旗"
          },
          {
            "id": 1510,
            "val": "苏尼特右旗"
          },
          {
            "id": 1511,
            "val": "苏尼特左旗"
          },
          {
            "id": 1512,
            "val": "西乌珠穆沁旗"
          },
          {
            "id": 1513,
            "val": "锡林浩特市"
          },
          {
            "id": 1514,
            "val": "镶黄旗"
          },
          {
            "id": 1515,
            "val": "阿巴嘎旗"
          }
        ]
      },
      {
        "id": 106,
        "val": "阿拉善盟",
        "data": [
          {
            "id": 1516,
            "val": "阿拉善右旗"
          },
          {
            "id": 1517,
            "val": "阿拉善左旗"
          },
          {
            "id": 1518,
            "val": "额济纳旗"
          }
        ]
      }
    ]
  },
  {
    "id": 6,
    "val": "辽宁",
    "data": [
      {
        "id": 107,
        "val": "沈阳市",
        "data": [
          {
            "id": 1519,
            "val": "东陵区"
          },
          {
            "id": 1520,
            "val": "于洪区"
          },
          {
            "id": 1521,
            "val": "和平区"
          },
          {
            "id": 1522,
            "val": "大东区"
          },
          {
            "id": 1523,
            "val": "康平县"
          },
          {
            "id": 1524,
            "val": "新民市"
          },
          {
            "id": 1525,
            "val": "沈北新区"
          },
          {
            "id": 1526,
            "val": "沈河区"
          },
          {
            "id": 1527,
            "val": "法库县"
          },
          {
            "id": 1528,
            "val": "皇姑区"
          },
          {
            "id": 1529,
            "val": "苏家屯区"
          },
          {
            "id": 1530,
            "val": "辽中县"
          },
          {
            "id": 1531,
            "val": "铁西区"
          }
        ]
      },
      {
        "id": 108,
        "val": "大连市",
        "data": [
          {
            "id": 1532,
            "val": "中山区"
          },
          {
            "id": 1533,
            "val": "庄河市"
          },
          {
            "id": 1534,
            "val": "旅顺口区"
          },
          {
            "id": 1535,
            "val": "普兰店市"
          },
          {
            "id": 1536,
            "val": "沙河口区"
          },
          {
            "id": 1537,
            "val": "瓦房店市"
          },
          {
            "id": 1538,
            "val": "甘井子区"
          },
          {
            "id": 1539,
            "val": "西岗区"
          },
          {
            "id": 1540,
            "val": "金州区"
          },
          {
            "id": 1541,
            "val": "长海县"
          }
        ]
      },
      {
        "id": 109,
        "val": "鞍山市",
        "data": [
          {
            "id": 1542,
            "val": "千山区"
          },
          {
            "id": 1543,
            "val": "台安县"
          },
          {
            "id": 1544,
            "val": "岫岩满族自治县"
          },
          {
            "id": 1545,
            "val": "海城市"
          },
          {
            "id": 1546,
            "val": "立山区"
          },
          {
            "id": 1547,
            "val": "铁东区"
          },
          {
            "id": 1548,
            "val": "铁西区"
          }
        ]
      },
      {
        "id": 110,
        "val": "抚顺市",
        "data": [
          {
            "id": 1549,
            "val": "东洲区"
          },
          {
            "id": 1550,
            "val": "抚顺县"
          },
          {
            "id": 1551,
            "val": "新宾满族自治县"
          },
          {
            "id": 1552,
            "val": "新抚区"
          },
          {
            "id": 1553,
            "val": "望花区"
          },
          {
            "id": 1554,
            "val": "清原满族自治县"
          },
          {
            "id": 1555,
            "val": "顺城区"
          }
        ]
      },
      {
        "id": 111,
        "val": "本溪市",
        "data": [
          {
            "id": 1556,
            "val": "南芬区"
          },
          {
            "id": 1557,
            "val": "平山区"
          },
          {
            "id": 1558,
            "val": "明山区"
          },
          {
            "id": 1559,
            "val": "本溪满族自治县"
          },
          {
            "id": 1560,
            "val": "桓仁满族自治县"
          },
          {
            "id": 1561,
            "val": "溪湖区"
          }
        ]
      },
      {
        "id": 112,
        "val": "丹东市",
        "data": [
          {
            "id": 1562,
            "val": "东港市"
          },
          {
            "id": 1563,
            "val": "元宝区"
          },
          {
            "id": 1564,
            "val": "凤城市"
          },
          {
            "id": 1565,
            "val": "宽甸满族自治县"
          },
          {
            "id": 1566,
            "val": "振兴区"
          },
          {
            "id": 1567,
            "val": "振安区"
          }
        ]
      },
      {
        "id": 113,
        "val": "锦州市",
        "data": [
          {
            "id": 1568,
            "val": "义县"
          },
          {
            "id": 1569,
            "val": "凌河区"
          },
          {
            "id": 1570,
            "val": "凌海市"
          },
          {
            "id": 1571,
            "val": "北镇市"
          },
          {
            "id": 1572,
            "val": "古塔区"
          },
          {
            "id": 1573,
            "val": "太和区"
          },
          {
            "id": 1574,
            "val": "黑山县"
          }
        ]
      },
      {
        "id": 114,
        "val": "营口市",
        "data": [
          {
            "id": 1575,
            "val": "大石桥市"
          },
          {
            "id": 1576,
            "val": "盖州市"
          },
          {
            "id": 1577,
            "val": "站前区"
          },
          {
            "id": 1578,
            "val": "老边区"
          },
          {
            "id": 1579,
            "val": "西市区"
          },
          {
            "id": 1580,
            "val": "鲅鱼圈区"
          }
        ]
      },
      {
        "id": 115,
        "val": "阜新市",
        "data": [
          {
            "id": 1581,
            "val": "太平区"
          },
          {
            "id": 1582,
            "val": "彰武县"
          },
          {
            "id": 1583,
            "val": "新邱区"
          },
          {
            "id": 1584,
            "val": "海州区"
          },
          {
            "id": 1585,
            "val": "清河门区"
          },
          {
            "id": 1586,
            "val": "细河区"
          },
          {
            "id": 1587,
            "val": "蒙古族自治县"
          }
        ]
      },
      {
        "id": 116,
        "val": "辽阳市",
        "data": [
          {
            "id": 1588,
            "val": "太子河区"
          },
          {
            "id": 1589,
            "val": "宏伟区"
          },
          {
            "id": 1590,
            "val": "弓长岭区"
          },
          {
            "id": 1591,
            "val": "文圣区"
          },
          {
            "id": 1592,
            "val": "灯塔市"
          },
          {
            "id": 1593,
            "val": "白塔区"
          },
          {
            "id": 1594,
            "val": "辽阳县"
          }
        ]
      },
      {
        "id": 117,
        "val": "盘锦市",
        "data": [
          {
            "id": 1595,
            "val": "兴隆台区"
          },
          {
            "id": 1596,
            "val": "双台子区"
          },
          {
            "id": 1597,
            "val": "大洼县"
          },
          {
            "id": 1598,
            "val": "盘山县"
          }
        ]
      },
      {
        "id": 118,
        "val": "铁岭市",
        "data": [
          {
            "id": 1599,
            "val": "开原市"
          },
          {
            "id": 1600,
            "val": "昌图县"
          },
          {
            "id": 1601,
            "val": "清河区"
          },
          {
            "id": 1602,
            "val": "西丰县"
          },
          {
            "id": 1603,
            "val": "调兵山市"
          },
          {
            "id": 1604,
            "val": "铁岭县"
          },
          {
            "id": 1605,
            "val": "银州区"
          }
        ]
      },
      {
        "id": 119,
        "val": "朝阳市",
        "data": [
          {
            "id": 1606,
            "val": "凌源市"
          },
          {
            "id": 1607,
            "val": "北票市"
          },
          {
            "id": 1608,
            "val": "双塔区"
          },
          {
            "id": 1609,
            "val": "喀喇沁左翼蒙古族自治县"
          },
          {
            "id": 1610,
            "val": "建平县"
          },
          {
            "id": 1611,
            "val": "朝阳县"
          },
          {
            "id": 1612,
            "val": "龙城区"
          }
        ]
      },
      {
        "id": 120,
        "val": "葫芦岛市",
        "data": [
          {
            "id": 1613,
            "val": "兴城市"
          },
          {
            "id": 1614,
            "val": "南票区"
          },
          {
            "id": 1615,
            "val": "建昌县"
          },
          {
            "id": 1616,
            "val": "绥中县"
          },
          {
            "id": 1617,
            "val": "连山区"
          },
          {
            "id": 1618,
            "val": "龙港区"
          }
        ]
      }
    ]
  },
  {
    "id": 7,
    "val": "吉林",
    "data": [
      {
        "id": 121,
        "val": "长春市",
        "data": [
          {
            "id": 1619,
            "val": "九台市"
          },
          {
            "id": 1620,
            "val": "二道区"
          },
          {
            "id": 1621,
            "val": "农安县"
          },
          {
            "id": 1622,
            "val": "南关区"
          },
          {
            "id": 1623,
            "val": "双阳区"
          },
          {
            "id": 1624,
            "val": "宽城区"
          },
          {
            "id": 1625,
            "val": "德惠市"
          },
          {
            "id": 1626,
            "val": "朝阳区"
          },
          {
            "id": 1627,
            "val": "榆树市"
          },
          {
            "id": 1628,
            "val": "绿园区"
          }
        ]
      },
      {
        "id": 122,
        "val": "吉林市",
        "data": [
          {
            "id": 1629,
            "val": "丰满区"
          },
          {
            "id": 1630,
            "val": "昌邑区"
          },
          {
            "id": 1631,
            "val": "桦甸市"
          },
          {
            "id": 1632,
            "val": "永吉县"
          },
          {
            "id": 1633,
            "val": "磐石市"
          },
          {
            "id": 1634,
            "val": "舒兰市"
          },
          {
            "id": 1635,
            "val": "船营区"
          },
          {
            "id": 1636,
            "val": "蛟河市"
          },
          {
            "id": 1637,
            "val": "龙潭区"
          }
        ]
      },
      {
        "id": 123,
        "val": "四平市",
        "data": [
          {
            "id": 1638,
            "val": "伊通满族自治县"
          },
          {
            "id": 1639,
            "val": "公主岭市"
          },
          {
            "id": 1640,
            "val": "双辽市"
          },
          {
            "id": 1641,
            "val": "梨树县"
          },
          {
            "id": 1642,
            "val": "铁东区"
          },
          {
            "id": 1643,
            "val": "铁西区"
          }
        ]
      },
      {
        "id": 124,
        "val": "辽源市",
        "data": [
          {
            "id": 1644,
            "val": "东丰县"
          },
          {
            "id": 1645,
            "val": "东辽县"
          },
          {
            "id": 1646,
            "val": "西安区"
          },
          {
            "id": 1647,
            "val": "龙山区"
          }
        ]
      },
      {
        "id": 125,
        "val": "通化市",
        "data": [
          {
            "id": 1648,
            "val": "东昌区"
          },
          {
            "id": 1649,
            "val": "二道江区"
          },
          {
            "id": 1650,
            "val": "柳河县"
          },
          {
            "id": 1651,
            "val": "梅河口市"
          },
          {
            "id": 1652,
            "val": "辉南县"
          },
          {
            "id": 1653,
            "val": "通化县"
          },
          {
            "id": 1654,
            "val": "集安市"
          }
        ]
      },
      {
        "id": 126,
        "val": "白山市",
        "data": [
          {
            "id": 1655,
            "val": "临江市"
          },
          {
            "id": 1656,
            "val": "八道江区"
          },
          {
            "id": 1657,
            "val": "抚松县"
          },
          {
            "id": 1658,
            "val": "江源区"
          },
          {
            "id": 1659,
            "val": "长白朝鲜族自治县"
          },
          {
            "id": 1660,
            "val": "靖宇县"
          }
        ]
      },
      {
        "id": 127,
        "val": "松原市",
        "data": [
          {
            "id": 1661,
            "val": "干安县"
          },
          {
            "id": 1662,
            "val": "前郭尔罗斯蒙古族自治县"
          },
          {
            "id": 1663,
            "val": "宁江区"
          },
          {
            "id": 1664,
            "val": "扶余县"
          },
          {
            "id": 1665,
            "val": "长岭县"
          }
        ]
      },
      {
        "id": 128,
        "val": "白城市",
        "data": [
          {
            "id": 1666,
            "val": "大安市"
          },
          {
            "id": 1667,
            "val": "洮北区"
          },
          {
            "id": 1668,
            "val": "洮南市"
          },
          {
            "id": 1669,
            "val": "通榆县"
          },
          {
            "id": 1670,
            "val": "镇赉县"
          }
        ]
      },
      {
        "id": 129,
        "val": "延边朝鲜族自治州",
        "data": [
          {
            "id": 1671,
            "val": "和龙市"
          },
          {
            "id": 1672,
            "val": "图们市"
          },
          {
            "id": 1673,
            "val": "安图县"
          },
          {
            "id": 1674,
            "val": "延吉市"
          },
          {
            "id": 1675,
            "val": "敦化市"
          },
          {
            "id": 1676,
            "val": "汪清县"
          },
          {
            "id": 1677,
            "val": "珲春市"
          },
          {
            "id": 1678,
            "val": "龙井市"
          }
        ]
      }
    ]
  },
  {
    "id": 8,
    "val": "黑龙江",
    "data": [
      {
        "id": 130,
        "val": "哈尔滨市",
        "data": [
          {
            "id": 1679,
            "val": "五常市"
          },
          {
            "id": 1680,
            "val": "依兰县"
          },
          {
            "id": 1681,
            "val": "南岗区"
          },
          {
            "id": 1682,
            "val": "双城市"
          },
          {
            "id": 1683,
            "val": "呼兰区"
          },
          {
            "id": 1684,
            "val": "哈尔滨市道里区"
          },
          {
            "id": 1685,
            "val": "宾县"
          },
          {
            "id": 1686,
            "val": "尚志市"
          },
          {
            "id": 1687,
            "val": "巴彦县"
          },
          {
            "id": 1688,
            "val": "平房区"
          },
          {
            "id": 1689,
            "val": "延寿县"
          },
          {
            "id": 1690,
            "val": "方正县"
          },
          {
            "id": 1691,
            "val": "木兰县"
          },
          {
            "id": 1692,
            "val": "松北区"
          },
          {
            "id": 1693,
            "val": "通河县"
          },
          {
            "id": 1694,
            "val": "道外区"
          },
          {
            "id": 1695,
            "val": "阿城区"
          },
          {
            "id": 1696,
            "val": "香坊区"
          }
        ]
      },
      {
        "id": 131,
        "val": "齐齐哈尔市",
        "data": [
          {
            "id": 1697,
            "val": "依安县"
          },
          {
            "id": 1698,
            "val": "克东县"
          },
          {
            "id": 1699,
            "val": "克山县"
          },
          {
            "id": 1700,
            "val": "富拉尔基区"
          },
          {
            "id": 1701,
            "val": "富裕县"
          },
          {
            "id": 1702,
            "val": "建华区"
          },
          {
            "id": 1703,
            "val": "拜泉县"
          },
          {
            "id": 1704,
            "val": "昂昂溪区"
          },
          {
            "id": 1705,
            "val": "梅里斯达斡尔族区"
          },
          {
            "id": 1706,
            "val": "泰来县"
          },
          {
            "id": 1707,
            "val": "甘南县"
          },
          {
            "id": 1708,
            "val": "碾子山区"
          },
          {
            "id": 1709,
            "val": "讷河市"
          },
          {
            "id": 1710,
            "val": "铁锋区"
          },
          {
            "id": 1711,
            "val": "龙江县"
          },
          {
            "id": 1712,
            "val": "龙沙区"
          }
        ]
      },
      {
        "id": 132,
        "val": "鸡西市",
        "data": [
          {
            "id": 1713,
            "val": "城子河区"
          },
          {
            "id": 1714,
            "val": "密山市"
          },
          {
            "id": 1715,
            "val": "恒山区"
          },
          {
            "id": 1716,
            "val": "梨树区"
          },
          {
            "id": 1717,
            "val": "滴道区"
          },
          {
            "id": 1718,
            "val": "虎林市"
          },
          {
            "id": 1719,
            "val": "鸡东县"
          },
          {
            "id": 1720,
            "val": "鸡冠区"
          },
          {
            "id": 1721,
            "val": "麻山区"
          }
        ]
      },
      {
        "id": 133,
        "val": "鹤岗市",
        "data": [
          {
            "id": 1722,
            "val": "东山区"
          },
          {
            "id": 1723,
            "val": "兴安区"
          },
          {
            "id": 1724,
            "val": "兴山区"
          },
          {
            "id": 1725,
            "val": "南山区"
          },
          {
            "id": 1726,
            "val": "向阳区"
          },
          {
            "id": 1727,
            "val": "工农区"
          },
          {
            "id": 1728,
            "val": "绥滨县"
          },
          {
            "id": 1729,
            "val": "萝北县"
          }
        ]
      },
      {
        "id": 134,
        "val": "双鸭山市",
        "data": [
          {
            "id": 1730,
            "val": "友谊县"
          },
          {
            "id": 1731,
            "val": "四方台区"
          },
          {
            "id": 1732,
            "val": "宝山区"
          },
          {
            "id": 1733,
            "val": "宝清县"
          },
          {
            "id": 1734,
            "val": "尖山区"
          },
          {
            "id": 1735,
            "val": "岭东区"
          },
          {
            "id": 1736,
            "val": "集贤县"
          },
          {
            "id": 1737,
            "val": "饶河县"
          }
        ]
      },
      {
        "id": 135,
        "val": "大庆市",
        "data": [
          {
            "id": 1738,
            "val": "大同区"
          },
          {
            "id": 1739,
            "val": "杜尔伯特蒙古族自治县"
          },
          {
            "id": 1740,
            "val": "林甸县"
          },
          {
            "id": 1741,
            "val": "红岗区"
          },
          {
            "id": 1742,
            "val": "肇州县"
          },
          {
            "id": 1743,
            "val": "肇源县"
          },
          {
            "id": 1744,
            "val": "胡路区"
          },
          {
            "id": 1745,
            "val": "萨尔图区"
          },
          {
            "id": 1746,
            "val": "龙凤区"
          }
        ]
      },
      {
        "id": 136,
        "val": "伊春市",
        "data": [
          {
            "id": 1747,
            "val": "上甘岭区"
          },
          {
            "id": 1748,
            "val": "乌伊岭区"
          },
          {
            "id": 1749,
            "val": "乌马河区"
          },
          {
            "id": 1750,
            "val": "五营区"
          },
          {
            "id": 1751,
            "val": "伊春区"
          },
          {
            "id": 1752,
            "val": "南岔区"
          },
          {
            "id": 1753,
            "val": "友好区"
          },
          {
            "id": 1754,
            "val": "嘉荫县"
          },
          {
            "id": 1755,
            "val": "带岭区"
          },
          {
            "id": 1756,
            "val": "新青区"
          },
          {
            "id": 1757,
            "val": "汤旺河区"
          },
          {
            "id": 1758,
            "val": "红星区"
          },
          {
            "id": 1759,
            "val": "美溪区"
          },
          {
            "id": 1760,
            "val": "翠峦区"
          },
          {
            "id": 1761,
            "val": "西林区"
          },
          {
            "id": 1762,
            "val": "金山屯区"
          },
          {
            "id": 1763,
            "val": "铁力市"
          }
        ]
      },
      {
        "id": 137,
        "val": "佳木斯市",
        "data": [
          {
            "id": 1764,
            "val": "东风区"
          },
          {
            "id": 1765,
            "val": "前进区"
          },
          {
            "id": 1766,
            "val": "同江市"
          },
          {
            "id": 1767,
            "val": "向阳区"
          },
          {
            "id": 1768,
            "val": "富锦市"
          },
          {
            "id": 1769,
            "val": "抚远县"
          },
          {
            "id": 1770,
            "val": "桦南县"
          },
          {
            "id": 1771,
            "val": "桦川县"
          },
          {
            "id": 1772,
            "val": "汤原县"
          },
          {
            "id": 1773,
            "val": "郊区"
          }
        ]
      },
      {
        "id": 138,
        "val": "七台河市",
        "data": [
          {
            "id": 1774,
            "val": "勃利县"
          },
          {
            "id": 1775,
            "val": "新兴区"
          },
          {
            "id": 1776,
            "val": "桃山区"
          },
          {
            "id": 1777,
            "val": "茄子河区"
          }
        ]
      },
      {
        "id": 139,
        "val": "牡丹江市",
        "data": [
          {
            "id": 1778,
            "val": "东宁县"
          },
          {
            "id": 1779,
            "val": "东安区"
          },
          {
            "id": 1780,
            "val": "宁安市"
          },
          {
            "id": 1781,
            "val": "林口县"
          },
          {
            "id": 1782,
            "val": "海林市"
          },
          {
            "id": 1783,
            "val": "爱民区"
          },
          {
            "id": 1784,
            "val": "穆棱市"
          },
          {
            "id": 1785,
            "val": "绥芬河市"
          },
          {
            "id": 1786,
            "val": "西安区"
          },
          {
            "id": 1787,
            "val": "阳明区"
          }
        ]
      },
      {
        "id": 140,
        "val": "黑河市",
        "data": [
          {
            "id": 1788,
            "val": "五大连池市"
          },
          {
            "id": 1789,
            "val": "北安市"
          },
          {
            "id": 1790,
            "val": "嫩江县"
          },
          {
            "id": 1791,
            "val": "孙吴县"
          },
          {
            "id": 1792,
            "val": "爱辉区"
          },
          {
            "id": 1793,
            "val": "车逊克县"
          },
          {
            "id": 1794,
            "val": "逊克县"
          }
        ]
      },
      {
        "id": 141,
        "val": "绥化市",
        "data": [
          {
            "id": 1795,
            "val": "兰西县"
          },
          {
            "id": 1796,
            "val": "安达市"
          },
          {
            "id": 1797,
            "val": "庆安县"
          },
          {
            "id": 1798,
            "val": "明水县"
          },
          {
            "id": 1799,
            "val": "望奎县"
          },
          {
            "id": 1800,
            "val": "海伦市"
          },
          {
            "id": 1801,
            "val": "绥化市北林区"
          },
          {
            "id": 1802,
            "val": "绥棱县"
          },
          {
            "id": 1803,
            "val": "肇东市"
          },
          {
            "id": 1804,
            "val": "青冈县"
          }
        ]
      },
      {
        "id": 142,
        "val": "大兴安岭地区",
        "data": [
          {
            "id": 1805,
            "val": "呼玛县"
          },
          {
            "id": 1806,
            "val": "塔河县"
          },
          {
            "id": 1807,
            "val": "大兴安岭地区加格达奇区"
          },
          {
            "id": 1808,
            "val": "大兴安岭地区呼中区"
          },
          {
            "id": 1809,
            "val": "大兴安岭地区新林区"
          },
          {
            "id": 1810,
            "val": "大兴安岭地区松岭区"
          },
          {
            "id": 1811,
            "val": "漠河县"
          }
        ]
      }
    ]
  },
  {
    "id": 9,
    "val": "上海",
    "data": [
      {
        "id": 39,
        "val": "上海市",
        "data": [
          {
            "id": 143,
            "val": "黄浦区"
          },
          {
            "id": 144,
            "val": "卢湾区"
          },
          {
            "id": 145,
            "val": "徐汇区"
          },
          {
            "id": 146,
            "val": "长宁区"
          },
          {
            "id": 147,
            "val": "静安区"
          },
          {
            "id": 148,
            "val": "普陀区"
          },
          {
            "id": 149,
            "val": "闸北区"
          },
          {
            "id": 150,
            "val": "虹口区"
          },
          {
            "id": 151,
            "val": "杨浦区"
          },
          {
            "id": 152,
            "val": "闵行区"
          },
          {
            "id": 153,
            "val": "宝山区"
          },
          {
            "id": 154,
            "val": "嘉定区"
          },
          {
            "id": 155,
            "val": "浦东新区"
          },
          {
            "id": 156,
            "val": "金山区"
          },
          {
            "id": 157,
            "val": "松江区"
          },
          {
            "id": 158,
            "val": "青浦区"
          },
          {
            "id": 159,
            "val": "南汇区"
          },
          {
            "id": 160,
            "val": "奉贤区"
          },
          {
            "id": 161,
            "val": "崇明县"
          }
        ]
      }
    ]
  },
  {
    "id": 10,
    "val": "江苏",
    "data": [
      {
        "id": 162,
        "val": "南京市",
        "data": [
          {
            "id": 2027,
            "val": "下关区"
          },
          {
            "id": 2028,
            "val": "六合区"
          },
          {
            "id": 2029,
            "val": "建邺区"
          },
          {
            "id": 2030,
            "val": "栖霞区"
          },
          {
            "id": 2031,
            "val": "江宁区"
          },
          {
            "id": 2032,
            "val": "浦口区"
          },
          {
            "id": 2033,
            "val": "溧水县"
          },
          {
            "id": 2034,
            "val": "玄武区"
          },
          {
            "id": 2035,
            "val": "白下区"
          },
          {
            "id": 2036,
            "val": "秦淮区"
          },
          {
            "id": 2037,
            "val": "雨花台区"
          },
          {
            "id": 2038,
            "val": "高淳县"
          },
          {
            "id": 2039,
            "val": "鼓楼区"
          }
        ]
      },
      {
        "id": 163,
        "val": "无锡市",
        "data": [
          {
            "id": 2040,
            "val": "北塘区"
          },
          {
            "id": 2041,
            "val": "南长区"
          },
          {
            "id": 2042,
            "val": "宜兴市"
          },
          {
            "id": 2043,
            "val": "崇安区"
          },
          {
            "id": 2044,
            "val": "惠山区"
          },
          {
            "id": 2045,
            "val": "江阴市"
          },
          {
            "id": 2046,
            "val": "滨湖区"
          },
          {
            "id": 2047,
            "val": "锡山区"
          }
        ]
      },
      {
        "id": 164,
        "val": "徐州市",
        "data": [
          {
            "id": 2048,
            "val": "丰县"
          },
          {
            "id": 2049,
            "val": "九里区"
          },
          {
            "id": 2050,
            "val": "云龙区"
          },
          {
            "id": 2051,
            "val": "新沂市"
          },
          {
            "id": 2052,
            "val": "沛县"
          },
          {
            "id": 2053,
            "val": "泉山区"
          },
          {
            "id": 2054,
            "val": "睢宁县"
          },
          {
            "id": 2055,
            "val": "贾汪区"
          },
          {
            "id": 2056,
            "val": "邳州市"
          },
          {
            "id": 2057,
            "val": "铜山县"
          },
          {
            "id": 2058,
            "val": "鼓楼区"
          }
        ]
      },
      {
        "id": 165,
        "val": "常州市",
        "data": [
          {
            "id": 2059,
            "val": "天宁区"
          },
          {
            "id": 2060,
            "val": "戚墅堰区"
          },
          {
            "id": 2061,
            "val": "新北区"
          },
          {
            "id": 2062,
            "val": "武进区"
          },
          {
            "id": 2063,
            "val": "溧阳市"
          },
          {
            "id": 2064,
            "val": "金坛市"
          },
          {
            "id": 2065,
            "val": "钟楼区"
          }
        ]
      },
      {
        "id": 166,
        "val": "苏州市",
        "data": [
          {
            "id": 2066,
            "val": "吴中区"
          },
          {
            "id": 2067,
            "val": "吴江市"
          },
          {
            "id": 2068,
            "val": "太仓市"
          },
          {
            "id": 2069,
            "val": "常熟市"
          },
          {
            "id": 2070,
            "val": "平江区"
          },
          {
            "id": 2071,
            "val": "张家港市"
          },
          {
            "id": 2072,
            "val": "昆山市"
          },
          {
            "id": 2073,
            "val": "沧浪区"
          },
          {
            "id": 2074,
            "val": "相城区"
          },
          {
            "id": 2075,
            "val": "苏州工业园区"
          },
          {
            "id": 2076,
            "val": "虎丘区"
          },
          {
            "id": 2077,
            "val": "金阊区"
          }
        ]
      },
      {
        "id": 167,
        "val": "南通市",
        "data": [
          {
            "id": 2078,
            "val": "启东市"
          },
          {
            "id": 2079,
            "val": "如东县"
          },
          {
            "id": 2080,
            "val": "如皋市"
          },
          {
            "id": 2081,
            "val": "崇川区"
          },
          {
            "id": 2082,
            "val": "海安县"
          },
          {
            "id": 2083,
            "val": "海门市"
          },
          {
            "id": 2084,
            "val": "港闸区"
          },
          {
            "id": 2085,
            "val": "通州市"
          }
        ]
      },
      {
        "id": 168,
        "val": "连云港市",
        "data": [
          {
            "id": 2086,
            "val": "东海县"
          },
          {
            "id": 2087,
            "val": "新浦区"
          },
          {
            "id": 2088,
            "val": "海州区"
          },
          {
            "id": 2089,
            "val": "灌云县"
          },
          {
            "id": 2090,
            "val": "灌南县"
          },
          {
            "id": 2091,
            "val": "赣榆县"
          },
          {
            "id": 2092,
            "val": "连云区"
          }
        ]
      },
      {
        "id": 169,
        "val": "淮安市",
        "data": [
          {
            "id": 2093,
            "val": "楚州区"
          },
          {
            "id": 2094,
            "val": "洪泽县"
          },
          {
            "id": 2095,
            "val": "涟水县"
          },
          {
            "id": 2096,
            "val": "淮阴区"
          },
          {
            "id": 2097,
            "val": "清河区"
          },
          {
            "id": 2098,
            "val": "清浦区"
          },
          {
            "id": 2099,
            "val": "盱眙县"
          },
          {
            "id": 2100,
            "val": "金湖县"
          }
        ]
      },
      {
        "id": 170,
        "val": "盐城市",
        "data": [
          {
            "id": 2101,
            "val": "东台市"
          },
          {
            "id": 2102,
            "val": "亭湖区"
          },
          {
            "id": 2103,
            "val": "响水县"
          },
          {
            "id": 2104,
            "val": "大丰市"
          },
          {
            "id": 2105,
            "val": "射阳县"
          },
          {
            "id": 2106,
            "val": "建湖县"
          },
          {
            "id": 2107,
            "val": "滨海县"
          },
          {
            "id": 2108,
            "val": "盐都区"
          },
          {
            "id": 2109,
            "val": "阜宁县"
          }
        ]
      },
      {
        "id": 171,
        "val": "扬州市",
        "data": [
          {
            "id": 2110,
            "val": "仪征市"
          },
          {
            "id": 2111,
            "val": "宝应县"
          },
          {
            "id": 2112,
            "val": "广陵区"
          },
          {
            "id": 2113,
            "val": "江都市"
          },
          {
            "id": 2114,
            "val": "维扬区"
          },
          {
            "id": 2115,
            "val": "邗江区"
          },
          {
            "id": 2116,
            "val": "高邮市"
          }
        ]
      },
      {
        "id": 172,
        "val": "镇江市",
        "data": [
          {
            "id": 2117,
            "val": "丹徒区"
          },
          {
            "id": 2118,
            "val": "丹阳市"
          },
          {
            "id": 2119,
            "val": "京口区"
          },
          {
            "id": 2120,
            "val": "句容市"
          },
          {
            "id": 2121,
            "val": "扬中市"
          },
          {
            "id": 2122,
            "val": "润州区"
          }
        ]
      },
      {
        "id": 173,
        "val": "泰州市",
        "data": [
          {
            "id": 2123,
            "val": "兴化市"
          },
          {
            "id": 2124,
            "val": "姜堰市"
          },
          {
            "id": 2125,
            "val": "泰兴市"
          },
          {
            "id": 2126,
            "val": "海陵区"
          },
          {
            "id": 2127,
            "val": "靖江市"
          },
          {
            "id": 2128,
            "val": "高港区"
          }
        ]
      },
      {
        "id": 174,
        "val": "宿迁市",
        "data": [
          {
            "id": 2129,
            "val": "宿城区"
          },
          {
            "id": 2130,
            "val": "宿豫区"
          },
          {
            "id": 2131,
            "val": "沭阳县"
          },
          {
            "id": 2132,
            "val": "泗洪县"
          },
          {
            "id": 2133,
            "val": "泗阳县"
          }
        ]
      }
    ]
  },
  {
    "id": 11,
    "val": "浙江",
    "data": [
      {
        "id": 175,
        "val": "杭州市",
        "data": [
          {
            "id": 2134,
            "val": "上城区"
          },
          {
            "id": 2135,
            "val": "下城区"
          },
          {
            "id": 2136,
            "val": "临安市"
          },
          {
            "id": 2137,
            "val": "余杭区"
          },
          {
            "id": 2138,
            "val": "富阳市"
          },
          {
            "id": 2139,
            "val": "建德市"
          },
          {
            "id": 2140,
            "val": "拱墅区"
          },
          {
            "id": 2141,
            "val": "桐庐县"
          },
          {
            "id": 2142,
            "val": "江干区"
          },
          {
            "id": 2143,
            "val": "淳安县"
          },
          {
            "id": 2144,
            "val": "滨江区"
          },
          {
            "id": 2145,
            "val": "萧山区"
          },
          {
            "id": 2146,
            "val": "西湖区"
          }
        ]
      },
      {
        "id": 176,
        "val": "宁波市",
        "data": [
          {
            "id": 2147,
            "val": "余姚市"
          },
          {
            "id": 2148,
            "val": "北仑区"
          },
          {
            "id": 2149,
            "val": "奉化市"
          },
          {
            "id": 2150,
            "val": "宁海县"
          },
          {
            "id": 2151,
            "val": "慈溪市"
          },
          {
            "id": 2152,
            "val": "江东区"
          },
          {
            "id": 2153,
            "val": "江北区"
          },
          {
            "id": 2154,
            "val": "海曙区"
          },
          {
            "id": 2155,
            "val": "象山县"
          },
          {
            "id": 2156,
            "val": "鄞州区"
          },
          {
            "id": 2157,
            "val": "镇海区"
          }
        ]
      },
      {
        "id": 177,
        "val": "温州市",
        "data": [
          {
            "id": 2158,
            "val": "乐清市"
          },
          {
            "id": 2159,
            "val": "平阳县"
          },
          {
            "id": 2160,
            "val": "文成县"
          },
          {
            "id": 2161,
            "val": "永嘉县"
          },
          {
            "id": 2162,
            "val": "泰顺县"
          },
          {
            "id": 2163,
            "val": "洞头县"
          },
          {
            "id": 2164,
            "val": "瑞安市"
          },
          {
            "id": 2165,
            "val": "瓯海区"
          },
          {
            "id": 2166,
            "val": "苍南县"
          },
          {
            "id": 2167,
            "val": "鹿城区"
          },
          {
            "id": 2168,
            "val": "龙湾区"
          }
        ]
      },
      {
        "id": 178,
        "val": "嘉兴市",
        "data": [
          {
            "id": 2169,
            "val": "南湖区"
          },
          {
            "id": 2170,
            "val": "嘉善县"
          },
          {
            "id": 2171,
            "val": "平湖市"
          },
          {
            "id": 2172,
            "val": "桐乡市"
          },
          {
            "id": 2173,
            "val": "海宁市"
          },
          {
            "id": 2174,
            "val": "海盐县"
          },
          {
            "id": 2175,
            "val": "秀洲区"
          }
        ]
      },
      {
        "id": 179,
        "val": "湖州市",
        "data": [
          {
            "id": 2176,
            "val": "南浔区"
          },
          {
            "id": 2177,
            "val": "吴兴区"
          },
          {
            "id": 2178,
            "val": "安吉县"
          },
          {
            "id": 2179,
            "val": "德清县"
          },
          {
            "id": 2180,
            "val": "长兴县"
          }
        ]
      },
      {
        "id": 180,
        "val": "绍兴市",
        "data": [
          {
            "id": 2181,
            "val": "上虞市"
          },
          {
            "id": 2182,
            "val": "嵊州市"
          },
          {
            "id": 2183,
            "val": "新昌县"
          },
          {
            "id": 2184,
            "val": "绍兴县"
          },
          {
            "id": 2185,
            "val": "诸暨市"
          },
          {
            "id": 2186,
            "val": "越城区"
          }
        ]
      },
      {
        "id": 181,
        "val": "舟山市",
        "data": [
          {
            "id": 2187,
            "val": "定海区"
          },
          {
            "id": 2188,
            "val": "岱山县"
          },
          {
            "id": 2189,
            "val": "嵊泗县"
          },
          {
            "id": 2190,
            "val": "普陀区"
          }
        ]
      },
      {
        "id": 182,
        "val": "衢州市",
        "data": [
          {
            "id": 2191,
            "val": "常山县"
          },
          {
            "id": 2192,
            "val": "开化县"
          },
          {
            "id": 2193,
            "val": "柯城区"
          },
          {
            "id": 2194,
            "val": "江山市"
          },
          {
            "id": 2195,
            "val": "衢江区"
          },
          {
            "id": 2196,
            "val": "龙游县"
          }
        ]
      },
      {
        "id": 183,
        "val": "金华市",
        "data": [
          {
            "id": 2197,
            "val": "东阳市"
          },
          {
            "id": 2198,
            "val": "义乌市"
          },
          {
            "id": 2199,
            "val": "兰溪市"
          },
          {
            "id": 2200,
            "val": "婺城区"
          },
          {
            "id": 2201,
            "val": "武义县"
          },
          {
            "id": 2202,
            "val": "永康市"
          },
          {
            "id": 2203,
            "val": "浦江县"
          },
          {
            "id": 2204,
            "val": "磐安县"
          },
          {
            "id": 2205,
            "val": "金东区"
          }
        ]
      },
      {
        "id": 184,
        "val": "台州市",
        "data": [
          {
            "id": 2206,
            "val": "三门县"
          },
          {
            "id": 2207,
            "val": "临海市"
          },
          {
            "id": 2208,
            "val": "仙居县"
          },
          {
            "id": 2209,
            "val": "天台县"
          },
          {
            "id": 2210,
            "val": "椒江区"
          },
          {
            "id": 2211,
            "val": "温岭市"
          },
          {
            "id": 2212,
            "val": "玉环县"
          },
          {
            "id": 2213,
            "val": "路桥区"
          },
          {
            "id": 2214,
            "val": "黄岩区"
          }
        ]
      },
      {
        "id": 185,
        "val": "丽水市",
        "data": [
          {
            "id": 2215,
            "val": "云和县"
          },
          {
            "id": 2216,
            "val": "庆元县"
          },
          {
            "id": 2217,
            "val": "景宁畲族自治县"
          },
          {
            "id": 2218,
            "val": "松阳县"
          },
          {
            "id": 2219,
            "val": "缙云县"
          },
          {
            "id": 2220,
            "val": "莲都区"
          },
          {
            "id": 2221,
            "val": "遂昌县"
          },
          {
            "id": 2222,
            "val": "青田县"
          },
          {
            "id": 2223,
            "val": "龙泉市"
          }
        ]
      }
    ]
  },
  {
    "id": 12,
    "val": "安徽",
    "data": [
      {
        "id": 186,
        "val": "合肥市",
        "data": [
          {
            "id": 2224,
            "val": "包河区"
          },
          {
            "id": 2225,
            "val": "庐阳区"
          },
          {
            "id": 2226,
            "val": "瑶海区"
          },
          {
            "id": 2227,
            "val": "肥东县"
          },
          {
            "id": 2228,
            "val": "肥西县"
          },
          {
            "id": 2229,
            "val": "蜀山区"
          },
          {
            "id": 2230,
            "val": "长丰县"
          }
        ]
      },
      {
        "id": 187,
        "val": "芜湖市",
        "data": [
          {
            "id": 2231,
            "val": "三山区"
          },
          {
            "id": 2232,
            "val": "南陵县"
          },
          {
            "id": 2233,
            "val": "弋江区"
          },
          {
            "id": 2234,
            "val": "繁昌县"
          },
          {
            "id": 2235,
            "val": "芜湖县"
          },
          {
            "id": 2236,
            "val": "镜湖区"
          },
          {
            "id": 2237,
            "val": "鸠江区"
          }
        ]
      },
      {
        "id": 188,
        "val": "蚌埠市",
        "data": [
          {
            "id": 2238,
            "val": "五河县"
          },
          {
            "id": 2239,
            "val": "固镇县"
          },
          {
            "id": 2240,
            "val": "怀远县"
          },
          {
            "id": 2241,
            "val": "淮上区"
          },
          {
            "id": 2242,
            "val": "禹会区"
          },
          {
            "id": 2243,
            "val": "蚌山区"
          },
          {
            "id": 2244,
            "val": "龙子湖区"
          }
        ]
      },
      {
        "id": 189,
        "val": "淮南市",
        "data": [
          {
            "id": 2245,
            "val": "八公山区"
          },
          {
            "id": 2246,
            "val": "凤台县"
          },
          {
            "id": 2247,
            "val": "大通区"
          },
          {
            "id": 2248,
            "val": "潘集区"
          },
          {
            "id": 2249,
            "val": "田家庵区"
          },
          {
            "id": 2250,
            "val": "谢家集区"
          }
        ]
      },
      {
        "id": 190,
        "val": "马鞍山市",
        "data": [
          {
            "id": 2251,
            "val": "当涂县"
          },
          {
            "id": 2252,
            "val": "花山区"
          },
          {
            "id": 2253,
            "val": "金家庄区"
          },
          {
            "id": 2254,
            "val": "雨山区"
          }
        ]
      },
      {
        "id": 191,
        "val": "淮北市",
        "data": [
          {
            "id": 2255,
            "val": "杜集区"
          },
          {
            "id": 2256,
            "val": "濉溪县"
          },
          {
            "id": 2257,
            "val": "烈山区"
          },
          {
            "id": 2258,
            "val": "相山区"
          }
        ]
      },
      {
        "id": 192,
        "val": "铜陵市",
        "data": [
          {
            "id": 2259,
            "val": "狮子山区"
          },
          {
            "id": 2260,
            "val": "郊区"
          },
          {
            "id": 2261,
            "val": "铜官山区"
          },
          {
            "id": 2262,
            "val": "铜陵县"
          }
        ]
      },
      {
        "id": 193,
        "val": "安庆市",
        "data": [
          {
            "id": 2263,
            "val": "大观区"
          },
          {
            "id": 2264,
            "val": "太湖县"
          },
          {
            "id": 2265,
            "val": "宜秀区"
          },
          {
            "id": 2266,
            "val": "宿松县"
          },
          {
            "id": 2267,
            "val": "岳西县"
          },
          {
            "id": 2268,
            "val": "怀宁县"
          },
          {
            "id": 2269,
            "val": "望江县"
          },
          {
            "id": 2270,
            "val": "枞阳县"
          },
          {
            "id": 2271,
            "val": "桐城市"
          },
          {
            "id": 2272,
            "val": "潜山县"
          },
          {
            "id": 2273,
            "val": "迎江区"
          }
        ]
      },
      {
        "id": 194,
        "val": "黄山市",
        "data": [
          {
            "id": 2274,
            "val": "休宁县"
          },
          {
            "id": 2275,
            "val": "屯溪区"
          },
          {
            "id": 2276,
            "val": "徽州区"
          },
          {
            "id": 2277,
            "val": "歙县"
          },
          {
            "id": 2278,
            "val": "祁门县"
          },
          {
            "id": 2279,
            "val": "黄山区"
          },
          {
            "id": 2280,
            "val": "黟县"
          }
        ]
      },
      {
        "id": 195,
        "val": "滁州市",
        "data": [
          {
            "id": 2281,
            "val": "全椒县"
          },
          {
            "id": 2282,
            "val": "凤阳县"
          },
          {
            "id": 2283,
            "val": "南谯区"
          },
          {
            "id": 2284,
            "val": "天长市"
          },
          {
            "id": 2285,
            "val": "定远县"
          },
          {
            "id": 2286,
            "val": "明光市"
          },
          {
            "id": 2287,
            "val": "来安县"
          },
          {
            "id": 2288,
            "val": "琅玡区"
          }
        ]
      },
      {
        "id": 196,
        "val": "阜阳市",
        "data": [
          {
            "id": 2289,
            "val": "临泉县"
          },
          {
            "id": 2290,
            "val": "太和县"
          },
          {
            "id": 2291,
            "val": "界首市"
          },
          {
            "id": 2292,
            "val": "阜南县"
          },
          {
            "id": 2293,
            "val": "颍东区"
          },
          {
            "id": 2294,
            "val": "颍州区"
          },
          {
            "id": 2295,
            "val": "颍泉区"
          },
          {
            "id": 2296,
            "val": "颖上县"
          }
        ]
      },
      {
        "id": 197,
        "val": "宿州市",
        "data": [
          {
            "id": 2297,
            "val": "埇桥区"
          },
          {
            "id": 2298,
            "val": "泗县辖"
          },
          {
            "id": 2299,
            "val": "灵璧县"
          },
          {
            "id": 2300,
            "val": "砀山县"
          },
          {
            "id": 2301,
            "val": "萧县"
          }
        ]
      },
      {
        "id": 198,
        "val": "巢湖市",
        "data": [
          {
            "id": 2302,
            "val": "含山县"
          },
          {
            "id": 2303,
            "val": "和县"
          },
          {
            "id": 2304,
            "val": "居巢区"
          },
          {
            "id": 2305,
            "val": "庐江县"
          },
          {
            "id": 2306,
            "val": "无为县"
          }
        ]
      },
      {
        "id": 199,
        "val": "六安市",
        "data": [
          {
            "id": 2307,
            "val": "寿县"
          },
          {
            "id": 2308,
            "val": "舒城县"
          },
          {
            "id": 2309,
            "val": "裕安区"
          },
          {
            "id": 2310,
            "val": "金安区"
          },
          {
            "id": 2311,
            "val": "金寨县"
          },
          {
            "id": 2312,
            "val": "霍山县"
          },
          {
            "id": 2313,
            "val": "霍邱县"
          }
        ]
      },
      {
        "id": 200,
        "val": "亳州市",
        "data": [
          {
            "id": 2314,
            "val": "利辛县"
          },
          {
            "id": 2315,
            "val": "涡阳县"
          },
          {
            "id": 2316,
            "val": "蒙城县"
          },
          {
            "id": 2317,
            "val": "谯城区"
          }
        ]
      },
      {
        "id": 201,
        "val": "池州市",
        "data": [
          {
            "id": 2318,
            "val": "东至县"
          },
          {
            "id": 2319,
            "val": "石台县"
          },
          {
            "id": 2320,
            "val": "贵池区"
          },
          {
            "id": 2321,
            "val": "青阳县"
          }
        ]
      },
      {
        "id": 202,
        "val": "宣城市",
        "data": [
          {
            "id": 2322,
            "val": "宁国市"
          },
          {
            "id": 2323,
            "val": "宣州区"
          },
          {
            "id": 2324,
            "val": "广德县"
          },
          {
            "id": 2325,
            "val": "旌德县"
          },
          {
            "id": 2326,
            "val": "泾县"
          },
          {
            "id": 2327,
            "val": "绩溪县"
          },
          {
            "id": 2328,
            "val": "郎溪县"
          }
        ]
      }
    ]
  },
  {
    "id": 13,
    "val": "福建",
    "data": [
      {
        "id": 203,
        "val": "福州市",
        "data": [
          {
            "id": 2329,
            "val": "仓山区"
          },
          {
            "id": 2330,
            "val": "台江区"
          },
          {
            "id": 2331,
            "val": "平潭县"
          },
          {
            "id": 2332,
            "val": "晋安区"
          },
          {
            "id": 2333,
            "val": "永泰县"
          },
          {
            "id": 2334,
            "val": "福清市"
          },
          {
            "id": 2335,
            "val": "罗源县"
          },
          {
            "id": 2336,
            "val": "连江县"
          },
          {
            "id": 2337,
            "val": "长乐市"
          },
          {
            "id": 2338,
            "val": "闽侯县"
          },
          {
            "id": 2339,
            "val": "闽清县"
          },
          {
            "id": 2340,
            "val": "马尾区"
          },
          {
            "id": 2341,
            "val": "鼓楼区"
          }
        ]
      },
      {
        "id": 204,
        "val": "厦门市",
        "data": [
          {
            "id": 2342,
            "val": "同安区"
          },
          {
            "id": 2343,
            "val": "思明区"
          },
          {
            "id": 2344,
            "val": "海沧区"
          },
          {
            "id": 2345,
            "val": "湖里区"
          },
          {
            "id": 2346,
            "val": "翔安区"
          },
          {
            "id": 2347,
            "val": "集美区"
          }
        ]
      },
      {
        "id": 205,
        "val": "莆田市",
        "data": [
          {
            "id": 2348,
            "val": "仙游县"
          },
          {
            "id": 2349,
            "val": "城厢区"
          },
          {
            "id": 2350,
            "val": "涵江区"
          },
          {
            "id": 2351,
            "val": "秀屿区"
          },
          {
            "id": 2352,
            "val": "荔城区"
          }
        ]
      },
      {
        "id": 206,
        "val": "三明市",
        "data": [
          {
            "id": 2353,
            "val": "三元区"
          },
          {
            "id": 2354,
            "val": "大田县"
          },
          {
            "id": 2355,
            "val": "宁化县"
          },
          {
            "id": 2356,
            "val": "将乐县"
          },
          {
            "id": 2357,
            "val": "尤溪县"
          },
          {
            "id": 2358,
            "val": "建宁县"
          },
          {
            "id": 2359,
            "val": "明溪县"
          },
          {
            "id": 2360,
            "val": "梅列区"
          },
          {
            "id": 2361,
            "val": "永安市"
          },
          {
            "id": 2362,
            "val": "沙县"
          },
          {
            "id": 2363,
            "val": "泰宁县"
          },
          {
            "id": 2364,
            "val": "清流县"
          }
        ]
      },
      {
        "id": 207,
        "val": "泉州市",
        "data": [
          {
            "id": 2365,
            "val": "丰泽区"
          },
          {
            "id": 2366,
            "val": "南安市"
          },
          {
            "id": 2367,
            "val": "安溪县"
          },
          {
            "id": 2368,
            "val": "德化县"
          },
          {
            "id": 2369,
            "val": "惠安县"
          },
          {
            "id": 2370,
            "val": "晋江市"
          },
          {
            "id": 2371,
            "val": "永春县"
          },
          {
            "id": 2372,
            "val": "泉港区"
          },
          {
            "id": 2373,
            "val": "洛江区"
          },
          {
            "id": 2374,
            "val": "石狮市"
          },
          {
            "id": 2375,
            "val": "金门县"
          },
          {
            "id": 2376,
            "val": "鲤城区"
          }
        ]
      },
      {
        "id": 208,
        "val": "漳州市",
        "data": [
          {
            "id": 2377,
            "val": "东山县"
          },
          {
            "id": 2378,
            "val": "云霄县"
          },
          {
            "id": 2379,
            "val": "华安县"
          },
          {
            "id": 2380,
            "val": "南靖县"
          },
          {
            "id": 2381,
            "val": "平和县"
          },
          {
            "id": 2382,
            "val": "漳浦县"
          },
          {
            "id": 2383,
            "val": "芗城区"
          },
          {
            "id": 2384,
            "val": "诏安县"
          },
          {
            "id": 2385,
            "val": "长泰县"
          },
          {
            "id": 2386,
            "val": "龙文区"
          },
          {
            "id": 2387,
            "val": "龙海市"
          }
        ]
      },
      {
        "id": 209,
        "val": "南平市",
        "data": [
          {
            "id": 2388,
            "val": "光泽县"
          },
          {
            "id": 2389,
            "val": "延平区"
          },
          {
            "id": 2390,
            "val": "建瓯市"
          },
          {
            "id": 2391,
            "val": "建阳市"
          },
          {
            "id": 2392,
            "val": "政和县"
          },
          {
            "id": 2393,
            "val": "松溪县"
          },
          {
            "id": 2394,
            "val": "武夷山市"
          },
          {
            "id": 2395,
            "val": "浦城县"
          },
          {
            "id": 2396,
            "val": "邵武市"
          },
          {
            "id": 2397,
            "val": "顺昌县"
          }
        ]
      },
      {
        "id": 210,
        "val": "龙岩市",
        "data": [
          {
            "id": 2398,
            "val": "上杭县"
          },
          {
            "id": 2399,
            "val": "新罗区"
          },
          {
            "id": 2400,
            "val": "武平县"
          },
          {
            "id": 2401,
            "val": "永定县"
          },
          {
            "id": 2402,
            "val": "漳平市"
          },
          {
            "id": 2403,
            "val": "连城县"
          },
          {
            "id": 2404,
            "val": "长汀县"
          }
        ]
      },
      {
        "id": 211,
        "val": "宁德市",
        "data": [
          {
            "id": 2405,
            "val": "古田县"
          },
          {
            "id": 2406,
            "val": "周宁县"
          },
          {
            "id": 2407,
            "val": "寿宁县"
          },
          {
            "id": 2408,
            "val": "屏南县"
          },
          {
            "id": 2409,
            "val": "柘荣县"
          },
          {
            "id": 2410,
            "val": "福安市"
          },
          {
            "id": 2411,
            "val": "福鼎市"
          },
          {
            "id": 2412,
            "val": "蕉城区"
          },
          {
            "id": 2413,
            "val": "霞浦县"
          }
        ]
      }
    ]
  },
  {
    "id": 14,
    "val": "江西",
    "data": [
      {
        "id": 212,
        "val": "南昌市",
        "data": [
          {
            "id": 2414,
            "val": "东湖区"
          },
          {
            "id": 2415,
            "val": "南昌县"
          },
          {
            "id": 2416,
            "val": "安义县"
          },
          {
            "id": 2417,
            "val": "新建县"
          },
          {
            "id": 2418,
            "val": "湾里区"
          },
          {
            "id": 2419,
            "val": "西湖区"
          },
          {
            "id": 2420,
            "val": "进贤县"
          },
          {
            "id": 2421,
            "val": "青云谱区"
          },
          {
            "id": 2422,
            "val": "青山湖区"
          }
        ]
      },
      {
        "id": 213,
        "val": "景德镇市",
        "data": [
          {
            "id": 2423,
            "val": "乐平市"
          },
          {
            "id": 2424,
            "val": "昌江区"
          },
          {
            "id": 2425,
            "val": "浮梁县"
          },
          {
            "id": 2426,
            "val": "珠山区"
          }
        ]
      },
      {
        "id": 214,
        "val": "萍乡市",
        "data": [
          {
            "id": 2427,
            "val": "上栗县"
          },
          {
            "id": 2428,
            "val": "安源区"
          },
          {
            "id": 2429,
            "val": "湘东区"
          },
          {
            "id": 2430,
            "val": "芦溪县"
          },
          {
            "id": 2431,
            "val": "莲花县"
          }
        ]
      },
      {
        "id": 215,
        "val": "九江市",
        "data": [
          {
            "id": 2432,
            "val": "九江县"
          },
          {
            "id": 2433,
            "val": "修水县"
          },
          {
            "id": 2434,
            "val": "庐山区"
          },
          {
            "id": 2435,
            "val": "彭泽县"
          },
          {
            "id": 2436,
            "val": "德安县"
          },
          {
            "id": 2437,
            "val": "星子县"
          },
          {
            "id": 2438,
            "val": "武宁县"
          },
          {
            "id": 2439,
            "val": "永修县"
          },
          {
            "id": 2440,
            "val": "浔阳区"
          },
          {
            "id": 2441,
            "val": "湖口县"
          },
          {
            "id": 2442,
            "val": "瑞昌市"
          },
          {
            "id": 2443,
            "val": "都昌县"
          }
        ]
      },
      {
        "id": 216,
        "val": "新余市",
        "data": [
          {
            "id": 2444,
            "val": "分宜县"
          },
          {
            "id": 2445,
            "val": "渝水区"
          }
        ]
      },
      {
        "id": 217,
        "val": "鹰潭市",
        "data": [
          {
            "id": 2446,
            "val": "余江县"
          },
          {
            "id": 2447,
            "val": "月湖区"
          },
          {
            "id": 2448,
            "val": "贵溪市"
          }
        ]
      },
      {
        "id": 218,
        "val": "赣州市",
        "data": [
          {
            "id": 2449,
            "val": "上犹县"
          },
          {
            "id": 2450,
            "val": "于都县"
          },
          {
            "id": 2451,
            "val": "会昌县"
          },
          {
            "id": 2452,
            "val": "信丰县"
          },
          {
            "id": 2453,
            "val": "全南县"
          },
          {
            "id": 2454,
            "val": "兴国县"
          },
          {
            "id": 2455,
            "val": "南康市"
          },
          {
            "id": 2456,
            "val": "大余县"
          },
          {
            "id": 2457,
            "val": "宁都县"
          },
          {
            "id": 2458,
            "val": "安远县"
          },
          {
            "id": 2459,
            "val": "定南县"
          },
          {
            "id": 2460,
            "val": "寻乌县"
          },
          {
            "id": 2461,
            "val": "崇义县"
          },
          {
            "id": 2462,
            "val": "瑞金市"
          },
          {
            "id": 2463,
            "val": "石城县"
          },
          {
            "id": 2464,
            "val": "章贡区"
          },
          {
            "id": 2465,
            "val": "赣县"
          },
          {
            "id": 2466,
            "val": "龙南县"
          }
        ]
      },
      {
        "id": 219,
        "val": "吉安市",
        "data": [
          {
            "id": 2467,
            "val": "万安县"
          },
          {
            "id": 2468,
            "val": "井冈山市"
          },
          {
            "id": 2469,
            "val": "吉安县"
          },
          {
            "id": 2470,
            "val": "吉州区"
          },
          {
            "id": 2471,
            "val": "吉水县"
          },
          {
            "id": 2472,
            "val": "安福县"
          },
          {
            "id": 2473,
            "val": "峡江县"
          },
          {
            "id": 2474,
            "val": "新干县"
          },
          {
            "id": 2475,
            "val": "永丰县"
          },
          {
            "id": 2476,
            "val": "永新县"
          },
          {
            "id": 2477,
            "val": "泰和县"
          },
          {
            "id": 2478,
            "val": "遂川县"
          },
          {
            "id": 2479,
            "val": "青原区"
          }
        ]
      },
      {
        "id": 220,
        "val": "宜春市",
        "data": [
          {
            "id": 2480,
            "val": "万载县"
          },
          {
            "id": 2481,
            "val": "上高县"
          },
          {
            "id": 2482,
            "val": "丰城市"
          },
          {
            "id": 2483,
            "val": "奉新县"
          },
          {
            "id": 2484,
            "val": "宜丰县"
          },
          {
            "id": 2485,
            "val": "樟树市"
          },
          {
            "id": 2486,
            "val": "袁州区"
          },
          {
            "id": 2487,
            "val": "铜鼓县"
          },
          {
            "id": 2488,
            "val": "靖安县"
          },
          {
            "id": 2489,
            "val": "高安市"
          }
        ]
      },
      {
        "id": 221,
        "val": "抚州市",
        "data": [
          {
            "id": 2490,
            "val": "东乡县"
          },
          {
            "id": 2491,
            "val": "临川区"
          },
          {
            "id": 2492,
            "val": "乐安县"
          },
          {
            "id": 2493,
            "val": "南丰县"
          },
          {
            "id": 2494,
            "val": "南城县"
          },
          {
            "id": 2495,
            "val": "宜黄县"
          },
          {
            "id": 2496,
            "val": "崇仁县"
          },
          {
            "id": 2497,
            "val": "广昌县"
          },
          {
            "id": 2498,
            "val": "资溪县"
          },
          {
            "id": 2499,
            "val": "金溪县"
          },
          {
            "id": 2500,
            "val": "黎川县"
          }
        ]
      },
      {
        "id": 222,
        "val": "上饶市",
        "data": [
          {
            "id": 2501,
            "val": "万年县"
          },
          {
            "id": 2502,
            "val": "上饶县"
          },
          {
            "id": 2503,
            "val": "余干县"
          },
          {
            "id": 2504,
            "val": "信州区"
          },
          {
            "id": 2505,
            "val": "婺源县"
          },
          {
            "id": 2506,
            "val": "广丰县"
          },
          {
            "id": 2507,
            "val": "弋阳县"
          },
          {
            "id": 2508,
            "val": "德兴市"
          },
          {
            "id": 2509,
            "val": "横峰县"
          },
          {
            "id": 2510,
            "val": "玉山县"
          },
          {
            "id": 2511,
            "val": "鄱阳县"
          },
          {
            "id": 2512,
            "val": "铅山县"
          }
        ]
      }
    ]
  },
  {
    "id": 15,
    "val": "山东",
    "data": [
      {
        "id": 223,
        "val": "济南市",
        "data": [
          {
            "id": 2513,
            "val": "历下区"
          },
          {
            "id": 2514,
            "val": "历城区"
          },
          {
            "id": 2515,
            "val": "商河县"
          },
          {
            "id": 2516,
            "val": "天桥区"
          },
          {
            "id": 2517,
            "val": "市中区"
          },
          {
            "id": 2518,
            "val": "平阴县"
          },
          {
            "id": 2519,
            "val": "槐荫区"
          },
          {
            "id": 2520,
            "val": "济阳县"
          },
          {
            "id": 2521,
            "val": "章丘市"
          },
          {
            "id": 2522,
            "val": "长清区"
          }
        ]
      },
      {
        "id": 224,
        "val": "青岛市",
        "data": [
          {
            "id": 2523,
            "val": "即墨市"
          },
          {
            "id": 2524,
            "val": "四方区"
          },
          {
            "id": 2525,
            "val": "城阳区"
          },
          {
            "id": 2526,
            "val": "崂山区"
          },
          {
            "id": 2527,
            "val": "市北区"
          },
          {
            "id": 2528,
            "val": "市南区"
          },
          {
            "id": 2529,
            "val": "平度市"
          },
          {
            "id": 2530,
            "val": "李沧区"
          },
          {
            "id": 2531,
            "val": "胶南市"
          },
          {
            "id": 2532,
            "val": "胶州市"
          },
          {
            "id": 2533,
            "val": "莱西市"
          },
          {
            "id": 2534,
            "val": "黄岛区"
          }
        ]
      },
      {
        "id": 225,
        "val": "淄博市",
        "data": [
          {
            "id": 2535,
            "val": "临淄区"
          },
          {
            "id": 2536,
            "val": "博山区"
          },
          {
            "id": 2537,
            "val": "周村区"
          },
          {
            "id": 2538,
            "val": "张店区"
          },
          {
            "id": 2539,
            "val": "桓台县"
          },
          {
            "id": 2540,
            "val": "沂源县"
          },
          {
            "id": 2541,
            "val": "淄川区"
          },
          {
            "id": 2542,
            "val": "高青县"
          }
        ]
      },
      {
        "id": 226,
        "val": "枣庄市",
        "data": [
          {
            "id": 2543,
            "val": "台儿庄区"
          },
          {
            "id": 2544,
            "val": "山亭区"
          },
          {
            "id": 2545,
            "val": "峄城区"
          },
          {
            "id": 2546,
            "val": "市中区"
          },
          {
            "id": 2547,
            "val": "滕州市"
          },
          {
            "id": 2548,
            "val": "薛城区"
          }
        ]
      },
      {
        "id": 227,
        "val": "东营市",
        "data": [
          {
            "id": 2549,
            "val": "东营区"
          },
          {
            "id": 2550,
            "val": "利津县"
          },
          {
            "id": 2551,
            "val": "垦利县"
          },
          {
            "id": 2552,
            "val": "广饶县"
          },
          {
            "id": 2553,
            "val": "河口区"
          }
        ]
      },
      {
        "id": 228,
        "val": "烟台市",
        "data": [
          {
            "id": 2554,
            "val": "招远市"
          },
          {
            "id": 2555,
            "val": "栖霞市"
          },
          {
            "id": 2556,
            "val": "海阳市"
          },
          {
            "id": 2557,
            "val": "牟平区"
          },
          {
            "id": 2558,
            "val": "福山区"
          },
          {
            "id": 2559,
            "val": "芝罘区"
          },
          {
            "id": 2560,
            "val": "莱山区"
          },
          {
            "id": 2561,
            "val": "莱州市"
          },
          {
            "id": 2562,
            "val": "莱阳市"
          },
          {
            "id": 2563,
            "val": "蓬莱市"
          },
          {
            "id": 2564,
            "val": "长岛县"
          },
          {
            "id": 2565,
            "val": "龙口市"
          }
        ]
      },
      {
        "id": 229,
        "val": "潍坊市",
        "data": [
          {
            "id": 2566,
            "val": "临朐县"
          },
          {
            "id": 2567,
            "val": "坊子区"
          },
          {
            "id": 2568,
            "val": "奎文区"
          },
          {
            "id": 2569,
            "val": "安丘市"
          },
          {
            "id": 2570,
            "val": "寒亭区"
          },
          {
            "id": 2571,
            "val": "寿光市"
          },
          {
            "id": 2572,
            "val": "昌乐县"
          },
          {
            "id": 2573,
            "val": "昌邑市"
          },
          {
            "id": 2574,
            "val": "潍城区"
          },
          {
            "id": 2575,
            "val": "诸城市"
          },
          {
            "id": 2576,
            "val": "青州市"
          },
          {
            "id": 2577,
            "val": "高密市"
          }
        ]
      },
      {
        "id": 230,
        "val": "济宁市",
        "data": [
          {
            "id": 2578,
            "val": "任城区"
          },
          {
            "id": 2579,
            "val": "兖州市"
          },
          {
            "id": 2580,
            "val": "嘉祥县"
          },
          {
            "id": 2581,
            "val": "市中区"
          },
          {
            "id": 2582,
            "val": "微山县"
          },
          {
            "id": 2583,
            "val": "曲阜市"
          },
          {
            "id": 2584,
            "val": "梁山县"
          },
          {
            "id": 2585,
            "val": "汶上县"
          },
          {
            "id": 2586,
            "val": "泗水县"
          },
          {
            "id": 2587,
            "val": "邹城市"
          },
          {
            "id": 2588,
            "val": "金乡县"
          },
          {
            "id": 2589,
            "val": "鱼台县"
          }
        ]
      },
      {
        "id": 231,
        "val": "泰安市",
        "data": [
          {
            "id": 2590,
            "val": "东平县"
          },
          {
            "id": 2591,
            "val": "宁阳县"
          },
          {
            "id": 2592,
            "val": "岱岳区"
          },
          {
            "id": 2593,
            "val": "新泰市"
          },
          {
            "id": 2594,
            "val": "泰山区"
          },
          {
            "id": 2595,
            "val": "肥城市"
          }
        ]
      },
      {
        "id": 232,
        "val": "威海市",
        "data": [
          {
            "id": 2596,
            "val": "乳山市"
          },
          {
            "id": 2597,
            "val": "文登市"
          },
          {
            "id": 2598,
            "val": "环翠区"
          },
          {
            "id": 2599,
            "val": "荣成市"
          }
        ]
      },
      {
        "id": 233,
        "val": "日照市",
        "data": [
          {
            "id": 2600,
            "val": "东港区"
          },
          {
            "id": 2601,
            "val": "五莲县"
          },
          {
            "id": 2602,
            "val": "岚山区"
          },
          {
            "id": 2603,
            "val": "莒县"
          }
        ]
      },
      {
        "id": 234,
        "val": "莱芜市",
        "data": [
          {
            "id": 2604,
            "val": "莱城区"
          },
          {
            "id": 2605,
            "val": "钢城区"
          }
        ]
      },
      {
        "id": 235,
        "val": "临沂市",
        "data": [
          {
            "id": 2606,
            "val": "临沭县"
          },
          {
            "id": 2607,
            "val": "兰山区"
          },
          {
            "id": 2608,
            "val": "平邑县"
          },
          {
            "id": 2609,
            "val": "沂南县"
          },
          {
            "id": 2610,
            "val": "沂水县"
          },
          {
            "id": 2611,
            "val": "河东区"
          },
          {
            "id": 2612,
            "val": "罗庄区"
          },
          {
            "id": 2613,
            "val": "苍山县"
          },
          {
            "id": 2614,
            "val": "莒南县"
          },
          {
            "id": 2615,
            "val": "蒙阴县"
          },
          {
            "id": 2616,
            "val": "费县"
          },
          {
            "id": 2617,
            "val": "郯城县"
          }
        ]
      },
      {
        "id": 236,
        "val": "德州市",
        "data": [
          {
            "id": 2618,
            "val": "临邑县"
          },
          {
            "id": 2619,
            "val": "乐陵市"
          },
          {
            "id": 2620,
            "val": "夏津县"
          },
          {
            "id": 2621,
            "val": "宁津县"
          },
          {
            "id": 2622,
            "val": "平原县"
          },
          {
            "id": 2623,
            "val": "庆云县"
          },
          {
            "id": 2624,
            "val": "德城区"
          },
          {
            "id": 2625,
            "val": "武城县"
          },
          {
            "id": 2626,
            "val": "禹城市"
          },
          {
            "id": 2627,
            "val": "陵县"
          },
          {
            "id": 2628,
            "val": "齐河县"
          }
        ]
      },
      {
        "id": 237,
        "val": "聊城市",
        "data": [
          {
            "id": 2629,
            "val": "东昌府区"
          },
          {
            "id": 2630,
            "val": "东阿县"
          },
          {
            "id": 2631,
            "val": "临清市"
          },
          {
            "id": 2632,
            "val": "冠县"
          },
          {
            "id": 2633,
            "val": "茌平县"
          },
          {
            "id": 2634,
            "val": "莘县"
          },
          {
            "id": 2635,
            "val": "阳谷县"
          },
          {
            "id": 2636,
            "val": "高唐县"
          }
        ]
      },
      {
        "id": 238,
        "val": "滨州市",
        "data": [
          {
            "id": 2637,
            "val": "博兴县"
          },
          {
            "id": 2638,
            "val": "惠民县"
          },
          {
            "id": 2639,
            "val": "无棣县"
          },
          {
            "id": 2640,
            "val": "沾化县"
          },
          {
            "id": 2641,
            "val": "滨城区"
          },
          {
            "id": 2642,
            "val": "邹平县"
          },
          {
            "id": 2643,
            "val": "阳信县"
          }
        ]
      },
      {
        "id": 239,
        "val": "菏泽市",
        "data": [
          {
            "id": 2644,
            "val": "东明县"
          },
          {
            "id": 2645,
            "val": "单县"
          },
          {
            "id": 2646,
            "val": "定陶县"
          },
          {
            "id": 2647,
            "val": "巨野县"
          },
          {
            "id": 2648,
            "val": "成武县"
          },
          {
            "id": 2649,
            "val": "曹县"
          },
          {
            "id": 2650,
            "val": "牡丹区"
          },
          {
            "id": 2651,
            "val": "郓城县"
          },
          {
            "id": 2652,
            "val": "鄄城县"
          }
        ]
      }
    ]
  },
  {
    "id": 16,
    "val": "河南",
    "data": [
      {
        "id": 240,
        "val": "郑州市",
        "data": [
          {
            "id": 2653,
            "val": "上街区"
          },
          {
            "id": 2654,
            "val": "中原区"
          },
          {
            "id": 2655,
            "val": "中牟县"
          },
          {
            "id": 2656,
            "val": "二七区"
          },
          {
            "id": 2657,
            "val": "巩义市"
          },
          {
            "id": 2658,
            "val": "惠济区"
          },
          {
            "id": 2659,
            "val": "新密市"
          },
          {
            "id": 2660,
            "val": "新郑市"
          },
          {
            "id": 2661,
            "val": "登封市"
          },
          {
            "id": 2662,
            "val": "管城回族区"
          },
          {
            "id": 2663,
            "val": "荥阳市"
          },
          {
            "id": 2664,
            "val": "金水区"
          }
        ]
      },
      {
        "id": 241,
        "val": "开封市",
        "data": [
          {
            "id": 2665,
            "val": "兰考县"
          },
          {
            "id": 2666,
            "val": "尉氏县"
          },
          {
            "id": 2667,
            "val": "开封县"
          },
          {
            "id": 2668,
            "val": "杞县"
          },
          {
            "id": 2669,
            "val": "禹王台区"
          },
          {
            "id": 2670,
            "val": "通许县"
          },
          {
            "id": 2671,
            "val": "金明区"
          },
          {
            "id": 2672,
            "val": "顺河回族区"
          },
          {
            "id": 2673,
            "val": "鼓楼区"
          },
          {
            "id": 2674,
            "val": "龙亭区"
          }
        ]
      },
      {
        "id": 242,
        "val": "洛阳市",
        "data": [
          {
            "id": 2675,
            "val": "伊川县"
          },
          {
            "id": 2676,
            "val": "偃师市"
          },
          {
            "id": 2677,
            "val": "吉利区"
          },
          {
            "id": 2678,
            "val": "孟津县"
          },
          {
            "id": 2679,
            "val": "宜阳县"
          },
          {
            "id": 2680,
            "val": "嵩县"
          },
          {
            "id": 2681,
            "val": "新安县"
          },
          {
            "id": 2682,
            "val": "栾川县"
          },
          {
            "id": 2683,
            "val": "汝阳县"
          },
          {
            "id": 2684,
            "val": "洛宁县"
          },
          {
            "id": 2685,
            "val": "洛龙区"
          },
          {
            "id": 2686,
            "val": "涧西区"
          },
          {
            "id": 2687,
            "val": "瀍河回族区"
          },
          {
            "id": 2688,
            "val": "老城区"
          },
          {
            "id": 2689,
            "val": "西工区"
          }
        ]
      },
      {
        "id": 243,
        "val": "平顶山市",
        "data": [
          {
            "id": 2690,
            "val": "卫东区"
          },
          {
            "id": 2691,
            "val": "叶县"
          },
          {
            "id": 2692,
            "val": "宝丰县"
          },
          {
            "id": 2693,
            "val": "新华区"
          },
          {
            "id": 2694,
            "val": "汝州市"
          },
          {
            "id": 2695,
            "val": "湛河区"
          },
          {
            "id": 2696,
            "val": "石龙区"
          },
          {
            "id": 2697,
            "val": "舞钢市"
          },
          {
            "id": 2698,
            "val": "郏县"
          },
          {
            "id": 2699,
            "val": "鲁山县"
          }
        ]
      },
      {
        "id": 244,
        "val": "安阳市",
        "data": [
          {
            "id": 2700,
            "val": "内黄县"
          },
          {
            "id": 2701,
            "val": "北关区"
          },
          {
            "id": 2702,
            "val": "安阳县"
          },
          {
            "id": 2703,
            "val": "文峰区"
          },
          {
            "id": 2704,
            "val": "林州市"
          },
          {
            "id": 2705,
            "val": "殷都区"
          },
          {
            "id": 2706,
            "val": "汤阴县"
          },
          {
            "id": 2707,
            "val": "滑县"
          },
          {
            "id": 2708,
            "val": "龙安区"
          }
        ]
      },
      {
        "id": 245,
        "val": "鹤壁市",
        "data": [
          {
            "id": 2709,
            "val": "山城区"
          },
          {
            "id": 2710,
            "val": "浚县"
          },
          {
            "id": 2711,
            "val": "淇县"
          },
          {
            "id": 2712,
            "val": "淇滨区"
          },
          {
            "id": 2713,
            "val": "鹤山区"
          }
        ]
      },
      {
        "id": 246,
        "val": "新乡市",
        "data": [
          {
            "id": 2714,
            "val": "凤泉区"
          },
          {
            "id": 2715,
            "val": "卫滨区"
          },
          {
            "id": 2716,
            "val": "卫辉市"
          },
          {
            "id": 2717,
            "val": "原阳县"
          },
          {
            "id": 2718,
            "val": "封丘县"
          },
          {
            "id": 2719,
            "val": "延津县"
          },
          {
            "id": 2720,
            "val": "新乡县"
          },
          {
            "id": 2721,
            "val": "牧野区"
          },
          {
            "id": 2722,
            "val": "红旗区"
          },
          {
            "id": 2723,
            "val": "获嘉县"
          },
          {
            "id": 2724,
            "val": "辉县市"
          },
          {
            "id": 2725,
            "val": "长垣县"
          }
        ]
      },
      {
        "id": 247,
        "val": "焦作市",
        "data": [
          {
            "id": 2726,
            "val": "中站区"
          },
          {
            "id": 2727,
            "val": "修武县"
          },
          {
            "id": 2728,
            "val": "博爱县"
          },
          {
            "id": 2729,
            "val": "孟州市"
          },
          {
            "id": 2730,
            "val": "山阳区"
          },
          {
            "id": 2731,
            "val": "武陟县"
          },
          {
            "id": 2732,
            "val": "沁阳市"
          },
          {
            "id": 2733,
            "val": "温县"
          },
          {
            "id": 2734,
            "val": "解放区"
          },
          {
            "id": 2735,
            "val": "马村区"
          }
        ]
      },
      {
        "id": 248,
        "val": "濮阳市",
        "data": [
          {
            "id": 2736,
            "val": "华龙区"
          },
          {
            "id": 2737,
            "val": "南乐县"
          },
          {
            "id": 2738,
            "val": "台前县"
          },
          {
            "id": 2739,
            "val": "清丰县"
          },
          {
            "id": 2740,
            "val": "濮阳县"
          },
          {
            "id": 2741,
            "val": "范县"
          }
        ]
      },
      {
        "id": 249,
        "val": "许昌市",
        "data": [
          {
            "id": 2742,
            "val": "禹州市"
          },
          {
            "id": 2743,
            "val": "襄城县"
          },
          {
            "id": 2744,
            "val": "许昌县"
          },
          {
            "id": 2745,
            "val": "鄢陵县"
          },
          {
            "id": 2746,
            "val": "长葛市"
          },
          {
            "id": 2747,
            "val": "魏都区"
          }
        ]
      },
      {
        "id": 250,
        "val": "漯河市",
        "data": [
          {
            "id": 2748,
            "val": "临颍县"
          },
          {
            "id": 2749,
            "val": "召陵区"
          },
          {
            "id": 2750,
            "val": "源汇区"
          },
          {
            "id": 2751,
            "val": "舞阳县"
          },
          {
            "id": 2752,
            "val": "郾城区"
          }
        ]
      },
      {
        "id": 251,
        "val": "三门峡市",
        "data": [
          {
            "id": 2753,
            "val": "义马市"
          },
          {
            "id": 2754,
            "val": "卢氏县"
          },
          {
            "id": 2755,
            "val": "渑池县"
          },
          {
            "id": 2756,
            "val": "湖滨区"
          },
          {
            "id": 2757,
            "val": "灵宝市"
          },
          {
            "id": 2758,
            "val": "陕县"
          }
        ]
      },
      {
        "id": 252,
        "val": "南阳市",
        "data": [
          {
            "id": 2759,
            "val": "内乡县"
          },
          {
            "id": 2760,
            "val": "南召县"
          },
          {
            "id": 2761,
            "val": "卧龙区"
          },
          {
            "id": 2762,
            "val": "唐河县"
          },
          {
            "id": 2763,
            "val": "宛城区"
          },
          {
            "id": 2764,
            "val": "新野县"
          },
          {
            "id": 2765,
            "val": "方城县"
          },
          {
            "id": 2766,
            "val": "桐柏县"
          },
          {
            "id": 2767,
            "val": "淅川县"
          },
          {
            "id": 2768,
            "val": "社旗县"
          },
          {
            "id": 2769,
            "val": "西峡县"
          },
          {
            "id": 2770,
            "val": "邓州市"
          },
          {
            "id": 2771,
            "val": "镇平县"
          }
        ]
      },
      {
        "id": 253,
        "val": "商丘市",
        "data": [
          {
            "id": 2772,
            "val": "夏邑县"
          },
          {
            "id": 2773,
            "val": "宁陵县"
          },
          {
            "id": 2774,
            "val": "柘城县"
          },
          {
            "id": 2775,
            "val": "民权县"
          },
          {
            "id": 2776,
            "val": "永城市"
          },
          {
            "id": 2777,
            "val": "睢县"
          },
          {
            "id": 2778,
            "val": "睢阳区"
          },
          {
            "id": 2779,
            "val": "粱园区"
          },
          {
            "id": 2780,
            "val": "虞城县"
          }
        ]
      },
      {
        "id": 254,
        "val": "信阳市",
        "data": [
          {
            "id": 2781,
            "val": "光山县"
          },
          {
            "id": 2782,
            "val": "商城县"
          },
          {
            "id": 2783,
            "val": "固始县"
          },
          {
            "id": 2784,
            "val": "平桥区"
          },
          {
            "id": 2785,
            "val": "息县"
          },
          {
            "id": 2786,
            "val": "新县"
          },
          {
            "id": 2787,
            "val": "浉河区"
          },
          {
            "id": 2788,
            "val": "淮滨县"
          },
          {
            "id": 2789,
            "val": "潢川县"
          },
          {
            "id": 2790,
            "val": "罗山县"
          }
        ]
      },
      {
        "id": 255,
        "val": "周口市",
        "data": [
          {
            "id": 2791,
            "val": "商水县"
          },
          {
            "id": 2792,
            "val": "太康县"
          },
          {
            "id": 2793,
            "val": "川汇区"
          },
          {
            "id": 2794,
            "val": "扶沟县"
          },
          {
            "id": 2795,
            "val": "沈丘县"
          },
          {
            "id": 2796,
            "val": "淮阳县"
          },
          {
            "id": 2797,
            "val": "西华县"
          },
          {
            "id": 2798,
            "val": "郸城县"
          },
          {
            "id": 2799,
            "val": "项城市"
          },
          {
            "id": 2800,
            "val": "鹿邑县"
          }
        ]
      },
      {
        "id": 256,
        "val": "驻马店市",
        "data": [
          {
            "id": 2801,
            "val": "上蔡县"
          },
          {
            "id": 2802,
            "val": "平舆县"
          },
          {
            "id": 2803,
            "val": "新蔡县"
          },
          {
            "id": 2804,
            "val": "正阳县"
          },
          {
            "id": 2805,
            "val": "汝南县"
          },
          {
            "id": 2806,
            "val": "泌阳县"
          },
          {
            "id": 2807,
            "val": "确山县"
          },
          {
            "id": 2808,
            "val": "西平县"
          },
          {
            "id": 2809,
            "val": "遂平县"
          },
          {
            "id": 2810,
            "val": "驿城区"
          }
        ]
      },
      {
        "id": 257,
        "val": "济源市",
        "data": [
          {
            "id": 2811,
            "val": "济源市"
          }
        ]
      }
    ]
  },
  {
    "id": 17,
    "val": "湖北",
    "data": [
      {
        "id": 258,
        "val": "武汉市",
        "data": [
          {
            "id": 2812,
            "val": "东西湖区"
          },
          {
            "id": 2813,
            "val": "新洲区"
          },
          {
            "id": 2814,
            "val": "武昌区"
          },
          {
            "id": 2815,
            "val": "汉南区"
          },
          {
            "id": 2816,
            "val": "汉阳区"
          },
          {
            "id": 2817,
            "val": "江夏区"
          },
          {
            "id": 2818,
            "val": "江岸区"
          },
          {
            "id": 2819,
            "val": "江汉区"
          },
          {
            "id": 2820,
            "val": "洪山区"
          },
          {
            "id": 2821,
            "val": "硚口区"
          },
          {
            "id": 2822,
            "val": "蔡甸区"
          },
          {
            "id": 2823,
            "val": "青山区"
          },
          {
            "id": 2824,
            "val": "黄陂区"
          }
        ]
      },
      {
        "id": 259,
        "val": "黄石市",
        "data": [
          {
            "id": 2825,
            "val": "下陆区"
          },
          {
            "id": 2826,
            "val": "大冶市"
          },
          {
            "id": 2827,
            "val": "西塞山区"
          },
          {
            "id": 2828,
            "val": "铁山区"
          },
          {
            "id": 2829,
            "val": "阳新县"
          },
          {
            "id": 2830,
            "val": "黄石港区"
          }
        ]
      },
      {
        "id": 260,
        "val": "十堰市",
        "data": [
          {
            "id": 2831,
            "val": "丹江口市"
          },
          {
            "id": 2832,
            "val": "张湾区"
          },
          {
            "id": 2833,
            "val": "房县"
          },
          {
            "id": 2834,
            "val": "竹山县"
          },
          {
            "id": 2835,
            "val": "竹溪县"
          },
          {
            "id": 2836,
            "val": "茅箭区"
          },
          {
            "id": 2837,
            "val": "郧县"
          },
          {
            "id": 2838,
            "val": "郧西县"
          }
        ]
      },
      {
        "id": 261,
        "val": "宜昌市",
        "data": [
          {
            "id": 2839,
            "val": "五峰土家族自治县"
          },
          {
            "id": 2840,
            "val": "伍家岗区"
          },
          {
            "id": 2841,
            "val": "兴山县"
          },
          {
            "id": 2842,
            "val": "夷陵区"
          },
          {
            "id": 2843,
            "val": "宜都市"
          },
          {
            "id": 2844,
            "val": "当阳市"
          },
          {
            "id": 2845,
            "val": "枝江市"
          },
          {
            "id": 2846,
            "val": "点军区"
          },
          {
            "id": 2847,
            "val": "秭归县"
          },
          {
            "id": 2848,
            "val": "虢亭区"
          },
          {
            "id": 2849,
            "val": "西陵区"
          },
          {
            "id": 2850,
            "val": "远安县"
          },
          {
            "id": 2851,
            "val": "长阳土家族自治县"
          }
        ]
      },
      {
        "id": 262,
        "val": "襄樊市",
        "data": [
          {
            "id": 2852,
            "val": "保康县"
          },
          {
            "id": 2853,
            "val": "南漳县"
          },
          {
            "id": 2854,
            "val": "宜城市"
          },
          {
            "id": 2855,
            "val": "枣阳市"
          },
          {
            "id": 2856,
            "val": "樊城区"
          },
          {
            "id": 2857,
            "val": "老河口市"
          },
          {
            "id": 2858,
            "val": "襄城区"
          },
          {
            "id": 2859,
            "val": "襄阳区"
          },
          {
            "id": 2860,
            "val": "谷城县"
          }
        ]
      },
      {
        "id": 263,
        "val": "鄂州市",
        "data": [
          {
            "id": 2861,
            "val": "华容区"
          },
          {
            "id": 2862,
            "val": "粱子湖"
          },
          {
            "id": 2863,
            "val": "鄂城区"
          }
        ]
      },
      {
        "id": 264,
        "val": "荆门市",
        "data": [
          {
            "id": 2864,
            "val": "东宝区"
          },
          {
            "id": 2865,
            "val": "京山县"
          },
          {
            "id": 2866,
            "val": "掇刀区"
          },
          {
            "id": 2867,
            "val": "沙洋县"
          },
          {
            "id": 2868,
            "val": "钟祥市"
          }
        ]
      },
      {
        "id": 265,
        "val": "孝感市",
        "data": [
          {
            "id": 2869,
            "val": "云梦县"
          },
          {
            "id": 2870,
            "val": "大悟县"
          },
          {
            "id": 2871,
            "val": "孝南区"
          },
          {
            "id": 2872,
            "val": "孝昌县"
          },
          {
            "id": 2873,
            "val": "安陆市"
          },
          {
            "id": 2874,
            "val": "应城市"
          },
          {
            "id": 2875,
            "val": "汉川市"
          }
        ]
      },
      {
        "id": 266,
        "val": "荆州市",
        "data": [
          {
            "id": 2876,
            "val": "公安县"
          },
          {
            "id": 2877,
            "val": "松滋市"
          },
          {
            "id": 2878,
            "val": "江陵县"
          },
          {
            "id": 2879,
            "val": "沙市区"
          },
          {
            "id": 2880,
            "val": "洪湖市"
          },
          {
            "id": 2881,
            "val": "监利县"
          },
          {
            "id": 2882,
            "val": "石首市"
          },
          {
            "id": 2883,
            "val": "荆州区"
          }
        ]
      },
      {
        "id": 267,
        "val": "黄冈市",
        "data": [
          {
            "id": 2884,
            "val": "团风县"
          },
          {
            "id": 2885,
            "val": "武穴市"
          },
          {
            "id": 2886,
            "val": "浠水县"
          },
          {
            "id": 2887,
            "val": "红安县"
          },
          {
            "id": 2888,
            "val": "罗田县"
          },
          {
            "id": 2889,
            "val": "英山县"
          },
          {
            "id": 2890,
            "val": "蕲春县"
          },
          {
            "id": 2891,
            "val": "麻城市"
          },
          {
            "id": 2892,
            "val": "黄州区"
          },
          {
            "id": 2893,
            "val": "黄梅县"
          }
        ]
      },
      {
        "id": 268,
        "val": "咸宁市",
        "data": [
          {
            "id": 2894,
            "val": "咸安区"
          },
          {
            "id": 2895,
            "val": "嘉鱼县"
          },
          {
            "id": 2896,
            "val": "崇阳县"
          },
          {
            "id": 2897,
            "val": "赤壁市"
          },
          {
            "id": 2898,
            "val": "通城县"
          },
          {
            "id": 2899,
            "val": "通山县"
          }
        ]
      },
      {
        "id": 269,
        "val": "随州市",
        "data": [
          {
            "id": 2900,
            "val": "广水市"
          },
          {
            "id": 2901,
            "val": "曾都区"
          }
        ]
      },
      {
        "id": 270,
        "val": "恩施土家族苗族自治州",
        "data": [
          {
            "id": 2902,
            "val": "利川市"
          },
          {
            "id": 2903,
            "val": "咸丰县"
          },
          {
            "id": 2904,
            "val": "宣恩县"
          },
          {
            "id": 2905,
            "val": "巴东县"
          },
          {
            "id": 2906,
            "val": "建始县"
          },
          {
            "id": 2907,
            "val": "恩施市"
          },
          {
            "id": 2908,
            "val": "来凤县"
          },
          {
            "id": 2909,
            "val": "鹤峰县"
          }
        ]
      },
      {
        "id": 271,
        "val": "仙桃市",
        "data": [
          {
            "id": 2910,
            "val": "仙桃市"
          }
        ]
      },
      {
        "id": 272,
        "val": "潜江市",
        "data": [
          {
            "id": 2911,
            "val": "潜江市"
          }
        ]
      },
      {
        "id": 273,
        "val": "天门市",
        "data": [
          {
            "id": 2912,
            "val": "天门市"
          }
        ]
      },
      {
        "id": 274,
        "val": "神农架林区",
        "data": [
          {
            "id": 2913,
            "val": "神农架林区"
          }
        ]
      }
    ]
  },
  {
    "id": 18,
    "val": "湖南",
    "data": [
      {
        "id": 275,
        "val": "长沙市",
        "data": [
          {
            "id": 2914,
            "val": "天心区"
          },
          {
            "id": 2915,
            "val": "宁乡县"
          },
          {
            "id": 2916,
            "val": "岳麓区"
          },
          {
            "id": 2917,
            "val": "开福区"
          },
          {
            "id": 2918,
            "val": "望城县"
          },
          {
            "id": 2919,
            "val": "浏阳市"
          },
          {
            "id": 2920,
            "val": "芙蓉区"
          },
          {
            "id": 2921,
            "val": "长沙县"
          },
          {
            "id": 2922,
            "val": "雨花区"
          }
        ]
      },
      {
        "id": 276,
        "val": "株洲市",
        "data": [
          {
            "id": 2923,
            "val": "天元区"
          },
          {
            "id": 2924,
            "val": "攸县"
          },
          {
            "id": 2925,
            "val": "株洲县"
          },
          {
            "id": 2926,
            "val": "炎陵县"
          },
          {
            "id": 2927,
            "val": "石峰区"
          },
          {
            "id": 2928,
            "val": "芦淞区"
          },
          {
            "id": 2929,
            "val": "茶陵县"
          },
          {
            "id": 2930,
            "val": "荷塘区"
          },
          {
            "id": 2931,
            "val": "醴陵市"
          }
        ]
      },
      {
        "id": 277,
        "val": "湘潭市",
        "data": [
          {
            "id": 2932,
            "val": "岳塘区"
          },
          {
            "id": 2933,
            "val": "湘乡市"
          },
          {
            "id": 2934,
            "val": "湘潭县"
          },
          {
            "id": 2935,
            "val": "雨湖区"
          },
          {
            "id": 2936,
            "val": "韶山市"
          }
        ]
      },
      {
        "id": 278,
        "val": "衡阳市",
        "data": [
          {
            "id": 2937,
            "val": "南岳区"
          },
          {
            "id": 2938,
            "val": "常宁市"
          },
          {
            "id": 2939,
            "val": "珠晖区"
          },
          {
            "id": 2940,
            "val": "石鼓区"
          },
          {
            "id": 2941,
            "val": "祁东县"
          },
          {
            "id": 2942,
            "val": "耒阳市"
          },
          {
            "id": 2943,
            "val": "蒸湘区"
          },
          {
            "id": 2944,
            "val": "衡东县"
          },
          {
            "id": 2945,
            "val": "衡南县"
          },
          {
            "id": 2946,
            "val": "衡山县"
          },
          {
            "id": 2947,
            "val": "衡阳县"
          },
          {
            "id": 2948,
            "val": "雁峰区"
          }
        ]
      },
      {
        "id": 279,
        "val": "邵阳市",
        "data": [
          {
            "id": 2949,
            "val": "北塔区"
          },
          {
            "id": 2950,
            "val": "双清区"
          },
          {
            "id": 2951,
            "val": "城步苗族自治县"
          },
          {
            "id": 2952,
            "val": "大祥区"
          },
          {
            "id": 2953,
            "val": "新宁县"
          },
          {
            "id": 2954,
            "val": "新邵县"
          },
          {
            "id": 2955,
            "val": "武冈市"
          },
          {
            "id": 2956,
            "val": "洞口县"
          },
          {
            "id": 2957,
            "val": "绥宁县"
          },
          {
            "id": 2958,
            "val": "邵东县"
          },
          {
            "id": 2959,
            "val": "邵阳县"
          },
          {
            "id": 2960,
            "val": "隆回县"
          }
        ]
      },
      {
        "id": 280,
        "val": "岳阳市",
        "data": [
          {
            "id": 2961,
            "val": "临湘市"
          },
          {
            "id": 2962,
            "val": "云溪区"
          },
          {
            "id": 2963,
            "val": "华容县"
          },
          {
            "id": 2964,
            "val": "君山区"
          },
          {
            "id": 2965,
            "val": "岳阳县"
          },
          {
            "id": 2966,
            "val": "岳阳楼区"
          },
          {
            "id": 2967,
            "val": "平江县"
          },
          {
            "id": 2968,
            "val": "汨罗市"
          },
          {
            "id": 2969,
            "val": "湘阴县"
          }
        ]
      },
      {
        "id": 281,
        "val": "常德市",
        "data": [
          {
            "id": 2970,
            "val": "临澧县"
          },
          {
            "id": 2971,
            "val": "安乡县"
          },
          {
            "id": 2972,
            "val": "桃源县"
          },
          {
            "id": 2973,
            "val": "武陵区"
          },
          {
            "id": 2974,
            "val": "汉寿县"
          },
          {
            "id": 2975,
            "val": "津市市"
          },
          {
            "id": 2976,
            "val": "澧县"
          },
          {
            "id": 2977,
            "val": "石门县"
          },
          {
            "id": 2978,
            "val": "鼎城区"
          }
        ]
      },
      {
        "id": 282,
        "val": "张家界市",
        "data": [
          {
            "id": 2979,
            "val": "慈利县"
          },
          {
            "id": 2980,
            "val": "桑植县"
          },
          {
            "id": 2981,
            "val": "武陵源区"
          },
          {
            "id": 2982,
            "val": "永定区"
          }
        ]
      },
      {
        "id": 283,
        "val": "益阳市",
        "data": [
          {
            "id": 2983,
            "val": "南县"
          },
          {
            "id": 2984,
            "val": "安化县"
          },
          {
            "id": 2985,
            "val": "桃江县"
          },
          {
            "id": 2986,
            "val": "沅江市"
          },
          {
            "id": 2987,
            "val": "资阳区"
          },
          {
            "id": 2988,
            "val": "赫山区"
          }
        ]
      },
      {
        "id": 284,
        "val": "郴州市",
        "data": [
          {
            "id": 2989,
            "val": "临武县"
          },
          {
            "id": 2990,
            "val": "北湖区"
          },
          {
            "id": 2991,
            "val": "嘉禾县"
          },
          {
            "id": 2992,
            "val": "安仁县"
          },
          {
            "id": 2993,
            "val": "宜章县"
          },
          {
            "id": 2994,
            "val": "桂东县"
          },
          {
            "id": 2995,
            "val": "桂阳县"
          },
          {
            "id": 2996,
            "val": "永兴县"
          },
          {
            "id": 2997,
            "val": "汝城县"
          },
          {
            "id": 2998,
            "val": "苏仙区"
          },
          {
            "id": 2999,
            "val": "资兴市"
          }
        ]
      },
      {
        "id": 285,
        "val": "永州市",
        "data": [
          {
            "id": 3000,
            "val": "东安县"
          },
          {
            "id": 3001,
            "val": "冷水滩区"
          },
          {
            "id": 3002,
            "val": "双牌县"
          },
          {
            "id": 3003,
            "val": "宁远县"
          },
          {
            "id": 3004,
            "val": "新田县"
          },
          {
            "id": 3005,
            "val": "江华瑶族自治县"
          },
          {
            "id": 3006,
            "val": "江永县"
          },
          {
            "id": 3007,
            "val": "祁阳县"
          },
          {
            "id": 3008,
            "val": "蓝山县"
          },
          {
            "id": 3009,
            "val": "道县"
          },
          {
            "id": 3010,
            "val": "零陵区"
          }
        ]
      },
      {
        "id": 286,
        "val": "怀化市",
        "data": [
          {
            "id": 3011,
            "val": "中方县"
          },
          {
            "id": 3012,
            "val": "会同县"
          },
          {
            "id": 3013,
            "val": "新晃侗族自治县"
          },
          {
            "id": 3014,
            "val": "沅陵县"
          },
          {
            "id": 3015,
            "val": "洪江市/洪江区"
          },
          {
            "id": 3016,
            "val": "溆浦县"
          },
          {
            "id": 3017,
            "val": "芷江侗族自治县"
          },
          {
            "id": 3018,
            "val": "辰溪县"
          },
          {
            "id": 3019,
            "val": "通道侗族自治县"
          },
          {
            "id": 3020,
            "val": "靖州苗族侗族自治县"
          },
          {
            "id": 3021,
            "val": "鹤城区"
          },
          {
            "id": 3022,
            "val": "麻阳苗族自治县"
          }
        ]
      },
      {
        "id": 287,
        "val": "娄底市",
        "data": [
          {
            "id": 3023,
            "val": "冷水江市"
          },
          {
            "id": 3024,
            "val": "双峰县"
          },
          {
            "id": 3025,
            "val": "娄星区"
          },
          {
            "id": 3026,
            "val": "新化县"
          },
          {
            "id": 3027,
            "val": "涟源市"
          }
        ]
      },
      {
        "id": 288,
        "val": "湘西土家族苗族自治州",
        "data": [
          {
            "id": 3028,
            "val": "保靖县"
          },
          {
            "id": 3029,
            "val": "凤凰县"
          },
          {
            "id": 3030,
            "val": "古丈县"
          },
          {
            "id": 3031,
            "val": "吉首市"
          },
          {
            "id": 3032,
            "val": "永顺县"
          },
          {
            "id": 3033,
            "val": "泸溪县"
          },
          {
            "id": 3034,
            "val": "花垣县"
          },
          {
            "id": 3035,
            "val": "龙山县"
          }
        ]
      }
    ]
  },
  {
    "id": 19,
    "val": "广东",
    "data": [
      {
        "id": 289,
        "val": "广州市",
        "data": [
          {
            "id": 3036,
            "val": "萝岗区"
          },
          {
            "id": 3037,
            "val": "南沙区"
          },
          {
            "id": 3038,
            "val": "从化市"
          },
          {
            "id": 3039,
            "val": "增城市"
          },
          {
            "id": 3040,
            "val": "天河区"
          },
          {
            "id": 3041,
            "val": "海珠区"
          },
          {
            "id": 3042,
            "val": "番禺区"
          },
          {
            "id": 3043,
            "val": "白云区"
          },
          {
            "id": 3044,
            "val": "花都区"
          },
          {
            "id": 3045,
            "val": "荔湾区"
          },
          {
            "id": 3046,
            "val": "越秀区"
          },
          {
            "id": 3047,
            "val": "黄埔区"
          }
        ]
      },
      {
        "id": 290,
        "val": "韶关市",
        "data": [
          {
            "id": 3048,
            "val": "乐昌市"
          },
          {
            "id": 3049,
            "val": "乳源瑶族自治县"
          },
          {
            "id": 3050,
            "val": "仁化县"
          },
          {
            "id": 3051,
            "val": "南雄市"
          },
          {
            "id": 3052,
            "val": "始兴县"
          },
          {
            "id": 3053,
            "val": "新丰县"
          },
          {
            "id": 3054,
            "val": "曲江区"
          },
          {
            "id": 3055,
            "val": "武江区"
          },
          {
            "id": 3056,
            "val": "浈江区"
          },
          {
            "id": 3057,
            "val": "翁源县"
          }
        ]
      },
      {
        "id": 291,
        "val": "深圳市",
        "data": [
          {
            "id": 3058,
            "val": "南山区"
          },
          {
            "id": 3059,
            "val": "宝安区"
          },
          {
            "id": 3060,
            "val": "盐田区"
          },
          {
            "id": 3061,
            "val": "福田区"
          },
          {
            "id": 3062,
            "val": "罗湖区"
          },
          {
            "id": 3063,
            "val": "龙岗区"
          }
        ]
      },
      {
        "id": 292,
        "val": "珠海市",
        "data": [
          {
            "id": 3064,
            "val": "斗门区"
          },
          {
            "id": 3065,
            "val": "金湾区"
          },
          {
            "id": 3066,
            "val": "香洲区"
          }
        ]
      },
      {
        "id": 293,
        "val": "汕头市",
        "data": [
          {
            "id": 3067,
            "val": "南澳县"
          },
          {
            "id": 3068,
            "val": "潮南区"
          },
          {
            "id": 3069,
            "val": "潮阳区"
          },
          {
            "id": 3070,
            "val": "澄海区"
          },
          {
            "id": 3071,
            "val": "濠江区"
          },
          {
            "id": 3072,
            "val": "金平区"
          },
          {
            "id": 3073,
            "val": "龙湖区"
          }
        ]
      },
      {
        "id": 294,
        "val": "佛山市",
        "data": [
          {
            "id": 3074,
            "val": "三水区"
          },
          {
            "id": 3075,
            "val": "南海区"
          },
          {
            "id": 3076,
            "val": "禅城区"
          },
          {
            "id": 3077,
            "val": "顺德区"
          },
          {
            "id": 3078,
            "val": "高明区"
          }
        ]
      },
      {
        "id": 295,
        "val": "江门市",
        "data": [
          {
            "id": 3079,
            "val": "台山市"
          },
          {
            "id": 3080,
            "val": "开平市"
          },
          {
            "id": 3081,
            "val": "恩平市"
          },
          {
            "id": 3082,
            "val": "新会区"
          },
          {
            "id": 3083,
            "val": "江海区"
          },
          {
            "id": 3084,
            "val": "蓬江区"
          },
          {
            "id": 3085,
            "val": "鹤山市"
          }
        ]
      },
      {
        "id": 296,
        "val": "湛江市",
        "data": [
          {
            "id": 3086,
            "val": "吴川市"
          },
          {
            "id": 3087,
            "val": "坡头区"
          },
          {
            "id": 3088,
            "val": "廉江市"
          },
          {
            "id": 3089,
            "val": "徐闻县"
          },
          {
            "id": 3090,
            "val": "赤坎区"
          },
          {
            "id": 3091,
            "val": "遂溪县"
          },
          {
            "id": 3092,
            "val": "雷州市"
          },
          {
            "id": 3093,
            "val": "霞山区"
          },
          {
            "id": 3094,
            "val": "麻章区"
          }
        ]
      },
      {
        "id": 297,
        "val": "茂名市",
        "data": [
          {
            "id": 3095,
            "val": "信宜市"
          },
          {
            "id": 3096,
            "val": "化州市"
          },
          {
            "id": 3097,
            "val": "电白县"
          },
          {
            "id": 3098,
            "val": "茂南区"
          },
          {
            "id": 3099,
            "val": "茂港区"
          },
          {
            "id": 3100,
            "val": "高州市"
          }
        ]
      },
      {
        "id": 298,
        "val": "肇庆市",
        "data": [
          {
            "id": 3101,
            "val": "四会市"
          },
          {
            "id": 3102,
            "val": "封开县"
          },
          {
            "id": 3103,
            "val": "广宁县"
          },
          {
            "id": 3104,
            "val": "德庆县"
          },
          {
            "id": 3105,
            "val": "怀集县"
          },
          {
            "id": 3106,
            "val": "端州区"
          },
          {
            "id": 3107,
            "val": "高要市"
          },
          {
            "id": 3108,
            "val": "鼎湖区"
          }
        ]
      },
      {
        "id": 299,
        "val": "惠州市",
        "data": [
          {
            "id": 3109,
            "val": "博罗县"
          },
          {
            "id": 3110,
            "val": "惠东县"
          },
          {
            "id": 3111,
            "val": "惠城区"
          },
          {
            "id": 3112,
            "val": "惠阳区"
          },
          {
            "id": 3113,
            "val": "龙门县"
          }
        ]
      },
      {
        "id": 300,
        "val": "梅州市",
        "data": [
          {
            "id": 3114,
            "val": "丰顺县"
          },
          {
            "id": 3115,
            "val": "五华县"
          },
          {
            "id": 3116,
            "val": "兴宁市"
          },
          {
            "id": 3117,
            "val": "大埔县"
          },
          {
            "id": 3118,
            "val": "平远县"
          },
          {
            "id": 3119,
            "val": "梅县"
          },
          {
            "id": 3120,
            "val": "梅江区"
          },
          {
            "id": 3121,
            "val": "蕉岭县"
          }
        ]
      },
      {
        "id": 301,
        "val": "汕尾市",
        "data": [
          {
            "id": 3122,
            "val": "城区"
          },
          {
            "id": 3123,
            "val": "海丰县"
          },
          {
            "id": 3124,
            "val": "陆丰市"
          },
          {
            "id": 3125,
            "val": "陆河县"
          }
        ]
      },
      {
        "id": 302,
        "val": "河源市",
        "data": [
          {
            "id": 3126,
            "val": "东源县"
          },
          {
            "id": 3127,
            "val": "和平县"
          },
          {
            "id": 3128,
            "val": "源城区"
          },
          {
            "id": 3129,
            "val": "紫金县"
          },
          {
            "id": 3130,
            "val": "连平县"
          },
          {
            "id": 3131,
            "val": "龙川县"
          }
        ]
      },
      {
        "id": 303,
        "val": "阳江市",
        "data": [
          {
            "id": 3132,
            "val": "江城区"
          },
          {
            "id": 3133,
            "val": "阳东县"
          },
          {
            "id": 3134,
            "val": "阳春市"
          },
          {
            "id": 3135,
            "val": "阳西县"
          }
        ]
      },
      {
        "id": 304,
        "val": "清远市",
        "data": [
          {
            "id": 3136,
            "val": "佛冈县"
          },
          {
            "id": 3137,
            "val": "清城区"
          },
          {
            "id": 3138,
            "val": "清新县"
          },
          {
            "id": 3139,
            "val": "英德市"
          },
          {
            "id": 3140,
            "val": "连南瑶族自治县"
          },
          {
            "id": 3141,
            "val": "连山壮族瑶族自治县"
          },
          {
            "id": 3142,
            "val": "连州市"
          },
          {
            "id": 3143,
            "val": "阳山县"
          }
        ]
      },
      {
        "id": 305,
        "val": "东莞市",
        "data": [
          {
            "id": 3144,
            "val": "东莞市"
          }
        ]
      },
      {
        "id": 306,
        "val": "中山市",
        "data": [
          {
            "id": 3145,
            "val": "中山市"
          }
        ]
      },
      {
        "id": 307,
        "val": "潮州市",
        "data": [
          {
            "id": 3146,
            "val": "湘桥区"
          },
          {
            "id": 3147,
            "val": "潮安县"
          },
          {
            "id": 3148,
            "val": "饶平县"
          }
        ]
      },
      {
        "id": 308,
        "val": "揭阳市",
        "data": [
          {
            "id": 3149,
            "val": "惠来县"
          },
          {
            "id": 3150,
            "val": "揭东县"
          },
          {
            "id": 3151,
            "val": "揭西县"
          },
          {
            "id": 3152,
            "val": "普宁市"
          },
          {
            "id": 3153,
            "val": "榕城区"
          }
        ]
      },
      {
        "id": 309,
        "val": "云浮市",
        "data": [
          {
            "id": 3154,
            "val": "云城区"
          },
          {
            "id": 3155,
            "val": "云安县"
          },
          {
            "id": 3156,
            "val": "新兴县"
          },
          {
            "id": 3157,
            "val": "罗定市"
          },
          {
            "id": 3158,
            "val": "郁南县"
          }
        ]
      }
    ]
  },
  {
    "id": 20,
    "val": "广西",
    "data": [
      {
        "id": 310,
        "val": "南宁市",
        "data": [
          {
            "id": 3159,
            "val": "上林县"
          },
          {
            "id": 3160,
            "val": "兴宁区"
          },
          {
            "id": 3161,
            "val": "宾阳县"
          },
          {
            "id": 3162,
            "val": "横县"
          },
          {
            "id": 3163,
            "val": "武鸣县"
          },
          {
            "id": 3164,
            "val": "江南区"
          },
          {
            "id": 3165,
            "val": "良庆区"
          },
          {
            "id": 3166,
            "val": "西乡塘区"
          },
          {
            "id": 3167,
            "val": "邕宁区"
          },
          {
            "id": 3168,
            "val": "隆安县"
          },
          {
            "id": 3169,
            "val": "青秀区"
          },
          {
            "id": 3170,
            "val": "马山县"
          }
        ]
      },
      {
        "id": 311,
        "val": "柳州市",
        "data": [
          {
            "id": 3171,
            "val": "三江侗族自治县"
          },
          {
            "id": 3172,
            "val": "城中区"
          },
          {
            "id": 3173,
            "val": "柳北区"
          },
          {
            "id": 3174,
            "val": "柳南区"
          },
          {
            "id": 3175,
            "val": "柳城县"
          },
          {
            "id": 3176,
            "val": "柳江县"
          },
          {
            "id": 3177,
            "val": "融安县"
          },
          {
            "id": 3178,
            "val": "融水苗族自治县"
          },
          {
            "id": 3179,
            "val": "鱼峰区"
          },
          {
            "id": 3180,
            "val": "鹿寨县"
          }
        ]
      },
      {
        "id": 312,
        "val": "桂林市",
        "data": [
          {
            "id": 3181,
            "val": "七星区"
          },
          {
            "id": 3182,
            "val": "临桂县"
          },
          {
            "id": 3183,
            "val": "全州县"
          },
          {
            "id": 3184,
            "val": "兴安县"
          },
          {
            "id": 3185,
            "val": "叠彩区"
          },
          {
            "id": 3186,
            "val": "平乐县"
          },
          {
            "id": 3187,
            "val": "恭城瑶族自治县"
          },
          {
            "id": 3188,
            "val": "永福县"
          },
          {
            "id": 3189,
            "val": "灌阳县"
          },
          {
            "id": 3190,
            "val": "灵川县"
          },
          {
            "id": 3191,
            "val": "秀峰区"
          },
          {
            "id": 3192,
            "val": "荔浦县"
          },
          {
            "id": 3193,
            "val": "象山区"
          },
          {
            "id": 3194,
            "val": "资源县"
          },
          {
            "id": 3195,
            "val": "阳朔县"
          },
          {
            "id": 3196,
            "val": "雁山区"
          },
          {
            "id": 3197,
            "val": "龙胜各族自治县"
          }
        ]
      },
      {
        "id": 313,
        "val": "梧州市",
        "data": [
          {
            "id": 3198,
            "val": "万秀区"
          },
          {
            "id": 3199,
            "val": "岑溪市"
          },
          {
            "id": 3200,
            "val": "苍梧县"
          },
          {
            "id": 3201,
            "val": "蒙山县"
          },
          {
            "id": 3202,
            "val": "藤县"
          },
          {
            "id": 3203,
            "val": "蝶山区"
          },
          {
            "id": 3204,
            "val": "长洲区"
          }
        ]
      },
      {
        "id": 314,
        "val": "北海市",
        "data": [
          {
            "id": 3205,
            "val": "合浦县"
          },
          {
            "id": 3206,
            "val": "海城区"
          },
          {
            "id": 3207,
            "val": "铁山港区"
          },
          {
            "id": 3208,
            "val": "银海区"
          }
        ]
      },
      {
        "id": 315,
        "val": "防城港市",
        "data": [
          {
            "id": 3209,
            "val": "上思县"
          },
          {
            "id": 3210,
            "val": "东兴市"
          },
          {
            "id": 3211,
            "val": "港口区"
          },
          {
            "id": 3212,
            "val": "防城区"
          }
        ]
      },
      {
        "id": 316,
        "val": "钦州市",
        "data": [
          {
            "id": 3213,
            "val": "浦北县"
          },
          {
            "id": 3214,
            "val": "灵山县"
          },
          {
            "id": 3215,
            "val": "钦北区"
          },
          {
            "id": 3216,
            "val": "钦南区"
          }
        ]
      },
      {
        "id": 317,
        "val": "贵港市",
        "data": [
          {
            "id": 3217,
            "val": "平南县"
          },
          {
            "id": 3218,
            "val": "桂平市"
          },
          {
            "id": 3219,
            "val": "港北区"
          },
          {
            "id": 3220,
            "val": "港南区"
          },
          {
            "id": 3221,
            "val": "覃塘区"
          }
        ]
      },
      {
        "id": 318,
        "val": "玉林市",
        "data": [
          {
            "id": 3222,
            "val": "兴业县"
          },
          {
            "id": 3223,
            "val": "北流市"
          },
          {
            "id": 3224,
            "val": "博白县"
          },
          {
            "id": 3225,
            "val": "容县"
          },
          {
            "id": 3226,
            "val": "玉州区"
          },
          {
            "id": 3227,
            "val": "陆川县"
          }
        ]
      },
      {
        "id": 319,
        "val": "百色市",
        "data": [
          {
            "id": 3228,
            "val": "乐业县"
          },
          {
            "id": 3229,
            "val": "凌云县"
          },
          {
            "id": 3230,
            "val": "右江区"
          },
          {
            "id": 3231,
            "val": "平果县"
          },
          {
            "id": 3232,
            "val": "德保县"
          },
          {
            "id": 3233,
            "val": "田东县"
          },
          {
            "id": 3234,
            "val": "田林县"
          },
          {
            "id": 3235,
            "val": "田阳县"
          },
          {
            "id": 3236,
            "val": "西林县"
          },
          {
            "id": 3237,
            "val": "那坡县"
          },
          {
            "id": 3238,
            "val": "隆林各族自治县"
          },
          {
            "id": 3239,
            "val": "靖西县"
          }
        ]
      },
      {
        "id": 320,
        "val": "贺州市",
        "data": [
          {
            "id": 3240,
            "val": "八步区"
          },
          {
            "id": 3241,
            "val": "富川瑶族自治县"
          },
          {
            "id": 3242,
            "val": "昭平县"
          },
          {
            "id": 3243,
            "val": "钟山县"
          }
        ]
      },
      {
        "id": 321,
        "val": "河池市",
        "data": [
          {
            "id": 3244,
            "val": "东兰县"
          },
          {
            "id": 3245,
            "val": "凤山县"
          },
          {
            "id": 3246,
            "val": "南丹县"
          },
          {
            "id": 3247,
            "val": "大化瑶族自治县"
          },
          {
            "id": 3248,
            "val": "天峨县"
          },
          {
            "id": 3249,
            "val": "宜州市"
          },
          {
            "id": 3250,
            "val": "巴马瑶族自治县"
          },
          {
            "id": 3251,
            "val": "环江毛南族自治县"
          },
          {
            "id": 3252,
            "val": "罗城仫佬族自治县"
          },
          {
            "id": 3253,
            "val": "都安瑶族自治县"
          },
          {
            "id": 3254,
            "val": "金城江区"
          }
        ]
      },
      {
        "id": 322,
        "val": "来宾市",
        "data": [
          {
            "id": 3255,
            "val": "兴宾区"
          },
          {
            "id": 3256,
            "val": "合山市"
          },
          {
            "id": 3257,
            "val": "忻城县"
          },
          {
            "id": 3258,
            "val": "武宣县"
          },
          {
            "id": 3259,
            "val": "象州县"
          },
          {
            "id": 3260,
            "val": "金秀瑶族自治县"
          }
        ]
      },
      {
        "id": 323,
        "val": "崇左市",
        "data": [
          {
            "id": 3261,
            "val": "凭祥市"
          },
          {
            "id": 3262,
            "val": "大新县"
          },
          {
            "id": 3263,
            "val": "天等县"
          },
          {
            "id": 3264,
            "val": "宁明县"
          },
          {
            "id": 3265,
            "val": "扶绥县"
          },
          {
            "id": 3266,
            "val": "江州区"
          },
          {
            "id": 3267,
            "val": "龙州县"
          }
        ]
      }
    ]
  },
  {
    "id": 21,
    "val": "海南",
    "data": [
      {
        "id": 324,
        "val": "海口市",
        "data": [
          {
            "id": 3268,
            "val": "琼山区"
          },
          {
            "id": 3269,
            "val": "秀英区"
          },
          {
            "id": 3270,
            "val": "美兰区"
          },
          {
            "id": 3271,
            "val": "龙华区"
          }
        ]
      },
      {
        "id": 325,
        "val": "三亚市",
        "data": [
          {
            "id": 3272,
            "val": "三亚市"
          }
        ]
      },
      {
        "id": 326,
        "val": "五指山市",
        "data": [
          {
            "id": 3273,
            "val": "五指山市"
          }
        ]
      },
      {
        "id": 327,
        "val": "琼海市",
        "data": [
          {
            "id": 3274,
            "val": "琼海市"
          }
        ]
      },
      {
        "id": 328,
        "val": "儋州市",
        "data": [
          {
            "id": 3275,
            "val": "儋州市"
          }
        ]
      },
      {
        "id": 329,
        "val": "文昌市",
        "data": [
          {
            "id": 3276,
            "val": "文昌市"
          }
        ]
      },
      {
        "id": 330,
        "val": "万宁市",
        "data": [
          {
            "id": 3277,
            "val": "万宁市"
          }
        ]
      },
      {
        "id": 331,
        "val": "东方市",
        "data": [
          {
            "id": 3278,
            "val": "东方市"
          }
        ]
      },
      {
        "id": 332,
        "val": "定安县",
        "data": [
          {
            "id": 3279,
            "val": "定安县"
          }
        ]
      },
      {
        "id": 333,
        "val": "屯昌县",
        "data": [
          {
            "id": 3280,
            "val": "屯昌县"
          }
        ]
      },
      {
        "id": 334,
        "val": "澄迈县",
        "data": [
          {
            "id": 3281,
            "val": "澄迈县"
          }
        ]
      },
      {
        "id": 335,
        "val": "临高县",
        "data": [
          {
            "id": 3282,
            "val": "临高县"
          }
        ]
      },
      {
        "id": 336,
        "val": "白沙黎族自治县",
        "data": [
          {
            "id": 3283,
            "val": "白沙黎族自治县"
          }
        ]
      },
      {
        "id": 337,
        "val": "昌江黎族自治县",
        "data": [
          {
            "id": 3284,
            "val": "昌江黎族自治县"
          }
        ]
      },
      {
        "id": 338,
        "val": "乐东黎族自治县",
        "data": [
          {
            "id": 3285,
            "val": "乐东黎族自治县"
          }
        ]
      },
      {
        "id": 339,
        "val": "陵水黎族自治县",
        "data": [
          {
            "id": 3286,
            "val": "陵水黎族自治县"
          }
        ]
      },
      {
        "id": 340,
        "val": "保亭黎族苗族自治县",
        "data": [
          {
            "id": 3287,
            "val": "保亭黎族苗族自治县"
          }
        ]
      },
      {
        "id": 341,
        "val": "琼中黎族苗族自治县",
        "data": [
          {
            "id": 3288,
            "val": "琼中黎族苗族自治县"
          }
        ]
      },
      {
        "id": 342,
        "val": "西沙群岛"
      },
      {
        "id": 343,
        "val": "南沙群岛"
      },
      {
        "id": 344,
        "val": "中沙群岛的岛礁及其海域"
      }
    ]
  },
  {
    "id": 22,
    "val": "重庆",
    "data": [
      {
        "id": 62,
        "val": "重庆市",
        "data": [
          {
            "id": 345,
            "val": "万州区"
          },
          {
            "id": 346,
            "val": "涪陵区"
          },
          {
            "id": 347,
            "val": "渝中区"
          },
          {
            "id": 348,
            "val": "大渡口区"
          },
          {
            "id": 349,
            "val": "江北区"
          },
          {
            "id": 350,
            "val": "沙坪坝区"
          },
          {
            "id": 351,
            "val": "九龙坡区"
          },
          {
            "id": 352,
            "val": "南岸区"
          },
          {
            "id": 353,
            "val": "北碚区"
          },
          {
            "id": 354,
            "val": "双桥区"
          },
          {
            "id": 355,
            "val": "万盛区"
          },
          {
            "id": 356,
            "val": "渝北区"
          },
          {
            "id": 357,
            "val": "巴南区"
          },
          {
            "id": 358,
            "val": "黔江区"
          },
          {
            "id": 359,
            "val": "长寿区"
          },
          {
            "id": 360,
            "val": "綦江县"
          },
          {
            "id": 361,
            "val": "潼南县"
          },
          {
            "id": 362,
            "val": "铜梁县"
          },
          {
            "id": 363,
            "val": "大足县"
          },
          {
            "id": 364,
            "val": "荣昌县"
          },
          {
            "id": 365,
            "val": "璧山县"
          },
          {
            "id": 366,
            "val": "梁平县"
          },
          {
            "id": 367,
            "val": "城口县"
          },
          {
            "id": 368,
            "val": "丰都县"
          },
          {
            "id": 369,
            "val": "垫江县"
          },
          {
            "id": 370,
            "val": "武隆县"
          },
          {
            "id": 371,
            "val": "忠县"
          },
          {
            "id": 372,
            "val": "开县"
          },
          {
            "id": 373,
            "val": "云阳县"
          },
          {
            "id": 374,
            "val": "奉节县"
          },
          {
            "id": 375,
            "val": "巫山县"
          },
          {
            "id": 376,
            "val": "巫溪县"
          },
          {
            "id": 377,
            "val": "石柱土家族自治县"
          },
          {
            "id": 378,
            "val": "秀山土家族苗族自治县"
          },
          {
            "id": 379,
            "val": "酉阳土家族苗族自治县"
          },
          {
            "id": 380,
            "val": "彭水苗族土家族自治县"
          },
          {
            "id": 381,
            "val": "江津市"
          },
          {
            "id": 382,
            "val": "合川市"
          },
          {
            "id": 383,
            "val": "永川市"
          },
          {
            "id": 384,
            "val": "南川市"
          }
        ]
      }
    ]
  },
  {
    "id": 23,
    "val": "四川",
    "data": [
      {
        "id": 385,
        "val": "成都市",
        "data": [
          {
            "id": 4209,
            "val": "双流县"
          },
          {
            "id": 4210,
            "val": "大邑县"
          },
          {
            "id": 4211,
            "val": "崇州市"
          },
          {
            "id": 4212,
            "val": "彭州市"
          },
          {
            "id": 4213,
            "val": "成华区"
          },
          {
            "id": 4214,
            "val": "新津县"
          },
          {
            "id": 4215,
            "val": "新都区"
          },
          {
            "id": 4216,
            "val": "武侯区"
          },
          {
            "id": 4217,
            "val": "温江区"
          },
          {
            "id": 4218,
            "val": "蒲江县"
          },
          {
            "id": 4219,
            "val": "邛崃市"
          },
          {
            "id": 4220,
            "val": "郫县"
          },
          {
            "id": 4221,
            "val": "都江堰市"
          },
          {
            "id": 4222,
            "val": "金堂县"
          },
          {
            "id": 4223,
            "val": "金牛区"
          },
          {
            "id": 4224,
            "val": "锦江区"
          },
          {
            "id": 4225,
            "val": "青白江区"
          },
          {
            "id": 4226,
            "val": "青羊区"
          },
          {
            "id": 4227,
            "val": "龙泉驿区"
          }
        ]
      },
      {
        "id": 386,
        "val": "自贡市",
        "data": [
          {
            "id": 4228,
            "val": "大安区"
          },
          {
            "id": 4229,
            "val": "富顺县"
          },
          {
            "id": 4230,
            "val": "沿滩区"
          },
          {
            "id": 4231,
            "val": "自流井区"
          },
          {
            "id": 4232,
            "val": "荣县"
          },
          {
            "id": 4233,
            "val": "贡井区"
          }
        ]
      },
      {
        "id": 387,
        "val": "攀枝花市",
        "data": [
          {
            "id": 4234,
            "val": "东区"
          },
          {
            "id": 4235,
            "val": "仁和区"
          },
          {
            "id": 4236,
            "val": "盐边县"
          },
          {
            "id": 4237,
            "val": "米易县"
          },
          {
            "id": 4238,
            "val": "西区"
          }
        ]
      },
      {
        "id": 388,
        "val": "泸州市",
        "data": [
          {
            "id": 4239,
            "val": "叙永县"
          },
          {
            "id": 4240,
            "val": "古蔺县"
          },
          {
            "id": 4241,
            "val": "合江县"
          },
          {
            "id": 4242,
            "val": "江阳区"
          },
          {
            "id": 4243,
            "val": "泸县"
          },
          {
            "id": 4244,
            "val": "纳溪区"
          },
          {
            "id": 4245,
            "val": "龙马潭区"
          }
        ]
      },
      {
        "id": 389,
        "val": "德阳市",
        "data": [
          {
            "id": 4246,
            "val": "中江县"
          },
          {
            "id": 4247,
            "val": "什邡市"
          },
          {
            "id": 4248,
            "val": "广汉市"
          },
          {
            "id": 4249,
            "val": "旌阳区"
          },
          {
            "id": 4250,
            "val": "绵竹市"
          },
          {
            "id": 4251,
            "val": "罗江县"
          }
        ]
      },
      {
        "id": 390,
        "val": "绵阳市",
        "data": [
          {
            "id": 4252,
            "val": "三台县"
          },
          {
            "id": 4253,
            "val": "北川羌族自治县"
          },
          {
            "id": 4254,
            "val": "安县"
          },
          {
            "id": 4255,
            "val": "平武县"
          },
          {
            "id": 4256,
            "val": "梓潼县"
          },
          {
            "id": 4257,
            "val": "江油市"
          },
          {
            "id": 4258,
            "val": "涪城区"
          },
          {
            "id": 4259,
            "val": "游仙区"
          },
          {
            "id": 4260,
            "val": "盐亭县"
          }
        ]
      },
      {
        "id": 391,
        "val": "广元市",
        "data": [
          {
            "id": 4261,
            "val": "元坝区"
          },
          {
            "id": 4262,
            "val": "利州区"
          },
          {
            "id": 4263,
            "val": "剑阁县"
          },
          {
            "id": 4264,
            "val": "旺苍县"
          },
          {
            "id": 4265,
            "val": "朝天区"
          },
          {
            "id": 4266,
            "val": "苍溪县"
          },
          {
            "id": 4267,
            "val": "青川县"
          }
        ]
      },
      {
        "id": 392,
        "val": "遂宁市",
        "data": [
          {
            "id": 4268,
            "val": "大英县"
          },
          {
            "id": 4269,
            "val": "安居区"
          },
          {
            "id": 4270,
            "val": "射洪县"
          },
          {
            "id": 4271,
            "val": "船山区"
          },
          {
            "id": 4272,
            "val": "蓬溪县"
          }
        ]
      },
      {
        "id": 393,
        "val": "内江市",
        "data": [
          {
            "id": 4273,
            "val": "东兴区"
          },
          {
            "id": 4274,
            "val": "威远县"
          },
          {
            "id": 4275,
            "val": "市中区"
          },
          {
            "id": 4276,
            "val": "资中县"
          },
          {
            "id": 4277,
            "val": "隆昌县"
          }
        ]
      },
      {
        "id": 394,
        "val": "乐山市",
        "data": [
          {
            "id": 4278,
            "val": "五通桥区"
          },
          {
            "id": 4279,
            "val": "井研县"
          },
          {
            "id": 4280,
            "val": "夹江县"
          },
          {
            "id": 4281,
            "val": "峨眉山市"
          },
          {
            "id": 4282,
            "val": "峨边彝族自治县"
          },
          {
            "id": 4283,
            "val": "市中区"
          },
          {
            "id": 4284,
            "val": "沐川县"
          },
          {
            "id": 4285,
            "val": "沙湾区"
          },
          {
            "id": 4286,
            "val": "犍为县"
          },
          {
            "id": 4287,
            "val": "金口河区"
          },
          {
            "id": 4288,
            "val": "马边彝族自治县"
          }
        ]
      },
      {
        "id": 395,
        "val": "南充市",
        "data": [
          {
            "id": 4289,
            "val": "仪陇县"
          },
          {
            "id": 4290,
            "val": "南充市嘉陵区"
          },
          {
            "id": 4291,
            "val": "南部县"
          },
          {
            "id": 4292,
            "val": "嘉陵区"
          },
          {
            "id": 4293,
            "val": "营山县"
          },
          {
            "id": 4294,
            "val": "蓬安县"
          },
          {
            "id": 4295,
            "val": "西充县"
          },
          {
            "id": 4296,
            "val": "阆中市"
          },
          {
            "id": 4297,
            "val": "顺庆区"
          },
          {
            "id": 4298,
            "val": "高坪区"
          }
        ]
      },
      {
        "id": 396,
        "val": "眉山市",
        "data": [
          {
            "id": 4299,
            "val": "东坡区"
          },
          {
            "id": 4300,
            "val": "丹棱县"
          },
          {
            "id": 4301,
            "val": "仁寿县"
          },
          {
            "id": 4302,
            "val": "彭山县"
          },
          {
            "id": 4303,
            "val": "洪雅县"
          },
          {
            "id": 4304,
            "val": "青神县"
          }
        ]
      },
      {
        "id": 397,
        "val": "宜宾市",
        "data": [
          {
            "id": 4305,
            "val": "兴文县"
          },
          {
            "id": 4306,
            "val": "南溪县"
          },
          {
            "id": 4307,
            "val": "宜宾县"
          },
          {
            "id": 4308,
            "val": "屏山县"
          },
          {
            "id": 4309,
            "val": "江安县"
          },
          {
            "id": 4310,
            "val": "珙县"
          },
          {
            "id": 4311,
            "val": "筠连县"
          },
          {
            "id": 4312,
            "val": "翠屏区"
          },
          {
            "id": 4313,
            "val": "长宁县"
          },
          {
            "id": 4314,
            "val": "高县"
          }
        ]
      },
      {
        "id": 398,
        "val": "广安市",
        "data": [
          {
            "id": 4315,
            "val": "华蓥市"
          },
          {
            "id": 4316,
            "val": "岳池县"
          },
          {
            "id": 4317,
            "val": "广安区"
          },
          {
            "id": 4318,
            "val": "武胜县"
          },
          {
            "id": 4319,
            "val": "邻水县"
          }
        ]
      },
      {
        "id": 399,
        "val": "达州市",
        "data": [
          {
            "id": 4320,
            "val": "万源市"
          },
          {
            "id": 4321,
            "val": "大竹县"
          },
          {
            "id": 4322,
            "val": "宣汉县"
          },
          {
            "id": 4323,
            "val": "开江县"
          },
          {
            "id": 4324,
            "val": "渠县"
          },
          {
            "id": 4325,
            "val": "达县"
          },
          {
            "id": 4326,
            "val": "通川区"
          }
        ]
      },
      {
        "id": 400,
        "val": "雅安市",
        "data": [
          {
            "id": 4327,
            "val": "名山县"
          },
          {
            "id": 4328,
            "val": "天全县"
          },
          {
            "id": 4329,
            "val": "宝兴县"
          },
          {
            "id": 4330,
            "val": "汉源县"
          },
          {
            "id": 4331,
            "val": "石棉县"
          },
          {
            "id": 4332,
            "val": "芦山县"
          },
          {
            "id": 4333,
            "val": "荥经县"
          },
          {
            "id": 4334,
            "val": "雨城区"
          }
        ]
      },
      {
        "id": 401,
        "val": "巴中市",
        "data": [
          {
            "id": 4335,
            "val": "南江县"
          },
          {
            "id": 4336,
            "val": "巴州区"
          },
          {
            "id": 4337,
            "val": "平昌县"
          },
          {
            "id": 4338,
            "val": "通江县"
          }
        ]
      },
      {
        "id": 402,
        "val": "资阳市",
        "data": [
          {
            "id": 4339,
            "val": "乐至县"
          },
          {
            "id": 4340,
            "val": "安岳县"
          },
          {
            "id": 4341,
            "val": "简阳市"
          },
          {
            "id": 4342,
            "val": "雁江区"
          }
        ]
      },
      {
        "id": 403,
        "val": "阿坝藏族羌族自治州",
        "data": [
          {
            "id": 4343,
            "val": "九寨沟县"
          },
          {
            "id": 4344,
            "val": "壤塘县"
          },
          {
            "id": 4345,
            "val": "小金县"
          },
          {
            "id": 4346,
            "val": "松潘县"
          },
          {
            "id": 4347,
            "val": "汶川县"
          },
          {
            "id": 4348,
            "val": "理县"
          },
          {
            "id": 4349,
            "val": "红原县"
          },
          {
            "id": 4350,
            "val": "若尔盖县"
          },
          {
            "id": 4351,
            "val": "茂县"
          },
          {
            "id": 4352,
            "val": "金川县"
          },
          {
            "id": 4353,
            "val": "阿坝县"
          },
          {
            "id": 4354,
            "val": "马尔康县"
          },
          {
            "id": 4355,
            "val": "黑水县"
          }
        ]
      },
      {
        "id": 404,
        "val": "甘孜藏族自治州",
        "data": [
          {
            "id": 4356,
            "val": "丹巴县"
          },
          {
            "id": 4357,
            "val": "乡城县"
          },
          {
            "id": 4358,
            "val": "巴塘县"
          },
          {
            "id": 4359,
            "val": "康定县"
          },
          {
            "id": 4360,
            "val": "得荣县"
          },
          {
            "id": 4361,
            "val": "德格县"
          },
          {
            "id": 4362,
            "val": "新龙县"
          },
          {
            "id": 4363,
            "val": "泸定县"
          },
          {
            "id": 4364,
            "val": "炉霍县"
          },
          {
            "id": 4365,
            "val": "理塘县"
          },
          {
            "id": 4366,
            "val": "甘孜县"
          },
          {
            "id": 4367,
            "val": "白玉县"
          },
          {
            "id": 4368,
            "val": "石渠县"
          },
          {
            "id": 4369,
            "val": "稻城县"
          },
          {
            "id": 4370,
            "val": "色达县"
          },
          {
            "id": 4371,
            "val": "道孚县"
          },
          {
            "id": 4372,
            "val": "雅江县"
          }
        ]
      },
      {
        "id": 405,
        "val": "凉山彝族自治州",
        "data": [
          {
            "id": 4373,
            "val": "会东县"
          },
          {
            "id": 4374,
            "val": "会理县"
          },
          {
            "id": 4375,
            "val": "冕宁县"
          },
          {
            "id": 4376,
            "val": "喜德县"
          },
          {
            "id": 4377,
            "val": "宁南县"
          },
          {
            "id": 4378,
            "val": "布拖县"
          },
          {
            "id": 4379,
            "val": "德昌县"
          },
          {
            "id": 4380,
            "val": "昭觉县"
          },
          {
            "id": 4381,
            "val": "普格县"
          },
          {
            "id": 4382,
            "val": "木里藏族自治县"
          },
          {
            "id": 4383,
            "val": "甘洛县"
          },
          {
            "id": 4384,
            "val": "盐源县"
          },
          {
            "id": 4385,
            "val": "美姑县"
          },
          {
            "id": 4386,
            "val": "西昌"
          },
          {
            "id": 4387,
            "val": "越西县"
          },
          {
            "id": 4388,
            "val": "金阳县"
          },
          {
            "id": 4389,
            "val": "雷波县"
          }
        ]
      }
    ]
  },
  {
    "id": 24,
    "val": "贵州",
    "data": [
      {
        "id": 406,
        "val": "贵阳市",
        "data": [
          {
            "id": 4390,
            "val": "乌当区"
          },
          {
            "id": 4391,
            "val": "云岩区"
          },
          {
            "id": 4392,
            "val": "修文县"
          },
          {
            "id": 4393,
            "val": "南明区"
          },
          {
            "id": 4394,
            "val": "小河区"
          },
          {
            "id": 4395,
            "val": "开阳县"
          },
          {
            "id": 4396,
            "val": "息烽县"
          },
          {
            "id": 4397,
            "val": "清镇市"
          },
          {
            "id": 4398,
            "val": "白云区"
          },
          {
            "id": 4399,
            "val": "花溪区"
          }
        ]
      },
      {
        "id": 407,
        "val": "六盘水市",
        "data": [
          {
            "id": 4400,
            "val": "六枝特区"
          },
          {
            "id": 4401,
            "val": "水城县"
          },
          {
            "id": 4402,
            "val": "盘县"
          },
          {
            "id": 4403,
            "val": "钟山区"
          }
        ]
      },
      {
        "id": 408,
        "val": "遵义市",
        "data": [
          {
            "id": 4404,
            "val": "习水县"
          },
          {
            "id": 4405,
            "val": "仁怀市"
          },
          {
            "id": 4406,
            "val": "余庆县"
          },
          {
            "id": 4407,
            "val": "凤冈县"
          },
          {
            "id": 4408,
            "val": "务川仡佬族苗族自治县"
          },
          {
            "id": 4409,
            "val": "桐梓县"
          },
          {
            "id": 4410,
            "val": "正安县"
          },
          {
            "id": 4411,
            "val": "汇川区"
          },
          {
            "id": 4412,
            "val": "湄潭县"
          },
          {
            "id": 4413,
            "val": "红花岗区"
          },
          {
            "id": 4414,
            "val": "绥阳县"
          },
          {
            "id": 4415,
            "val": "赤水市"
          },
          {
            "id": 4416,
            "val": "道真仡佬族苗族自治县"
          },
          {
            "id": 4417,
            "val": "遵义县"
          }
        ]
      },
      {
        "id": 409,
        "val": "安顺市",
        "data": [
          {
            "id": 4418,
            "val": "关岭布依族苗族自治县"
          },
          {
            "id": 4419,
            "val": "平坝县"
          },
          {
            "id": 4420,
            "val": "普定县"
          },
          {
            "id": 4421,
            "val": "紫云苗族布依族自治县"
          },
          {
            "id": 4422,
            "val": "西秀区"
          },
          {
            "id": 4423,
            "val": "镇宁布依族苗族自治县"
          }
        ]
      },
      {
        "id": 410,
        "val": "铜仁地区",
        "data": [
          {
            "id": 4424,
            "val": "万山特区"
          },
          {
            "id": 4425,
            "val": "印江土家族苗族自治县"
          },
          {
            "id": 4426,
            "val": "德江县"
          },
          {
            "id": 4427,
            "val": "思南县"
          },
          {
            "id": 4428,
            "val": "松桃苗族自治县"
          },
          {
            "id": 4429,
            "val": "江口县"
          },
          {
            "id": 4430,
            "val": "沿河土家族自治县"
          },
          {
            "id": 4431,
            "val": "玉屏侗族自治县"
          },
          {
            "id": 4432,
            "val": "石阡县"
          },
          {
            "id": 4433,
            "val": "铜仁市"
          }
        ]
      },
      {
        "id": 411,
        "val": "黔西南布依族苗族自治州",
        "data": [
          {
            "id": 4434,
            "val": "兴义市"
          },
          {
            "id": 4435,
            "val": "兴仁县"
          },
          {
            "id": 4436,
            "val": "册亨县"
          },
          {
            "id": 4437,
            "val": "安龙县"
          },
          {
            "id": 4438,
            "val": "普安县"
          },
          {
            "id": 4439,
            "val": "晴隆县"
          },
          {
            "id": 4440,
            "val": "望谟县"
          },
          {
            "id": 4441,
            "val": "贞丰县"
          }
        ]
      },
      {
        "id": 412,
        "val": "毕节地区",
        "data": [
          {
            "id": 4442,
            "val": "大方县"
          },
          {
            "id": 4443,
            "val": "威宁彝族回族苗族自治县"
          },
          {
            "id": 4444,
            "val": "毕节市"
          },
          {
            "id": 4445,
            "val": "纳雍县"
          },
          {
            "id": 4446,
            "val": "织金县"
          },
          {
            "id": 4447,
            "val": "赫章县"
          },
          {
            "id": 4448,
            "val": "金沙县"
          },
          {
            "id": 4449,
            "val": "黔西县"
          }
        ]
      },
      {
        "id": 413,
        "val": "黔东南苗族侗族自治州",
        "data": [
          {
            "id": 4450,
            "val": "三穗县"
          },
          {
            "id": 4451,
            "val": "丹寨县"
          },
          {
            "id": 4452,
            "val": "从江县"
          },
          {
            "id": 4453,
            "val": "凯里市"
          },
          {
            "id": 4454,
            "val": "剑河县"
          },
          {
            "id": 4455,
            "val": "台江县"
          },
          {
            "id": 4456,
            "val": "天柱县"
          },
          {
            "id": 4457,
            "val": "岑巩县"
          },
          {
            "id": 4458,
            "val": "施秉县"
          },
          {
            "id": 4459,
            "val": "榕江县"
          },
          {
            "id": 4460,
            "val": "锦屏县"
          },
          {
            "id": 4461,
            "val": "镇远县"
          },
          {
            "id": 4462,
            "val": "雷山县"
          },
          {
            "id": 4463,
            "val": "麻江县"
          },
          {
            "id": 4464,
            "val": "黄平县"
          },
          {
            "id": 4465,
            "val": "黎平县"
          }
        ]
      },
      {
        "id": 414,
        "val": "黔南布依族苗族自治州",
        "data": [
          {
            "id": 4466,
            "val": "三都水族自治县"
          },
          {
            "id": 4467,
            "val": "平塘县"
          },
          {
            "id": 4468,
            "val": "惠水县"
          },
          {
            "id": 4469,
            "val": "独山县"
          },
          {
            "id": 4470,
            "val": "瓮安县"
          },
          {
            "id": 4471,
            "val": "福泉市"
          },
          {
            "id": 4472,
            "val": "罗甸县"
          },
          {
            "id": 4473,
            "val": "荔波县"
          },
          {
            "id": 4474,
            "val": "贵定县"
          },
          {
            "id": 4475,
            "val": "都匀市"
          },
          {
            "id": 4476,
            "val": "长顺县"
          },
          {
            "id": 4477,
            "val": "龙里县"
          }
        ]
      }
    ]
  },
  {
    "id": 25,
    "val": "云南",
    "data": [
      {
        "id": 415,
        "val": "昆明市",
        "data": [
          {
            "id": 4478,
            "val": "东川区"
          },
          {
            "id": 4479,
            "val": "五华区"
          },
          {
            "id": 4480,
            "val": "呈贡县"
          },
          {
            "id": 4481,
            "val": "安宁市"
          },
          {
            "id": 4482,
            "val": "官渡区"
          },
          {
            "id": 4483,
            "val": "宜良县"
          },
          {
            "id": 4484,
            "val": "富民县"
          },
          {
            "id": 4485,
            "val": "寻甸回族彝族自治县"
          },
          {
            "id": 4486,
            "val": "嵩明县"
          },
          {
            "id": 4487,
            "val": "晋宁县"
          },
          {
            "id": 4488,
            "val": "盘龙区"
          },
          {
            "id": 4489,
            "val": "石林彝族自治县"
          },
          {
            "id": 4490,
            "val": "禄劝彝族苗族自治县"
          },
          {
            "id": 4491,
            "val": "西山区"
          }
        ]
      },
      {
        "id": 416,
        "val": "曲靖市",
        "data": [
          {
            "id": 4492,
            "val": "会泽县"
          },
          {
            "id": 4493,
            "val": "宣威市"
          },
          {
            "id": 4494,
            "val": "富源县"
          },
          {
            "id": 4495,
            "val": "师宗县"
          },
          {
            "id": 4496,
            "val": "沾益县"
          },
          {
            "id": 4497,
            "val": "罗平县"
          },
          {
            "id": 4498,
            "val": "陆良县"
          },
          {
            "id": 4499,
            "val": "马龙县"
          },
          {
            "id": 4500,
            "val": "麒麟区"
          }
        ]
      },
      {
        "id": 417,
        "val": "玉溪市",
        "data": [
          {
            "id": 4501,
            "val": "元江哈尼族彝族傣族自治县"
          },
          {
            "id": 4502,
            "val": "华宁县"
          },
          {
            "id": 4503,
            "val": "峨山彝族自治县"
          },
          {
            "id": 4504,
            "val": "新平彝族傣族自治县"
          },
          {
            "id": 4505,
            "val": "易门县"
          },
          {
            "id": 4506,
            "val": "江川县"
          },
          {
            "id": 4507,
            "val": "澄江县"
          },
          {
            "id": 4508,
            "val": "红塔区"
          },
          {
            "id": 4509,
            "val": "通海县"
          }
        ]
      },
      {
        "id": 418,
        "val": "保山市",
        "data": [
          {
            "id": 4510,
            "val": "施甸县"
          },
          {
            "id": 4511,
            "val": "昌宁县"
          },
          {
            "id": 4512,
            "val": "腾冲县"
          },
          {
            "id": 4513,
            "val": "隆阳区"
          },
          {
            "id": 4514,
            "val": "龙陵县"
          }
        ]
      },
      {
        "id": 419,
        "val": "昭通市",
        "data": [
          {
            "id": 4515,
            "val": "大关县"
          },
          {
            "id": 4516,
            "val": "威信县"
          },
          {
            "id": 4517,
            "val": "巧家县"
          },
          {
            "id": 4518,
            "val": "彝良县"
          },
          {
            "id": 4519,
            "val": "昭阳区"
          },
          {
            "id": 4520,
            "val": "水富县"
          },
          {
            "id": 4521,
            "val": "永善县"
          },
          {
            "id": 4522,
            "val": "盐津县"
          },
          {
            "id": 4523,
            "val": "绥江县"
          },
          {
            "id": 4524,
            "val": "镇雄县"
          },
          {
            "id": 4525,
            "val": "鲁甸县"
          }
        ]
      },
      {
        "id": 420,
        "val": "丽江市",
        "data": [
          {
            "id": 4526,
            "val": "华坪县"
          },
          {
            "id": 4527,
            "val": "古城区"
          },
          {
            "id": 4528,
            "val": "宁蒗彝族自治县"
          },
          {
            "id": 4529,
            "val": "永胜县"
          },
          {
            "id": 4530,
            "val": "玉龙纳西族自治县"
          }
        ]
      },
      {
        "id": 421,
        "val": "思茅市"
      },
      {
        "id": 422,
        "val": "临沧市",
        "data": [
          {
            "id": 4531,
            "val": "临翔区"
          },
          {
            "id": 4532,
            "val": "云县"
          },
          {
            "id": 4533,
            "val": "凤庆县"
          },
          {
            "id": 4534,
            "val": "双江拉祜族佤族布朗族傣族自治县"
          },
          {
            "id": 4535,
            "val": "永德县"
          },
          {
            "id": 4536,
            "val": "沧源佤族自治县"
          },
          {
            "id": 4537,
            "val": "耿马傣族佤族自治县"
          },
          {
            "id": 4538,
            "val": "镇康县"
          }
        ]
      },
      {
        "id": 423,
        "val": "楚雄彝族自治州",
        "data": [
          {
            "id": 4539,
            "val": "元谋县"
          },
          {
            "id": 4540,
            "val": "南华县"
          },
          {
            "id": 4541,
            "val": "双柏县"
          },
          {
            "id": 4542,
            "val": "大姚县"
          },
          {
            "id": 4543,
            "val": "姚安县"
          },
          {
            "id": 4544,
            "val": "楚雄市"
          },
          {
            "id": 4545,
            "val": "武定县"
          },
          {
            "id": 4546,
            "val": "永仁县"
          },
          {
            "id": 4547,
            "val": "牟定县"
          },
          {
            "id": 4548,
            "val": "禄丰县"
          }
        ]
      },
      {
        "id": 424,
        "val": "红河哈尼族彝族自治州",
        "data": [
          {
            "id": 4549,
            "val": "个旧市"
          },
          {
            "id": 4550,
            "val": "元阳县"
          },
          {
            "id": 4551,
            "val": "屏边苗族自治县"
          },
          {
            "id": 4552,
            "val": "建水县"
          },
          {
            "id": 4553,
            "val": "开远市"
          },
          {
            "id": 4554,
            "val": "弥勒县"
          },
          {
            "id": 4555,
            "val": "河口瑶族自治县"
          },
          {
            "id": 4556,
            "val": "泸西县"
          },
          {
            "id": 4557,
            "val": "石屏县"
          },
          {
            "id": 4558,
            "val": "红河县"
          },
          {
            "id": 4559,
            "val": "绿春县"
          },
          {
            "id": 4560,
            "val": "蒙自县"
          },
          {
            "id": 4561,
            "val": "金平苗族瑶族傣族自治县"
          }
        ]
      },
      {
        "id": 425,
        "val": "文山壮族苗族自治州",
        "data": [
          {
            "id": 4562,
            "val": "丘北县"
          },
          {
            "id": 4563,
            "val": "富宁县"
          },
          {
            "id": 4564,
            "val": "广南县"
          },
          {
            "id": 4565,
            "val": "文山县"
          },
          {
            "id": 4566,
            "val": "砚山县"
          },
          {
            "id": 4567,
            "val": "西畴县"
          },
          {
            "id": 4568,
            "val": "马关县"
          },
          {
            "id": 4569,
            "val": "麻栗坡县"
          }
        ]
      },
      {
        "id": 426,
        "val": "西双版纳傣族自治州",
        "data": [
          {
            "id": 4570,
            "val": "勐海县"
          },
          {
            "id": 4571,
            "val": "勐腊县"
          },
          {
            "id": 4572,
            "val": "景洪市"
          }
        ]
      },
      {
        "id": 427,
        "val": "大理白族自治州",
        "data": [
          {
            "id": 4573,
            "val": "云龙县"
          },
          {
            "id": 4574,
            "val": "剑川县"
          },
          {
            "id": 4575,
            "val": "南涧彝族自治县"
          },
          {
            "id": 4576,
            "val": "大理市"
          },
          {
            "id": 4577,
            "val": "宾川县"
          },
          {
            "id": 4578,
            "val": "巍山彝族回族自治县"
          },
          {
            "id": 4579,
            "val": "弥渡县"
          },
          {
            "id": 4580,
            "val": "永平县"
          },
          {
            "id": 4581,
            "val": "洱源县"
          },
          {
            "id": 4582,
            "val": "漾濞彝族自治县"
          },
          {
            "id": 4583,
            "val": "祥云县"
          },
          {
            "id": 4584,
            "val": "鹤庆县"
          }
        ]
      },
      {
        "id": 428,
        "val": "德宏傣族景颇族自治州",
        "data": [
          {
            "id": 4585,
            "val": "梁河县"
          },
          {
            "id": 4586,
            "val": "潞西市"
          },
          {
            "id": 4587,
            "val": "瑞丽市"
          },
          {
            "id": 4588,
            "val": "盈江县"
          },
          {
            "id": 4589,
            "val": "陇川县"
          }
        ]
      },
      {
        "id": 429,
        "val": "怒江傈僳族自治州"
      },
      {
        "id": 430,
        "val": "迪庆藏族自治州",
        "data": [
          {
            "id": 4590,
            "val": "德钦县"
          },
          {
            "id": 4591,
            "val": "维西傈僳族自治县"
          },
          {
            "id": 4592,
            "val": "香格里拉县"
          }
        ]
      }
    ]
  },
  {
    "id": 26,
    "val": "西藏",
    "data": [
      {
        "id": 431,
        "val": "拉萨市",
        "data": [
          {
            "id": 4593,
            "val": "城关区"
          },
          {
            "id": 4594,
            "val": "堆龙德庆县"
          },
          {
            "id": 4595,
            "val": "墨竹工卡县"
          },
          {
            "id": 4596,
            "val": "尼木县"
          },
          {
            "id": 4597,
            "val": "当雄县"
          },
          {
            "id": 4598,
            "val": "曲水县"
          },
          {
            "id": 4599,
            "val": "林周县"
          },
          {
            "id": 4600,
            "val": "达孜县"
          }
        ]
      },
      {
        "id": 432,
        "val": "昌都地区",
        "data": [
          {
            "id": 4601,
            "val": "丁青县"
          },
          {
            "id": 4602,
            "val": "八宿县"
          },
          {
            "id": 4603,
            "val": "察雅县"
          },
          {
            "id": 4604,
            "val": "左贡县"
          },
          {
            "id": 4605,
            "val": "昌都县"
          },
          {
            "id": 4606,
            "val": "江达县"
          },
          {
            "id": 4607,
            "val": "洛隆县"
          },
          {
            "id": 4608,
            "val": "类乌齐县"
          },
          {
            "id": 4609,
            "val": "芒康县"
          },
          {
            "id": 4610,
            "val": "贡觉县"
          },
          {
            "id": 4611,
            "val": "边坝县"
          }
        ]
      },
      {
        "id": 433,
        "val": "山南地区",
        "data": [
          {
            "id": 4612,
            "val": "乃东县"
          },
          {
            "id": 4613,
            "val": "加查县"
          },
          {
            "id": 4614,
            "val": "扎囊县"
          },
          {
            "id": 4615,
            "val": "措美县"
          },
          {
            "id": 4616,
            "val": "曲松县"
          },
          {
            "id": 4617,
            "val": "桑日县"
          },
          {
            "id": 4618,
            "val": "洛扎县"
          },
          {
            "id": 4619,
            "val": "浪卡子县"
          },
          {
            "id": 4620,
            "val": "琼结县"
          },
          {
            "id": 4621,
            "val": "贡嘎县"
          },
          {
            "id": 4622,
            "val": "错那县"
          },
          {
            "id": 4623,
            "val": "隆子县"
          }
        ]
      },
      {
        "id": 434,
        "val": "日喀则地区",
        "data": [
          {
            "id": 4624,
            "val": "亚东县"
          },
          {
            "id": 4625,
            "val": "仁布县"
          },
          {
            "id": 4626,
            "val": "仲巴县"
          },
          {
            "id": 4627,
            "val": "南木林县"
          },
          {
            "id": 4628,
            "val": "吉隆县"
          },
          {
            "id": 4629,
            "val": "定日县"
          },
          {
            "id": 4630,
            "val": "定结县"
          },
          {
            "id": 4631,
            "val": "岗巴县"
          },
          {
            "id": 4632,
            "val": "康马县"
          },
          {
            "id": 4633,
            "val": "拉孜县"
          },
          {
            "id": 4634,
            "val": "日喀则市"
          },
          {
            "id": 4635,
            "val": "昂仁县"
          },
          {
            "id": 4636,
            "val": "江孜县"
          },
          {
            "id": 4637,
            "val": "白朗县"
          },
          {
            "id": 4638,
            "val": "聂拉木县"
          },
          {
            "id": 4639,
            "val": "萨嘎县"
          },
          {
            "id": 4640,
            "val": "萨迦县"
          },
          {
            "id": 4641,
            "val": "谢通门县"
          }
        ]
      },
      {
        "id": 435,
        "val": "那曲地区",
        "data": [
          {
            "id": 4642,
            "val": "嘉黎县"
          },
          {
            "id": 4643,
            "val": "安多县"
          },
          {
            "id": 4644,
            "val": "尼玛县"
          },
          {
            "id": 4645,
            "val": "巴青县"
          },
          {
            "id": 4646,
            "val": "比如县"
          },
          {
            "id": 4647,
            "val": "班戈县"
          },
          {
            "id": 4648,
            "val": "申扎县"
          },
          {
            "id": 4649,
            "val": "索县"
          },
          {
            "id": 4650,
            "val": "聂荣县"
          },
          {
            "id": 4651,
            "val": "那曲县"
          }
        ]
      },
      {
        "id": 436,
        "val": "阿里地区",
        "data": [
          {
            "id": 4652,
            "val": "噶尔县"
          },
          {
            "id": 4653,
            "val": "措勤县"
          },
          {
            "id": 4654,
            "val": "改则县"
          },
          {
            "id": 4655,
            "val": "日土县"
          },
          {
            "id": 4656,
            "val": "普兰县"
          },
          {
            "id": 4657,
            "val": "札达县"
          },
          {
            "id": 4658,
            "val": "革吉县"
          }
        ]
      },
      {
        "id": 437,
        "val": "林芝地区",
        "data": [
          {
            "id": 4659,
            "val": "墨脱县"
          },
          {
            "id": 4660,
            "val": "察隅县"
          },
          {
            "id": 4661,
            "val": "工布江达县"
          },
          {
            "id": 4662,
            "val": "朗县"
          },
          {
            "id": 4663,
            "val": "林芝县"
          },
          {
            "id": 4664,
            "val": "波密县"
          },
          {
            "id": 4665,
            "val": "米林县"
          }
        ]
      }
    ]
  },
  {
    "id": 27,
    "val": "陕西",
    "data": [
      {
        "id": 438,
        "val": "西安市",
        "data": [
          {
            "id": 4666,
            "val": "临潼区"
          },
          {
            "id": 4667,
            "val": "周至县"
          },
          {
            "id": 4668,
            "val": "户县"
          },
          {
            "id": 4669,
            "val": "新城区"
          },
          {
            "id": 4670,
            "val": "未央区"
          },
          {
            "id": 4671,
            "val": "灞桥区"
          },
          {
            "id": 4672,
            "val": "碑林区"
          },
          {
            "id": 4673,
            "val": "莲湖区"
          },
          {
            "id": 4674,
            "val": "蓝田县"
          },
          {
            "id": 4675,
            "val": "长安区"
          },
          {
            "id": 4676,
            "val": "阎良区"
          },
          {
            "id": 4677,
            "val": "雁塔区"
          },
          {
            "id": 4678,
            "val": "高陵县"
          }
        ]
      },
      {
        "id": 439,
        "val": "铜川市",
        "data": [
          {
            "id": 4679,
            "val": "印台区"
          },
          {
            "id": 4680,
            "val": "宜君县"
          },
          {
            "id": 4681,
            "val": "王益区"
          },
          {
            "id": 4682,
            "val": "耀州区"
          }
        ]
      },
      {
        "id": 440,
        "val": "宝鸡市",
        "data": [
          {
            "id": 4683,
            "val": "凤县"
          },
          {
            "id": 4684,
            "val": "凤翔县"
          },
          {
            "id": 4685,
            "val": "千阳县"
          },
          {
            "id": 4686,
            "val": "太白县"
          },
          {
            "id": 4687,
            "val": "岐山县"
          },
          {
            "id": 4688,
            "val": "扶风县"
          },
          {
            "id": 4689,
            "val": "渭滨区"
          },
          {
            "id": 4690,
            "val": "眉县"
          },
          {
            "id": 4691,
            "val": "金台区"
          },
          {
            "id": 4692,
            "val": "陇县"
          },
          {
            "id": 4693,
            "val": "陈仓区"
          },
          {
            "id": 4694,
            "val": "麟游县"
          }
        ]
      },
      {
        "id": 441,
        "val": "咸阳市",
        "data": [
          {
            "id": 4695,
            "val": "三原县"
          },
          {
            "id": 4696,
            "val": "干县"
          },
          {
            "id": 4697,
            "val": "兴平市"
          },
          {
            "id": 4698,
            "val": "彬县"
          },
          {
            "id": 4699,
            "val": "旬邑县"
          },
          {
            "id": 4700,
            "val": "杨陵区"
          },
          {
            "id": 4701,
            "val": "武功县"
          },
          {
            "id": 4702,
            "val": "永寿县"
          },
          {
            "id": 4703,
            "val": "泾阳县"
          },
          {
            "id": 4704,
            "val": "淳化县"
          },
          {
            "id": 4705,
            "val": "渭城区"
          },
          {
            "id": 4706,
            "val": "礼泉县"
          },
          {
            "id": 4707,
            "val": "秦都区"
          },
          {
            "id": 4708,
            "val": "长武县"
          }
        ]
      },
      {
        "id": 442,
        "val": "渭南市",
        "data": [
          {
            "id": 4709,
            "val": "临渭区"
          },
          {
            "id": 4710,
            "val": "华县"
          },
          {
            "id": 4711,
            "val": "华阴市"
          },
          {
            "id": 4712,
            "val": "合阳县"
          },
          {
            "id": 4713,
            "val": "大荔县"
          },
          {
            "id": 4714,
            "val": "富平县"
          },
          {
            "id": 4715,
            "val": "潼关县"
          },
          {
            "id": 4716,
            "val": "澄城县"
          },
          {
            "id": 4717,
            "val": "白水县"
          },
          {
            "id": 4718,
            "val": "蒲城县"
          },
          {
            "id": 4719,
            "val": "韩城市"
          }
        ]
      },
      {
        "id": 443,
        "val": "延安市",
        "data": [
          {
            "id": 4720,
            "val": "吴起县"
          },
          {
            "id": 4721,
            "val": "子长县"
          },
          {
            "id": 4722,
            "val": "安塞县"
          },
          {
            "id": 4723,
            "val": "宜川县"
          },
          {
            "id": 4724,
            "val": "宝塔区"
          },
          {
            "id": 4725,
            "val": "富县"
          },
          {
            "id": 4726,
            "val": "延川县"
          },
          {
            "id": 4727,
            "val": "延长县"
          },
          {
            "id": 4728,
            "val": "志丹县"
          },
          {
            "id": 4729,
            "val": "洛川县"
          },
          {
            "id": 4730,
            "val": "甘泉县"
          },
          {
            "id": 4731,
            "val": "黄陵县"
          },
          {
            "id": 4732,
            "val": "黄龙县"
          }
        ]
      },
      {
        "id": 444,
        "val": "汉中市",
        "data": [
          {
            "id": 4733,
            "val": "佛坪县"
          },
          {
            "id": 4734,
            "val": "勉县"
          },
          {
            "id": 4735,
            "val": "南郑县"
          },
          {
            "id": 4736,
            "val": "城固县"
          },
          {
            "id": 4737,
            "val": "宁强县"
          },
          {
            "id": 4738,
            "val": "汉台区"
          },
          {
            "id": 4739,
            "val": "洋县"
          },
          {
            "id": 4740,
            "val": "留坝县"
          },
          {
            "id": 4741,
            "val": "略阳县"
          },
          {
            "id": 4742,
            "val": "西乡县"
          },
          {
            "id": 4743,
            "val": "镇巴县"
          }
        ]
      },
      {
        "id": 445,
        "val": "榆林市",
        "data": [
          {
            "id": 4744,
            "val": "佳县"
          },
          {
            "id": 4745,
            "val": "吴堡县"
          },
          {
            "id": 4746,
            "val": "子洲县"
          },
          {
            "id": 4747,
            "val": "定边县"
          },
          {
            "id": 4748,
            "val": "府谷县"
          },
          {
            "id": 4749,
            "val": "榆林市榆阳区"
          },
          {
            "id": 4750,
            "val": "横山县"
          },
          {
            "id": 4751,
            "val": "清涧县"
          },
          {
            "id": 4752,
            "val": "神木县"
          },
          {
            "id": 4753,
            "val": "米脂县"
          },
          {
            "id": 4754,
            "val": "绥德县"
          },
          {
            "id": 4755,
            "val": "靖边县"
          }
        ]
      },
      {
        "id": 446,
        "val": "安康市",
        "data": [
          {
            "id": 4756,
            "val": "宁陕县"
          },
          {
            "id": 4757,
            "val": "岚皋县"
          },
          {
            "id": 4758,
            "val": "平利县"
          },
          {
            "id": 4759,
            "val": "旬阳县"
          },
          {
            "id": 4760,
            "val": "汉滨区"
          },
          {
            "id": 4761,
            "val": "汉阴县"
          },
          {
            "id": 4762,
            "val": "白河县"
          },
          {
            "id": 4763,
            "val": "石泉县"
          },
          {
            "id": 4764,
            "val": "紫阳县"
          },
          {
            "id": 4765,
            "val": "镇坪县"
          }
        ]
      },
      {
        "id": 447,
        "val": "商洛市",
        "data": [
          {
            "id": 4766,
            "val": "丹凤县"
          },
          {
            "id": 4767,
            "val": "商南县"
          },
          {
            "id": 4768,
            "val": "商州区"
          },
          {
            "id": 4769,
            "val": "山阳县"
          },
          {
            "id": 4770,
            "val": "柞水县"
          },
          {
            "id": 4771,
            "val": "洛南县"
          },
          {
            "id": 4772,
            "val": "镇安县"
          }
        ]
      }
    ]
  },
  {
    "id": 28,
    "val": "甘肃",
    "data": [
      {
        "id": 448,
        "val": "兰州市",
        "data": [
          {
            "id": 4773,
            "val": "七里河区"
          },
          {
            "id": 4774,
            "val": "城关区"
          },
          {
            "id": 4775,
            "val": "安宁区"
          },
          {
            "id": 4776,
            "val": "榆中县"
          },
          {
            "id": 4777,
            "val": "永登县"
          },
          {
            "id": 4778,
            "val": "皋兰县"
          },
          {
            "id": 4779,
            "val": "红古区"
          },
          {
            "id": 4780,
            "val": "西固区"
          }
        ]
      },
      {
        "id": 449,
        "val": "嘉峪关市",
        "data": [
          {
            "id": 4781,
            "val": "嘉峪关市"
          }
        ]
      },
      {
        "id": 450,
        "val": "金昌市",
        "data": [
          {
            "id": 4782,
            "val": "永昌县"
          },
          {
            "id": 4783,
            "val": "金川区"
          }
        ]
      },
      {
        "id": 451,
        "val": "白银市",
        "data": [
          {
            "id": 4784,
            "val": "会宁县"
          },
          {
            "id": 4785,
            "val": "平川区"
          },
          {
            "id": 4786,
            "val": "景泰县"
          },
          {
            "id": 4787,
            "val": "白银区"
          },
          {
            "id": 4788,
            "val": "靖远县"
          }
        ]
      },
      {
        "id": 452,
        "val": "天水市",
        "data": [
          {
            "id": 4789,
            "val": "张家川回族自治县"
          },
          {
            "id": 4790,
            "val": "武山县"
          },
          {
            "id": 4791,
            "val": "清水县"
          },
          {
            "id": 4792,
            "val": "甘谷县"
          },
          {
            "id": 4793,
            "val": "秦安县"
          },
          {
            "id": 4794,
            "val": "秦州区"
          },
          {
            "id": 4795,
            "val": "麦积区"
          }
        ]
      },
      {
        "id": 453,
        "val": "武威市",
        "data": [
          {
            "id": 4796,
            "val": "凉州区"
          },
          {
            "id": 4797,
            "val": "古浪县"
          },
          {
            "id": 4798,
            "val": "天祝藏族自治县"
          },
          {
            "id": 4799,
            "val": "民勤县"
          }
        ]
      },
      {
        "id": 454,
        "val": "张掖市",
        "data": [
          {
            "id": 4800,
            "val": "临泽县"
          },
          {
            "id": 4801,
            "val": "山丹县"
          },
          {
            "id": 4802,
            "val": "民乐县"
          },
          {
            "id": 4803,
            "val": "甘州区"
          },
          {
            "id": 4804,
            "val": "肃南裕固族自治县"
          },
          {
            "id": 4805,
            "val": "高台县"
          }
        ]
      },
      {
        "id": 455,
        "val": "平凉市",
        "data": [
          {
            "id": 4806,
            "val": "华亭县"
          },
          {
            "id": 4807,
            "val": "崆峒区"
          },
          {
            "id": 4808,
            "val": "崇信县"
          },
          {
            "id": 4809,
            "val": "庄浪县"
          },
          {
            "id": 4810,
            "val": "泾川县"
          },
          {
            "id": 4811,
            "val": "灵台县"
          },
          {
            "id": 4812,
            "val": "静宁县"
          }
        ]
      },
      {
        "id": 456,
        "val": "酒泉市",
        "data": [
          {
            "id": 4813,
            "val": "敦煌市"
          },
          {
            "id": 4814,
            "val": "玉门市"
          },
          {
            "id": 4815,
            "val": "瓜州县（原安西县）"
          },
          {
            "id": 4816,
            "val": "肃北蒙古族自治县"
          },
          {
            "id": 4817,
            "val": "肃州区"
          },
          {
            "id": 4818,
            "val": "金塔县"
          },
          {
            "id": 4819,
            "val": "阿克塞哈萨克族自治县"
          }
        ]
      },
      {
        "id": 457,
        "val": "庆阳市",
        "data": [
          {
            "id": 4820,
            "val": "华池县"
          },
          {
            "id": 4821,
            "val": "合水县"
          },
          {
            "id": 4822,
            "val": "宁县"
          },
          {
            "id": 4823,
            "val": "庆城县"
          },
          {
            "id": 4824,
            "val": "正宁县"
          },
          {
            "id": 4825,
            "val": "环县"
          },
          {
            "id": 4826,
            "val": "西峰区"
          },
          {
            "id": 4827,
            "val": "镇原县"
          }
        ]
      },
      {
        "id": 458,
        "val": "定西市",
        "data": [
          {
            "id": 4828,
            "val": "临洮县"
          },
          {
            "id": 4829,
            "val": "安定区"
          },
          {
            "id": 4830,
            "val": "岷县"
          },
          {
            "id": 4831,
            "val": "渭源县"
          },
          {
            "id": 4832,
            "val": "漳县"
          },
          {
            "id": 4833,
            "val": "通渭县"
          },
          {
            "id": 4834,
            "val": "陇西县"
          }
        ]
      },
      {
        "id": 459,
        "val": "陇南市",
        "data": [
          {
            "id": 4835,
            "val": "两当县"
          },
          {
            "id": 4836,
            "val": "宕昌县"
          },
          {
            "id": 4837,
            "val": "康县"
          },
          {
            "id": 4838,
            "val": "徽县"
          },
          {
            "id": 4839,
            "val": "成县"
          },
          {
            "id": 4840,
            "val": "文县"
          },
          {
            "id": 4841,
            "val": "武都区"
          },
          {
            "id": 4842,
            "val": "礼县"
          },
          {
            "id": 4843,
            "val": "西和县"
          }
        ]
      },
      {
        "id": 460,
        "val": "临夏回族自治州",
        "data": [
          {
            "id": 4844,
            "val": "东乡族自治县"
          },
          {
            "id": 4845,
            "val": "临夏县"
          },
          {
            "id": 4846,
            "val": "临夏市"
          },
          {
            "id": 4847,
            "val": "和政县"
          },
          {
            "id": 4848,
            "val": "广河县"
          },
          {
            "id": 4849,
            "val": "康乐县"
          },
          {
            "id": 4850,
            "val": "永靖县"
          },
          {
            "id": 4851,
            "val": "积石山保安族东乡族撒拉族自治县"
          }
        ]
      },
      {
        "id": 461,
        "val": "甘南藏族自治州",
        "data": [
          {
            "id": 4852,
            "val": "临潭县"
          },
          {
            "id": 4853,
            "val": "卓尼县"
          },
          {
            "id": 4854,
            "val": "合作市"
          },
          {
            "id": 4855,
            "val": "夏河县"
          },
          {
            "id": 4856,
            "val": "玛曲县"
          },
          {
            "id": 4857,
            "val": "碌曲县"
          },
          {
            "id": 4858,
            "val": "舟曲县"
          },
          {
            "id": 4859,
            "val": "迭部县"
          }
        ]
      }
    ]
  },
  {
    "id": 29,
    "val": "青海",
    "data": [
      {
        "id": 462,
        "val": "西宁市",
        "data": [
          {
            "id": 4860,
            "val": "城东区"
          },
          {
            "id": 4861,
            "val": "城中区"
          },
          {
            "id": 4862,
            "val": "城北区"
          },
          {
            "id": 4863,
            "val": "城西区"
          },
          {
            "id": 4864,
            "val": "大通回族土族自治县"
          },
          {
            "id": 4865,
            "val": "湟中县"
          },
          {
            "id": 4866,
            "val": "湟源县"
          }
        ]
      },
      {
        "id": 463,
        "val": "海东地区",
        "data": [
          {
            "id": 4867,
            "val": "乐都县"
          },
          {
            "id": 4868,
            "val": "互助土族自治县"
          },
          {
            "id": 4869,
            "val": "化隆回族自治县"
          },
          {
            "id": 4870,
            "val": "平安县"
          },
          {
            "id": 4871,
            "val": "循化撒拉族自治县"
          },
          {
            "id": 4872,
            "val": "民和回族土族自治县"
          }
        ]
      },
      {
        "id": 464,
        "val": "海北藏族自治州",
        "data": [
          {
            "id": 4873,
            "val": "刚察县"
          },
          {
            "id": 4874,
            "val": "海晏县"
          },
          {
            "id": 4875,
            "val": "祁连县"
          },
          {
            "id": 4876,
            "val": "门源回族自治县"
          }
        ]
      },
      {
        "id": 465,
        "val": "黄南藏族自治州",
        "data": [
          {
            "id": 4877,
            "val": "同仁县"
          },
          {
            "id": 4878,
            "val": "尖扎县"
          },
          {
            "id": 4879,
            "val": "河南蒙古族自治县"
          },
          {
            "id": 4880,
            "val": "泽库县"
          }
        ]
      },
      {
        "id": 466,
        "val": "海南藏族自治州",
        "data": [
          {
            "id": 4881,
            "val": "共和县"
          },
          {
            "id": 4882,
            "val": "兴海县"
          },
          {
            "id": 4883,
            "val": "同德县"
          },
          {
            "id": 4884,
            "val": "贵南县"
          },
          {
            "id": 4885,
            "val": "贵德县"
          }
        ]
      },
      {
        "id": 467,
        "val": "果洛藏族自治州",
        "data": [
          {
            "id": 4886,
            "val": "久治县"
          },
          {
            "id": 4887,
            "val": "玛多县"
          },
          {
            "id": 4888,
            "val": "玛沁县"
          },
          {
            "id": 4889,
            "val": "班玛县"
          },
          {
            "id": 4890,
            "val": "甘德县"
          },
          {
            "id": 4891,
            "val": "达日县"
          }
        ]
      },
      {
        "id": 468,
        "val": "玉树藏族自治州",
        "data": [
          {
            "id": 4892,
            "val": "囊谦县"
          },
          {
            "id": 4893,
            "val": "曲麻莱县"
          },
          {
            "id": 4894,
            "val": "杂多县"
          },
          {
            "id": 4895,
            "val": "治多县"
          },
          {
            "id": 4896,
            "val": "玉树县"
          },
          {
            "id": 4897,
            "val": "称多县"
          }
        ]
      },
      {
        "id": 469,
        "val": "海西蒙古族藏族自治州",
        "data": [
          {
            "id": 4898,
            "val": "乌兰县"
          },
          {
            "id": 4899,
            "val": "冷湖行委"
          },
          {
            "id": 4900,
            "val": "大柴旦行委"
          },
          {
            "id": 4901,
            "val": "天峻县"
          },
          {
            "id": 4902,
            "val": "德令哈市"
          },
          {
            "id": 4903,
            "val": "格尔木市"
          },
          {
            "id": 4904,
            "val": "茫崖行委"
          },
          {
            "id": 4905,
            "val": "都兰县"
          }
        ]
      }
    ]
  },
  {
    "id": 30,
    "val": "宁夏",
    "data": [
      {
        "id": 470,
        "val": "银川市",
        "data": [
          {
            "id": 4906,
            "val": "兴庆区"
          },
          {
            "id": 4907,
            "val": "永宁县"
          },
          {
            "id": 4908,
            "val": "灵武市"
          },
          {
            "id": 4909,
            "val": "西夏区"
          },
          {
            "id": 4910,
            "val": "贺兰县"
          },
          {
            "id": 4911,
            "val": "金凤区"
          }
        ]
      },
      {
        "id": 471,
        "val": "石嘴山市",
        "data": [
          {
            "id": 4912,
            "val": "大武口区"
          },
          {
            "id": 4913,
            "val": "平罗县"
          },
          {
            "id": 4914,
            "val": "惠农区"
          }
        ]
      },
      {
        "id": 472,
        "val": "吴忠市",
        "data": [
          {
            "id": 4915,
            "val": "利通区"
          },
          {
            "id": 4916,
            "val": "同心县"
          },
          {
            "id": 4917,
            "val": "盐池县"
          },
          {
            "id": 4918,
            "val": "青铜峡市"
          }
        ]
      },
      {
        "id": 473,
        "val": "固原市",
        "data": [
          {
            "id": 4919,
            "val": "原州区"
          },
          {
            "id": 4920,
            "val": "彭阳县"
          },
          {
            "id": 4921,
            "val": "泾源县"
          },
          {
            "id": 4922,
            "val": "西吉县"
          },
          {
            "id": 4923,
            "val": "隆德县"
          }
        ]
      },
      {
        "id": 474,
        "val": "中卫市",
        "data": [
          {
            "id": 4924,
            "val": "中宁县"
          },
          {
            "id": 4925,
            "val": "沙坡头区"
          },
          {
            "id": 4926,
            "val": "海原县"
          }
        ]
      }
    ]
  },
  {
    "id": 31,
    "val": "新疆",
    "data": [
      {
        "id": 475,
        "val": "乌鲁木齐市",
        "data": [
          {
            "id": 4927,
            "val": "东山区"
          },
          {
            "id": 4928,
            "val": "乌鲁木齐县"
          },
          {
            "id": 4929,
            "val": "天山区"
          },
          {
            "id": 4930,
            "val": "头屯河区"
          },
          {
            "id": 4931,
            "val": "新市区"
          },
          {
            "id": 4932,
            "val": "水磨沟区"
          },
          {
            "id": 4933,
            "val": "沙依巴克区"
          },
          {
            "id": 4934,
            "val": "达坂城区"
          }
        ]
      },
      {
        "id": 476,
        "val": "克拉玛依市",
        "data": [
          {
            "id": 4935,
            "val": "乌尔禾区"
          },
          {
            "id": 4936,
            "val": "克拉玛依区"
          },
          {
            "id": 4937,
            "val": "独山子区"
          },
          {
            "id": 4938,
            "val": "白碱滩区"
          }
        ]
      },
      {
        "id": 477,
        "val": "吐鲁番地区",
        "data": [
          {
            "id": 4939,
            "val": "吐鲁番市"
          },
          {
            "id": 4940,
            "val": "托克逊县"
          },
          {
            "id": 4941,
            "val": "鄯善县"
          }
        ]
      },
      {
        "id": 478,
        "val": "哈密地区",
        "data": [
          {
            "id": 4942,
            "val": "伊吾县"
          },
          {
            "id": 4943,
            "val": "哈密市"
          },
          {
            "id": 4944,
            "val": "巴里坤哈萨克自治县"
          }
        ]
      },
      {
        "id": 479,
        "val": "昌吉回族自治州",
        "data": [
          {
            "id": 4945,
            "val": "吉木萨尔县"
          },
          {
            "id": 4946,
            "val": "呼图壁县"
          },
          {
            "id": 4947,
            "val": "奇台县"
          },
          {
            "id": 4948,
            "val": "昌吉市"
          },
          {
            "id": 4949,
            "val": "木垒哈萨克自治县"
          },
          {
            "id": 4950,
            "val": "玛纳斯县"
          },
          {
            "id": 4951,
            "val": "米泉市"
          },
          {
            "id": 4952,
            "val": "阜康市"
          }
        ]
      },
      {
        "id": 480,
        "val": "博尔塔拉蒙古自治州",
        "data": [
          {
            "id": 4953,
            "val": "博乐市"
          },
          {
            "id": 4954,
            "val": "温泉县"
          },
          {
            "id": 4955,
            "val": "精河县"
          }
        ]
      },
      {
        "id": 481,
        "val": "巴音郭楞蒙古自治州",
        "data": [
          {
            "id": 4956,
            "val": "博湖县"
          },
          {
            "id": 4957,
            "val": "和硕县"
          },
          {
            "id": 4958,
            "val": "和静县"
          },
          {
            "id": 4959,
            "val": "尉犁县"
          },
          {
            "id": 4960,
            "val": "库尔勒市"
          },
          {
            "id": 4961,
            "val": "焉耆回族自治县"
          },
          {
            "id": 4962,
            "val": "若羌县"
          },
          {
            "id": 4963,
            "val": "轮台县"
          }
        ]
      },
      {
        "id": 482,
        "val": "阿克苏地区",
        "data": [
          {
            "id": 4964,
            "val": "乌什县"
          },
          {
            "id": 4965,
            "val": "库车县"
          },
          {
            "id": 4966,
            "val": "拜城县"
          },
          {
            "id": 4967,
            "val": "新和县"
          },
          {
            "id": 4968,
            "val": "柯坪县"
          },
          {
            "id": 4969,
            "val": "沙雅县"
          },
          {
            "id": 4970,
            "val": "温宿县"
          },
          {
            "id": 4971,
            "val": "阿克苏市"
          },
          {
            "id": 4972,
            "val": "阿瓦提县"
          }
        ]
      },
      {
        "id": 483,
        "val": "克孜勒苏柯尔克孜自治州",
        "data": [
          {
            "id": 4973,
            "val": "乌恰县"
          },
          {
            "id": 4974,
            "val": "阿克陶县"
          },
          {
            "id": 4975,
            "val": "阿合奇县"
          },
          {
            "id": 4976,
            "val": "阿图什市"
          }
        ]
      },
      {
        "id": 484,
        "val": "喀什地区",
        "data": [
          {
            "id": 4977,
            "val": "伽师县"
          },
          {
            "id": 4978,
            "val": "叶城县"
          },
          {
            "id": 4979,
            "val": "喀什市"
          },
          {
            "id": 4980,
            "val": "塔什库尔干塔吉克自治县"
          },
          {
            "id": 4981,
            "val": "岳普湖县"
          },
          {
            "id": 4982,
            "val": "巴楚县"
          },
          {
            "id": 4983,
            "val": "泽普县"
          },
          {
            "id": 4984,
            "val": "疏勒县"
          },
          {
            "id": 4985,
            "val": "疏附县"
          },
          {
            "id": 4986,
            "val": "英吉沙县"
          },
          {
            "id": 4987,
            "val": "莎车县"
          },
          {
            "id": 4988,
            "val": "麦盖提县"
          }
        ]
      },
      {
        "id": 485,
        "val": "和田地区",
        "data": [
          {
            "id": 4989,
            "val": "于田县"
          },
          {
            "id": 4990,
            "val": "和田县"
          },
          {
            "id": 4991,
            "val": "和田市"
          },
          {
            "id": 4992,
            "val": "墨玉县"
          },
          {
            "id": 4993,
            "val": "民丰县"
          },
          {
            "id": 4994,
            "val": "洛浦县"
          },
          {
            "id": 4995,
            "val": "皮山县"
          },
          {
            "id": 4996,
            "val": "策勒县"
          }
        ]
      },
      {
        "id": 486,
        "val": "伊犁哈萨克自治州",
        "data": [
          {
            "id": 4997,
            "val": "伊宁县"
          },
          {
            "id": 4998,
            "val": "伊宁市"
          },
          {
            "id": 4999,
            "val": "奎屯市"
          },
          {
            "id": 5000,
            "val": "察布查尔锡伯自治县"
          },
          {
            "id": 5001,
            "val": "尼勒克县"
          },
          {
            "id": 5002,
            "val": "巩留县"
          },
          {
            "id": 5003,
            "val": "新源县"
          },
          {
            "id": 5004,
            "val": "昭苏县"
          },
          {
            "id": 5005,
            "val": "特克斯县"
          },
          {
            "id": 5006,
            "val": "霍城县"
          }
        ]
      },
      {
        "id": 487,
        "val": "塔城地区",
        "data": [
          {
            "id": 5007,
            "val": "乌苏市"
          },
          {
            "id": 5008,
            "val": "和布克赛尔蒙古自治县"
          },
          {
            "id": 5009,
            "val": "塔城市"
          },
          {
            "id": 5010,
            "val": "托里县"
          },
          {
            "id": 5011,
            "val": "沙湾县"
          },
          {
            "id": 5012,
            "val": "裕民县"
          },
          {
            "id": 5013,
            "val": "额敏县"
          }
        ]
      },
      {
        "id": 488,
        "val": "阿勒泰地区",
        "data": [
          {
            "id": 5014,
            "val": "吉木乃县"
          },
          {
            "id": 5015,
            "val": "哈巴河县"
          },
          {
            "id": 5016,
            "val": "富蕴县"
          },
          {
            "id": 5017,
            "val": "布尔津县"
          },
          {
            "id": 5018,
            "val": "福海县"
          },
          {
            "id": 5019,
            "val": "阿勒泰市"
          },
          {
            "id": 5020,
            "val": "青河县"
          }
        ]
      },
      {
        "id": 489,
        "val": "石河子市",
        "data": [
          {
            "id": 5021,
            "val": "石河子市"
          }
        ]
      },
      {
        "id": 490,
        "val": "阿拉尔市",
        "data": [
          {
            "id": 5022,
            "val": "阿拉尔市"
          }
        ]
      },
      {
        "id": 491,
        "val": "图木舒克市",
        "data": [
          {
            "id": 5023,
            "val": "图木舒克市"
          }
        ]
      },
      {
        "id": 492,
        "val": "五家渠市",
        "data": [
          {
            "id": 5024,
            "val": "五家渠市"
          }
        ]
      }
    ]
  }
]